TexasInstruments/am26x-hsp/src/am263x_init.c
#define CONFIG_TIMER0                  (0u)
#define CONFIG_TIMER0_BASE_ADDR        (0x52182000u)
#define CONFIG_TIMER0_INT_NUM          (98u)
#define CONFIG_TIMER0_INPUT_CLK_HZ     (25000000u)
#define CONFIG_TIMER0_INPUT_PRE_SCALER (1u)
/* This represents the required time period 'floored' to nearest usec */
#define CONFIG_TIMER0_USEC_PER_TICK    (1u)
/* This represents the required time period 'floored' to nearest nsec */
#define CONFIG_TIMER0_NSEC_PER_TICK    (1000u)
/* This represents the actual time period 'floored' to nearest nsec */
#define CONFIG_TIMER0_NSEC_PER_TICK_ACTUAL  (1000u)
/* NOTE: nsec per tick is used as input to the timer API */
/* NOTE: The actual nsec per tick that will be achieved depends on timer input clock hz precision */

#define TIMER_NUM_INSTANCES  (1u)

extern HwiP_Object gTimerHwiObj[TIMER_NUM_INSTANCES];
extern uint32_t gTimerBaseAddr[TIMER_NUM_INSTANCES];


HwiP_Object gTimerHwiObj[TIMER_NUM_INSTANCES];
uint32_t gTimerBaseAddr[TIMER_NUM_INSTANCES];


/* ----------- ClockP ----------- */
#define RTI0_CLOCK_SRC_MUX_ADDR (0x53208114u)
#define RTI0_CLOCK_SRC_WUCPUCLK (0x0u)
#define RTI0_BASE_ADDR     (0x52180000u)


ClockP_Config gClockConfig = {
    .timerBaseAddr = RTI0_BASE_ADDR, 
    .timerHwiIntNum = 84,
    .timerInputClkHz = 25000000,
    .timerInputPreScaler = 1,
    .usecPerTick = 1000,
    .intrPriority = 15,
};


#define BOOT_SECTION __attribute__((section(".text.boot")))

/* This function is called by _c_int00 */
void BOOT_SECTION __mpu_init() 
{
    MpuP_init();
    
    CacheP_init();
}

typedef struct Pinmux_Cfg{

    int16_t offset;

    uint32_t settings;

    uint8_t enable;
} PinmuxCfg;



/*
 * UART
 */


/* UART objects - initialized by the driver */
#define CONFIG_UART_NUM_LLD_INSTANCES 6
UARTLLD_Object gUartObject[CONFIG_UART_NUM_LLD_INSTANCES];
UARTLLD_Handle gUartHandleLld[CONFIG_UART_NUM_LLD_INSTANCES];
UARTLLD_InitObject gUartInitObject[CONFIG_UART_NUM_LLD_INSTANCES];
UART_Config gUartConfig[CONFIG_UART_NUM_INSTANCES];
uint32_t gUartConfigNum = 0;
Pinmux_PerCfg_t gPinMuxMainDomainCfg_init[140];


void Drivers_uartClose(void)
{
  
}


static PinmuxCfg gPinMuxMainDomainCfg[] = {

    
    {PIN_QSPI_CSN0, ( PIN_MODE(MW_PIN_QSPI0_CSN0_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ), MW_PINMUX0_ENABLE_SEL},
    {PIN_QSPI_CSN1, ( PIN_MODE(MW_PIN_QSPI0_CSN1_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ), MW_PINMUX1_ENABLE_SEL },
    {PIN_QSPI_CLK, ( PIN_MODE(MW_PIN_QSPI0_CLK_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ), MW_PINMUX2_ENABLE_SEL },
    {PIN_QSPI_D0, ( PIN_MODE(MW_PIN_QSPI0_D0_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ), MW_PINMUX3_ENABLE_SEL  },
    {PIN_QSPI_D1, ( PIN_MODE(MW_PIN_QSPI0_D1_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ), MW_PINMUX4_ENABLE_SEL  },
    {PIN_QSPI_D2, ( PIN_MODE(MW_PIN_QSPI0_D2_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ), MW_PINMUX5_ENABLE_SEL  },
    {PIN_QSPI_D3, ( PIN_MODE(MW_PIN_QSPI0_D3_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ), MW_PINMUX6_ENABLE_SEL  },
    {PIN_MCAN0_RX, ( PIN_MODE(MW_PIN_MCAN0_RX_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ), MW_PINMUX7_ENABLE_SEL  },
    {PIN_MCAN0_TX, ( PIN_MODE(MW_PIN_MCAN0_TX_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ), MW_PINMUX8_ENABLE_SEL  },
    {PIN_MCAN1_RX, ( PIN_MODE(MW_PIN_MCAN1_RX_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ), MW_PINMUX9_ENABLE_SEL  },
    {PIN_MCAN1_TX, ( PIN_MODE(MW_PIN_MCAN1_TX_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ), MW_PINMUX10_ENABLE_SEL  },
    {PIN_SPI0_CS0, ( PIN_MODE(MW_PIN_SPI0_CS0_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ), MW_PINMUX11_ENABLE_SEL  },
    {PIN_SPI0_CLK, ( PIN_MODE(MW_PIN_SPI0_CLK_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ), MW_PINMUX12_ENABLE_SEL  },
    {PIN_SPI0_D0, ( PIN_MODE(MW_PIN_SPI0_D0_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ), MW_PINMUX13_ENABLE_SEL  },
    {PIN_SPI0_D1, ( PIN_MODE(MW_PIN_SPI0_D1_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ), MW_PINMUX14_ENABLE_SEL  },
    {PIN_SPI1_CS0, ( PIN_MODE(MW_PIN_SPI1_CS0_IOMUX) | PIN_PULL_UP | PIN_SLEW_RATE_LOW ), MW_PINMUX15_ENABLE_SEL  },
    {PIN_SPI1_CLK, ( PIN_MODE(MW_PIN_SPI1_CLK_IOMUX) | PIN_PULL_UP | PIN_SLEW_RATE_LOW ), MW_PINMUX16_ENABLE_SEL  },
    {PIN_SPI1_D0, ( PIN_MODE(MW_PIN_SPI1_D0_IOMUX) | PIN_PULL_UP | PIN_SLEW_RATE_LOW ), MW_PINMUX17_ENABLE_SEL  },
    {PIN_SPI1_D1, ( PIN_MODE(MW_PIN_SPI1_D1_IOMUX) | PIN_PULL_UP | PIN_SLEW_RATE_LOW ), MW_PINMUX18_ENABLE_SEL  },
    {PIN_LIN1_RXD, ( PIN_MODE(MW_PIN_LIN1_RXD_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ), MW_PINMUX19_ENABLE_SEL  },
    {PIN_LIN1_TXD, ( PIN_MODE(MW_PIN_LIN1_TXD_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ), MW_PINMUX20_ENABLE_SEL  },
    {PIN_LIN2_RXD, ( PIN_MODE(MW_PIN_LIN2_RXD_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ), MW_PINMUX21_ENABLE_SEL  },
    {PIN_LIN2_TXD, ( PIN_MODE(MW_PIN_LIN2_TXD_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ), MW_PINMUX22_ENABLE_SEL  },
    {PIN_I2C1_SCL, ( PIN_MODE(MW_PIN_I2C1_SCL_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ), MW_PINMUX23_ENABLE_SEL  },
    {PIN_I2C1_SDA, ( PIN_MODE(MW_PIN_I2C1_SDA_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ), MW_PINMUX24_ENABLE_SEL  },
    {PIN_UART0_RTSN, ( PIN_MODE(MW_PIN_UART0_RTSN_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ), MW_PINMUX25_ENABLE_SEL  },
    {PIN_UART0_CTSN, ( PIN_MODE(MW_PIN_UART0_CTSN_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ), MW_PINMUX26_ENABLE_SEL  },
    {PIN_UART0_RXD, ( PIN_MODE(MW_PIN_UART0_RXD_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ), MW_PINMUX27_ENABLE_SEL  },
    {PIN_UART0_TXD, ( PIN_MODE(MW_PIN_UART0_TXD_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ), MW_PINMUX28_ENABLE_SEL  },
    {PIN_RGMII1_RXC, ( PIN_MODE(MW_PIN_RGMII1_RXC_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ), MW_PINMUX29_ENABLE_SEL  },
    {PIN_RGMII1_RX_CTL, ( PIN_MODE(MW_PIN_RGMII1_RX_CTL_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ), MW_PINMUX30_ENABLE_SEL  },
    {PIN_RGMII1_RD0, ( PIN_MODE(MW_PIN_RGMII1_RD0_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ), MW_PINMUX31_ENABLE_SEL  },
    {PIN_RGMII1_RD1, ( PIN_MODE(MW_PIN_RGMII1_RD1_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ), MW_PINMUX32_ENABLE_SEL  },
    {PIN_RGMII1_RD2, ( PIN_MODE(MW_PIN_RGMII1_RD2_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ), MW_PINMUX33_ENABLE_SEL  },
    {PIN_RGMII1_RD3, ( PIN_MODE(MW_PIN_RGMII1_RD3_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ), MW_PINMUX34_ENABLE_SEL  },
    {PIN_RGMII1_TXC, ( PIN_MODE(MW_PIN_RGMII1_TXC_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ), MW_PINMUX35_ENABLE_SEL  },
    {PIN_RGMII1_TX_CTL, ( PIN_MODE(MW_PIN_RGMII1_TX_CTL_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ), MW_PINMUX36_ENABLE_SEL  },
    {PIN_RGMII1_TD0, ( PIN_MODE(MW_PIN_RGMII1_TD0_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ), MW_PINMUX37_ENABLE_SEL  },
    {PIN_RGMII1_TD1, ( PIN_MODE(MW_PIN_RGMII1_TD1_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ), MW_PINMUX38_ENABLE_SEL  },
    {PIN_RGMII1_TD2, ( PIN_MODE(MW_PIN_RGMII1_TD2_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ), MW_PINMUX39_ENABLE_SEL  },
    {PIN_RGMII1_TD3, ( PIN_MODE(MW_PIN_RGMII1_TD3_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ), MW_PINMUX40_ENABLE_SEL  },
    {PIN_MDIO_MDIO, ( PIN_MODE(MW_PIN_MDIO0_MDIO_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ), MW_PINMUX41_ENABLE_SEL  },
    {PIN_MDIO_MDC, ( PIN_MODE(MW_PIN_MDIO0_MDC_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ), MW_PINMUX42_ENABLE_SEL  },
    {PIN_EPWM0_A, ( PIN_MODE(MW_PIN_EPWM0_A_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ), MW_PINMUX43_ENABLE_SEL  },
    {PIN_EPWM0_B, ( PIN_MODE(MW_PIN_EPWM0_B_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ), MW_PINMUX44_ENABLE_SEL  },
    {PIN_EPWM1_A, ( PIN_MODE(MW_PIN_EPWM1_A_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ), MW_PINMUX45_ENABLE_SEL  },
    {PIN_EPWM1_B, ( PIN_MODE(MW_PIN_EPWM1_B_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ), MW_PINMUX46_ENABLE_SEL  },
    {PIN_EPWM2_A, ( PIN_MODE(MW_PIN_EPWM2_A_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ), MW_PINMUX47_ENABLE_SEL  },
    {PIN_EPWM2_B, ( PIN_MODE(MW_PIN_EPWM2_B_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ), MW_PINMUX48_ENABLE_SEL  },
    {PIN_EPWM3_A, ( PIN_MODE(MW_PIN_EPWM3_A_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ), MW_PINMUX49_ENABLE_SEL  },
    {PIN_EPWM3_B, ( PIN_MODE(MW_PIN_EPWM3_B_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ), MW_PINMUX50_ENABLE_SEL  },
    {PIN_EPWM4_A, ( PIN_MODE(MW_PIN_EPWM4_A_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ), MW_PINMUX51_ENABLE_SEL  },
    {PIN_EPWM4_B, ( PIN_MODE(MW_PIN_EPWM4_B_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ), MW_PINMUX52_ENABLE_SEL  },
    {PIN_EPWM5_A, ( PIN_MODE(MW_PIN_EPWM5_A_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ), MW_PINMUX53_ENABLE_SEL  },
    {PIN_EPWM5_B, ( PIN_MODE(MW_PIN_EPWM5_B_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ), MW_PINMUX54_ENABLE_SEL  },
    {PIN_EPWM6_A, ( PIN_MODE(MW_PIN_EPWM6_A_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ), MW_PINMUX55_ENABLE_SEL  },
    {PIN_EPWM6_B, ( PIN_MODE(MW_PIN_EPWM6_B_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ), MW_PINMUX56_ENABLE_SEL  },
    {PIN_EPWM7_A, ( PIN_MODE(MW_PIN_EPWM7_A_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ), MW_PINMUX57_ENABLE_SEL  },
    {PIN_EPWM7_B, ( PIN_MODE(MW_PIN_EPWM7_B_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ), MW_PINMUX58_ENABLE_SEL  },
    {PIN_EPWM8_A, ( PIN_MODE(MW_PIN_EPWM8_A_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ), MW_PINMUX59_ENABLE_SEL  },
    {PIN_EPWM8_B, ( PIN_MODE(MW_PIN_EPWM8_B_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ), MW_PINMUX60_ENABLE_SEL  },
    {PIN_EPWM9_A, ( PIN_MODE(MW_PIN_EPWM9_A_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ), MW_PINMUX61_ENABLE_SEL  },
    {PIN_EPWM9_B, ( PIN_MODE(MW_PIN_EPWM9_B_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ), MW_PINMUX62_ENABLE_SEL  },
    {PIN_EPWM10_A, ( PIN_MODE(MW_PIN_EPWM10_A_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ), MW_PINMUX63_ENABLE_SEL  },
    {PIN_EPWM10_B, ( PIN_MODE(MW_PIN_EPWM10_B_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ), MW_PINMUX64_ENABLE_SEL  },
    {PIN_EPWM11_A, ( PIN_MODE(MW_PIN_EPWM11_A_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ), MW_PINMUX65_ENABLE_SEL  },
    {PIN_EPWM11_B, ( PIN_MODE(MW_PIN_EPWM11_B_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ), MW_PINMUX66_ENABLE_SEL  },
    {PIN_EPWM12_A, ( PIN_MODE(MW_PIN_EPWM12_A_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ), MW_PINMUX67_ENABLE_SEL  },
    {PIN_EPWM12_B, ( PIN_MODE(MW_PIN_EPWM12_B_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ), MW_PINMUX68_ENABLE_SEL  },
    {PIN_EPWM13_A, ( PIN_MODE(MW_PIN_EPWM13_A_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ), MW_PINMUX69_ENABLE_SEL  },
    {PIN_EPWM13_B, ( PIN_MODE(MW_PIN_EPWM13_B_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ), MW_PINMUX70_ENABLE_SEL  },
    {PIN_EPWM14_A, ( PIN_MODE(MW_PIN_EPWM14_A_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ), MW_PINMUX71_ENABLE_SEL  },
    {PIN_EPWM14_B, ( PIN_MODE(MW_PIN_EPWM14_B_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ), MW_PINMUX72_ENABLE_SEL  },
    {PIN_EPWM15_A, ( PIN_MODE(MW_PIN_EPWM15_A_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ), MW_PINMUX73_ENABLE_SEL  },
    {PIN_EPWM15_B, ( PIN_MODE(MW_PIN_EPWM15_B_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ), MW_PINMUX74_ENABLE_SEL  },
    {PIN_UART1_RXD, ( PIN_MODE(MW_PIN_UART1_RXD_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ), MW_PINMUX75_ENABLE_SEL  },
    {PIN_UART1_TXD, ( PIN_MODE(MW_PIN_UART1_TXD_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ), MW_PINMUX76_ENABLE_SEL  },
    {PIN_MMC_CLK, ( PIN_MODE(MW_PIN_MMC0_CLK_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ), MW_PINMUX77_ENABLE_SEL  },
    {PIN_MMC_CMD, ( PIN_MODE(MW_PIN_MMC0_CMD_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ), MW_PINMUX78_ENABLE_SEL  },
    {PIN_MMC_DAT0, ( PIN_MODE(MW_PIN_MMC0_D0_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ), MW_PINMUX79_ENABLE_SEL  },
    {PIN_MMC_DAT1, ( PIN_MODE(MW_PIN_MMC0_D1_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ), MW_PINMUX80_ENABLE_SEL  },
    {PIN_MMC_DAT2, ( PIN_MODE(MW_PIN_MMC0_D2_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ), MW_PINMUX81_ENABLE_SEL  },
    {PIN_MMC_DAT3, ( PIN_MODE(MW_PIN_MMC0_D3_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ), MW_PINMUX82_ENABLE_SEL  },
    {PIN_MMC_SDWP, ( PIN_MODE(MW_PIN_MMC0_WP_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ), MW_PINMUX83_ENABLE_SEL  },
    {PIN_MMC_SDCD, ( PIN_MODE(MW_PIN_MMC0_CD_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ), MW_PINMUX84_ENABLE_SEL  },
    {PIN_PR0_MDIO_MDIO, ( PIN_MODE(MW_PIN_PR0_MDIO0_MDIO_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ), MW_PINMUX85_ENABLE_SEL  },
    {PIN_PR0_MDIO_MDC, ( PIN_MODE(MW_PIN_PR0_MDIO0_MDC_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ), MW_PINMUX86_ENABLE_SEL  },
    {PIN_PR0_PRU0_GPIO5, ( PIN_MODE(MW_PIN_PR0_PRU0_GPIO5_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ), MW_PINMUX87_ENABLE_SEL  },
    {PIN_PR0_PRU0_GPIO9, ( PIN_MODE(MW_PIN_PR0_PRU0_GPIO9_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ), MW_PINMUX88_ENABLE_SEL  },
    {PIN_PR0_PRU0_GPIO10, ( PIN_MODE(MW_PIN_PR0_PRU0_GPIO10_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ), MW_PINMUX89_ENABLE_SEL  },
    {PIN_PR0_PRU0_GPIO8, ( PIN_MODE(MW_PIN_PR0_PRU0_GPIO8_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ), MW_PINMUX90_ENABLE_SEL  },
    {PIN_PR0_PRU0_GPIO6, ( PIN_MODE(MW_PIN_PR0_PRU0_GPIO6_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ), MW_PINMUX91_ENABLE_SEL  },
    {PIN_PR0_PRU0_GPIO4, ( PIN_MODE(MW_PIN_PR0_PRU0_GPIO4_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ), MW_PINMUX92_ENABLE_SEL  },
    {PIN_PR0_PRU0_GPIO0, ( PIN_MODE(MW_PIN_PR0_PRU0_GPIO0_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ), MW_PINMUX93_ENABLE_SEL  },
    {PIN_PR0_PRU0_GPIO1, ( PIN_MODE(MW_PIN_PR0_PRU0_GPIO1_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ), MW_PINMUX94_ENABLE_SEL  },
    {PIN_PR0_PRU0_GPIO2, ( PIN_MODE(MW_PIN_PR0_PRU0_GPIO2_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ), MW_PINMUX95_ENABLE_SEL  },
    {PIN_PR0_PRU0_GPIO3, ( PIN_MODE(MW_PIN_PR0_PRU0_GPIO3_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ), MW_PINMUX96_ENABLE_SEL  },
    {PIN_PR0_PRU0_GPIO16, ( PIN_MODE(MW_PIN_PR0_PRU0_GPIO16_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ), MW_PINMUX97_ENABLE_SEL  },
    {PIN_PR0_PRU0_GPIO15, ( PIN_MODE(MW_PIN_PR0_PRU0_GPIO15_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ), MW_PINMUX98_ENABLE_SEL  },
    {PIN_PR0_PRU0_GPIO11, ( PIN_MODE(MW_PIN_PR0_PRU0_GPIO11_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ), MW_PINMUX99_ENABLE_SEL  },
    {PIN_PR0_PRU0_GPIO12, ( PIN_MODE(MW_PIN_PR0_PRU0_GPIO12_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ), MW_PINMUX100_ENABLE_SEL  },
    {PIN_PR0_PRU0_GPIO13, ( PIN_MODE(MW_PIN_PR0_PRU0_GPIO13_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ), MW_PINMUX101_ENABLE_SEL  },
    {PIN_PR0_PRU0_GPIO14, ( PIN_MODE(MW_PIN_PR0_PRU0_GPIO14_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ), MW_PINMUX102_ENABLE_SEL  },
    {PIN_PR0_PRU1_GPIO5, ( PIN_MODE(MW_PIN_PR0_PRU1_GPIO5_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ), MW_PINMUX103_ENABLE_SEL  },
    {PIN_PR0_PRU1_GPIO9, ( PIN_MODE(MW_PIN_PR0_PRU1_GPIO9_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ), MW_PINMUX104_ENABLE_SEL  },
    {PIN_PR0_PRU1_GPIO10, ( PIN_MODE(MW_PIN_PR0_PRU1_GPIO10_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ), MW_PINMUX105_ENABLE_SEL  },
    {PIN_PR0_PRU1_GPIO8, ( PIN_MODE(MW_PIN_PR0_PRU1_GPIO8_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ), MW_PINMUX106_ENABLE_SEL  },
    {PIN_PR0_PRU1_GPIO6, ( PIN_MODE(MW_PIN_PR0_PRU1_GPIO6_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ), MW_PINMUX107_ENABLE_SEL  },
    {PIN_PR0_PRU1_GPIO4, ( PIN_MODE(MW_PIN_PR0_PRU1_GPIO4_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ), MW_PINMUX108_ENABLE_SEL  },
    {PIN_PR0_PRU1_GPIO0, ( PIN_MODE(MW_PIN_PR0_PRU1_GPIO0_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ), MW_PINMUX109_ENABLE_SEL  },
    {PIN_PR0_PRU1_GPIO1, ( PIN_MODE(MW_PIN_PR0_PRU1_GPIO1_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ), MW_PINMUX110_ENABLE_SEL  },
    {PIN_PR0_PRU1_GPIO2, ( PIN_MODE(MW_PIN_PR0_PRU1_GPIO2_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ), MW_PINMUX111_ENABLE_SEL  },
    {PIN_PR0_PRU1_GPIO3, ( PIN_MODE(MW_PIN_PR0_PRU1_GPIO3_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ), MW_PINMUX112_ENABLE_SEL  },
    {PIN_PR0_PRU1_GPIO16, ( PIN_MODE(MW_PIN_PR0_PRU1_GPIO16_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ), MW_PINMUX113_ENABLE_SEL  },
    {PIN_PR0_PRU1_GPIO15, ( PIN_MODE(MW_PIN_PR0_PRU1_GPIO15_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ), MW_PINMUX114_ENABLE_SEL  },
    {PIN_PR0_PRU1_GPIO11, ( PIN_MODE(MW_PIN_PR0_PRU1_GPIO11_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ), MW_PINMUX115_ENABLE_SEL  },
    {PIN_PR0_PRU1_GPIO12, ( PIN_MODE(MW_PIN_PR0_PRU1_GPIO12_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ), MW_PINMUX116_ENABLE_SEL  },
    {PIN_PR0_PRU1_GPIO13, ( PIN_MODE(MW_PIN_PR0_PRU1_GPIO13_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ), MW_PINMUX117_ENABLE_SEL  },
    {PIN_PR0_PRU1_GPIO14, ( PIN_MODE(MW_PIN_PR0_PRU1_GPIO14_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ), MW_PINMUX118_ENABLE_SEL  },
    {PIN_PR0_PRU1_GPIO19, ( PIN_MODE(MW_PIN_PR0_PRU1_GPIO19_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ), MW_PINMUX119_ENABLE_SEL  },
    {PIN_PR0_PRU1_GPIO18, ( PIN_MODE(MW_PIN_PR0_PRU1_GPIO18_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ), MW_PINMUX120_ENABLE_SEL  },
    {PIN_EXT_REFCLK0, ( PIN_MODE(MW_PIN_EXT_REFCLK0_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ), MW_PINMUX121_ENABLE_SEL  },
    {PIN_SDFM0_CLK0, ( PIN_MODE(MW_PIN_SDFM0_CLK0_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ), MW_PINMUX122_ENABLE_SEL  },
    {PIN_SDFM0_D0, ( PIN_MODE(MW_PIN_SDFM0_D0_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ), MW_PINMUX123_ENABLE_SEL  },
    {PIN_SDFM0_CLK1, ( PIN_MODE(MW_PIN_SDFM0_CLK1_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ), MW_PINMUX124_ENABLE_SEL  },
    {PIN_SDFM0_D1, ( PIN_MODE(MW_PIN_SDFM0_D1_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ), MW_PINMUX125_ENABLE_SEL  },
    {PIN_SDFM0_CLK2, ( PIN_MODE(MW_PIN_SDFM0_CLK2_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ), MW_PINMUX126_ENABLE_SEL  },
    {PIN_SDFM0_D2, ( PIN_MODE(MW_PIN_SDFM0_D2_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ), MW_PINMUX127_ENABLE_SEL  },
    {PIN_SDFM0_CLK3, ( PIN_MODE(MW_PIN_SDFM0_CLK3_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ), MW_PINMUX128_ENABLE_SEL  },
    {PIN_SDFM0_D3, ( PIN_MODE(MW_PIN_SDFM0_D3_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ), MW_PINMUX129_ENABLE_SEL  },
    {PIN_EQEP0_A, ( PIN_MODE(MW_PIN_EQEP0_A_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ), MW_PINMUX130_ENABLE_SEL  },
    {PIN_EQEP0_B, ( PIN_MODE(MW_PIN_EQEP0_B_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ), MW_PINMUX131_ENABLE_SEL  },
    {PIN_EQEP0_STROBE, ( PIN_MODE(MW_PIN_EQEP0_STROBE_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ), MW_PINMUX132_ENABLE_SEL  },
    {PIN_EQEP0_INDEX, ( PIN_MODE(MW_PIN_EQEP0_INDEX_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ), MW_PINMUX133_ENABLE_SEL  },
    {PIN_I2C0_SDA, ( PIN_MODE(MW_PIN_I2C0_SDA_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ), MW_PINMUX134_ENABLE_SEL  },
    {PIN_I2C0_SCL, ( PIN_MODE(MW_PIN_I2C0_SCL_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ), MW_PINMUX135_ENABLE_SEL  },
    {PIN_MCAN2_TX, ( PIN_MODE(MW_PIN_MCAN2_TX_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ), MW_PINMUX136_ENABLE_SEL  },
    {PIN_MCAN2_RX, ( PIN_MODE(MW_PIN_MCAN2_RX_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ), MW_PINMUX137_ENABLE_SEL  },
    {PIN_CLKOUT0, ( PIN_MODE(MW_PIN_CLKOUT0_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ), MW_PINMUX138_ENABLE_SEL  },
    
    {PINMUX_END, PINMUX_END, 1}
};



