TexasInstruments/am26x-hsp/src/am263x_init.c
#define SOC_MODULES_END     (0xFFFFFFFFu)
#define SOCModulesMaxConfig 13U

typedef struct {

    uint32_t moduleId;
    uint32_t clkId;
    uint32_t clkRate;

} SOC_ModuleClockFrequency;


uint32_t gSocModules[SOCModulesMaxConfig];
SOC_ModuleClockFrequency gSocModulesClockFrequency[SOCModulesMaxConfig];

void SOCModulesInit(void)
{
    uint8_t indx = 0;

    #ifdef MW_EXTMODE_RUNNING
    String board = STR(MW_TARGETHARDWARE);
    String XCPInterface = STR(MW_EXTMODE_CONFIGURATION);
    String ExtRunning = STR(MW_EXTMODE_RUNNING);
    #endif

    #ifdef MW_EXTMODE_RUNNING
    if((strcmp(XCPInterface, "XCP on Serial AM263")))
        gSocModules[indx] = SOC_RcmPeripheralId_LIN0_UART0; 
        gSocModulesClockFrequency[indx].moduleId = SOC_RcmPeripheralId_LIN0_UART0;
        gSocModulesClockFrequency[indx].clkId = SOC_RcmPeripheralClockSource_DPLL_PER_HSDIV0_CLKOUT1;
        gSocModulesClockFrequency[indx].clkRate = 48000000;
        indx++;
    #endif

   
        gSocModules[indx] = SOC_RcmPeripheralId_LIN0_UART0; 
        gSocModulesClockFrequency[indx].moduleId = SOC_RcmPeripheralId_LIN0_UART0;
        gSocModulesClockFrequency[indx].clkId = SOC_RcmPeripheralClockSource_DPLL_PER_HSDIV0_CLKOUT1;
        gSocModulesClockFrequency[indx].clkRate = 48000000;
        indx++;
    
    

    if(MW_UART1_ENABLE_SEL == 1)
    {
        gSocModules[indx] = SOC_RcmPeripheralId_LIN1_UART1; 
        gSocModulesClockFrequency[indx].moduleId = SOC_RcmPeripheralId_LIN1_UART1;
        gSocModulesClockFrequency[indx].clkId = SOC_RcmPeripheralClockSource_DPLL_PER_HSDIV0_CLKOUT1;
        gSocModulesClockFrequency[indx].clkRate = 48000000;
        indx++;
    }

    if(MW_UART2_ENABLE_SEL == 1)
    {
        gSocModules[indx] = SOC_RcmPeripheralId_LIN2_UART2; 
        gSocModulesClockFrequency[indx].moduleId = SOC_RcmPeripheralId_LIN2_UART2;
        gSocModulesClockFrequency[indx].clkId = SOC_RcmPeripheralClockSource_DPLL_PER_HSDIV0_CLKOUT1;
        gSocModulesClockFrequency[indx].clkRate = 48000000;
        indx++;
    }

    if(MW_UART3_ENABLE_SEL == 1)
    {
        gSocModules[indx] = SOC_RcmPeripheralId_LIN3_UART3; 
        gSocModulesClockFrequency[indx].moduleId = SOC_RcmPeripheralId_LIN3_UART3;
        gSocModulesClockFrequency[indx].clkId = SOC_RcmPeripheralClockSource_DPLL_PER_HSDIV0_CLKOUT1;
        gSocModulesClockFrequency[indx].clkRate = 48000000;
        indx++;
    }

    if(MW_UART4_ENABLE_SEL == 1)
    {
        gSocModules[indx] = SOC_RcmPeripheralId_LIN4_UART4; 
        gSocModulesClockFrequency[indx].moduleId = SOC_RcmPeripheralId_LIN4_UART4;
        gSocModulesClockFrequency[indx].clkId = SOC_RcmPeripheralClockSource_DPLL_PER_HSDIV0_CLKOUT1;
        gSocModulesClockFrequency[indx].clkRate = 48000000;
        indx++;
    }

    if(MW_UART5_ENABLE_SEL == 1)
    {
        gSocModules[indx] = SOC_RcmPeripheralId_LIN5_UART5; 
        gSocModulesClockFrequency[indx].moduleId = SOC_RcmPeripheralId_LIN5_UART5;
        gSocModulesClockFrequency[indx].clkId = SOC_RcmPeripheralClockSource_DPLL_PER_HSDIV0_CLKOUT1;
        gSocModulesClockFrequency[indx].clkRate = 48000000;
        indx++;
    }

    #ifdef MW_EXTMODE_RUNNING
    if((strcmp(XCPInterface, "CAN") == 0) && (strcmp(board, "AM263X ControlCard") == 0))
    {
        gSocModules[indx] = SOC_RcmPeripheralId_MCAN1; 
        gSocModulesClockFrequency[indx].moduleId = SOC_RcmPeripheralId_MCAN1;
        gSocModulesClockFrequency[indx].clkId = SOC_RcmPeripheralClockSource_DPLL_CORE_HSDIV0_CLKOUT0;
        gSocModulesClockFrequency[indx].clkRate = 80000000;
        indx++;   
    }
    else if((strcmp(XCPInterface, "CAN") == 0) && (strcmp(board, "AM263X LP") == 0))
    {
        gSocModules[indx] = SOC_RcmPeripheralId_MCAN0; 
        gSocModulesClockFrequency[indx].moduleId = SOC_RcmPeripheralId_MCAN0;
        gSocModulesClockFrequency[indx].clkId = SOC_RcmPeripheralClockSource_DPLL_CORE_HSDIV0_CLKOUT0;
        gSocModulesClockFrequency[indx].clkRate = 80000000;
        indx++;
    }
    #endif
    if(MW_ENABLE_MCAN0_SEL == 1)
    {
        gSocModules[indx] = SOC_RcmPeripheralId_MCAN0; 
        gSocModulesClockFrequency[indx].moduleId = SOC_RcmPeripheralId_MCAN0;
        gSocModulesClockFrequency[indx].clkId = SOC_RcmPeripheralClockSource_DPLL_CORE_HSDIV0_CLKOUT0;
        gSocModulesClockFrequency[indx].clkRate = 80000000;
        indx++;
    }

    if(MW_ENABLE_MCAN1_SEL == 1)
    {
        gSocModules[indx] = SOC_RcmPeripheralId_MCAN1; 
        gSocModulesClockFrequency[indx].moduleId = SOC_RcmPeripheralId_MCAN1;
        gSocModulesClockFrequency[indx].clkId = SOC_RcmPeripheralClockSource_DPLL_CORE_HSDIV0_CLKOUT0;
        gSocModulesClockFrequency[indx].clkRate = 80000000;
        indx++;;
    }
   

    if(MW_ENABLE_MCAN2_SEL == 1)
    {
        gSocModules[indx] = SOC_RcmPeripheralId_MCAN2; 
        gSocModulesClockFrequency[indx].moduleId = SOC_RcmPeripheralId_MCAN2;
        gSocModulesClockFrequency[indx].clkId = SOC_RcmPeripheralClockSource_DPLL_CORE_HSDIV0_CLKOUT0;
        gSocModulesClockFrequency[indx].clkRate = 80000000;
        indx++;
    }

    if(MW_ENABLE_MCAN3_SEL == 1)
    {
        gSocModules[indx] = SOC_RcmPeripheralId_MCAN3; 
        gSocModulesClockFrequency[indx].moduleId = SOC_RcmPeripheralId_MCAN3;
        gSocModulesClockFrequency[indx].clkId = SOC_RcmPeripheralClockSource_DPLL_CORE_HSDIV0_CLKOUT0;
        gSocModulesClockFrequency[indx].clkRate = 80000000;
        indx++;
    }

    if(MW_SDFM_ENABLE_SDFM0_SEL == 1)
    {
        gSocModules[indx] = SOC_RcmPeripheralId_CONTROLSS_PLL;
        gSocModulesClockFrequency[indx].moduleId = SOC_RcmPeripheralId_CONTROLSS_PLL;
        gSocModulesClockFrequency[indx].clkId = SOC_RcmPeripheralClockSource_DPLL_CORE_HSDIV0_CLKOUT2;
        gSocModulesClockFrequency[indx].clkRate = 400000000; 
        indx++;
    }

    if(MW_SDFM_ENABLE_SDFM1_SEL == 1)
    {
        gSocModules[indx] = SOC_RcmPeripheralId_CONTROLSS_PLL;
        gSocModulesClockFrequency[indx].moduleId = SOC_RcmPeripheralId_CONTROLSS_PLL;
        gSocModulesClockFrequency[indx].clkId = SOC_RcmPeripheralClockSource_DPLL_CORE_HSDIV0_CLKOUT2;
        gSocModulesClockFrequency[indx].clkRate = 400000000; 
        indx++;
    }

    gSocModules[indx] = SOC_MODULES_END;
    gSocModulesClockFrequency[indx].moduleId = SOC_MODULES_END; 
    gSocModulesClockFrequency[indx].clkId = SOC_MODULES_END;
    gSocModulesClockFrequency[indx].clkRate = SOC_MODULES_END;
}


void Module_clockEnable(void)
{
    int32_t status;
    uint32_t i = 0;

    while(gSocModules[i]!=SOC_MODULES_END)
    {
        status = SOC_moduleClockEnable(gSocModules[i], 1);
        DebugP_assertNoLog(status == SystemP_SUCCESS);
        i++;
    }
}

void Module_clockDisable(void)
{
    int32_t status;
    uint32_t i = 0;

    while(gSocModules[i]!=SOC_MODULES_END)
    {
        status = SOC_moduleClockEnable(gSocModules[i], 0);
        DebugP_assertNoLog(status == SystemP_SUCCESS);
        i++;
    }
}

void Module_clockSetFrequency(void)
{
    int32_t status;
    uint32_t i = 0;

    while(gSocModulesClockFrequency[i].moduleId!=SOC_MODULES_END)
    {
        status = SOC_moduleSetClockFrequency(
                    gSocModulesClockFrequency[i].moduleId,
                    gSocModulesClockFrequency[i].clkId,
                    gSocModulesClockFrequency[i].clkRate
                    );
        DebugP_assertNoLog(status == SystemP_SUCCESS);
        i++;
    }
}


