TexasInstruments/am26x-hsp/src/am263x_init.c
// uint32_t intrNumUART0, intrNumUART1, intrNumUART2, intrNumUART3, intrNumUART4, intrNumUART5, intrNum;
// uint32_t intrNum, intcBaseAddr;
// uint32_t gUartVimStsAddrUART0;
// uint32_t gUartVimStsClrMaskUART0;
// extern UARTLLD_InitObject gUartInitObject[CONFIG_UART_NUM_LLD_INSTANCES];
// UARTLLD_Handle gUartHandle0, gUartHandle1, gUartHandle2, gUartHandle3, gUartHandle4, gUartHandle5;
// #define CONFIG_UART0 (0U)
// #define CONFIG_UART_NUM_INSTANCES (1U)
// UARTLLD_Object gUartObject[CONFIG_UART_NUM_INSTANCES];
// UARTLLD_Handle gUartHandle[CONFIG_UART_NUM_INSTANCES];
// UARTLLD_InitObject gUartInitObject[CONFIG_UART_NUM_INSTANCES];
// {
//     {
//     .inputClkFreq       = 48000000U,
//     .baudRate           = 115200,
//     .dataLength         = UART_LEN_8,
//     .stopBits           = UART_STOPBITS_1,
//     .parityType         = UART_PARITY_NONE,
//     .readReturnMode     = UART_READ_RETURN_MODE_FULL,
//     .hwFlowControl      = FALSE,
//     .hwFlowControlThr   = UART_RXTRIGLVL_16,
//     .transferMode       = UART_CONFIG_MODE_POLLED,
//     .intrNum            = 38U,
//     .intrPriority       = 4U,
//     .operMode           = UART_OPER_MODE_16X,
//     .rxTrigLvl          = UART_RXTRIGLVL_8,
//     .txTrigLvl          = UART_TXTRIGLVL_32,
//     .clockP_get         = ClockP_getTicks,
//     .clockP_usecToTick  = ClockP_usecToTicks,
//     .writeCompleteCallbackFxn = NULL,
//     .readCompleteCallbackFxn  = NULL,
//     },

// };
void Drivers_uartOpen(void)
{

    int32_t status = UART_STATUS_SUCCESS;
    uint32_t baudRate, intrNum, baseAddr, BaudRateSel;
    uint32_t i;
    uint32_t intrNumUART0, intrNumUART1, intrNumUART2, intrNumUART3, intrNumUART4, intrNumUART5;
    
    for(i = 0; i<CONFIG_UART_NUM_LLD_INSTANCES; i++)
    {
        status = UART_STATUS_SUCCESS;
    //     intrNumUART0 = 38;
        gUartInitObject[i].inputClkFreq       = 48000000;
        gUartInitObject[i].hwFlowControl      = FALSE;
        gUartInitObject[i].hwFlowControlThr   = UART_RXTRIGLVL_16;
        gUartInitObject[i].clockP_get         = ClockP_getTicks;
        gUartInitObject[i].clockP_usecToTick  = ClockP_usecToTicks;
        

        if(i == 0)
        {
            intrNumUART0 = 38;
            BaudRateSel = MW_UART0_BAUDRATE_SEL;
            baseAddr = CSL_UART0_U_BASE;
            gUartInitObject[i].stopBits           = MW_UART0_STOP_BIT_SEL;
            gUartInitObject[i].operMode           = MW_UART0_OPERATIONAL_MODE_SEL;
            gUartInitObject[i].dataLength         = MW_UART0_DATALENGTH_SEL;
            gUartInitObject[i].readReturnMode     = MW_UART0_READ_RETURNMODE_SEL;
            if(MW_UART0_TRANSFER_MODE_SEL == 0)
                gUartInitObject[i].transferMode       = UART_CONFIG_MODE_POLLED;
            else if(MW_UART0_TRANSFER_MODE_SEL == 1)
                gUartInitObject[i].transferMode       = UART_CONFIG_MODE_USER_INTR;
            gUartInitObject[i].intrPriority       = 4U;
            gUartInitObject[i].intrNum            = intrNumUART0;

            if(MW_UART0_PARITY_TYPE_SEL == 0)
                gUartInitObject[i].parityType = UART_PARITY_NONE;
            else if(MW_UART0_PARITY_TYPE_SEL == 1)
                gUartInitObject[i].parityType = UART_PARITY_ODD;
            else if(MW_UART0_PARITY_TYPE_SEL == 2)
                gUartInitObject[i].parityType = UART_PARITY_EVEN;
            else if(MW_UART0_PARITY_TYPE_SEL == 3)
                gUartInitObject[i].parityType = UART_PARITY_FORCED0;
            else if(MW_UART0_PARITY_TYPE_SEL == 4)
                gUartInitObject[i].parityType = UART_PARITY_FORCED1;

            if(MW_UART0_RX_TRIGGER_SEL == 0)
                gUartInitObject[i].rxTrigLvl      = UART_RXTRIGLVL_1;
            else if(MW_UART0_RX_TRIGGER_SEL == 1)
                gUartInitObject[i].rxTrigLvl      = UART_RXTRIGLVL_8;
            else if(MW_UART0_RX_TRIGGER_SEL == 2)
                gUartInitObject[i].rxTrigLvl      = UART_RXTRIGLVL_16;
            else if(MW_UART0_RX_TRIGGER_SEL == 3)
                gUartInitObject[i].rxTrigLvl      = UART_RXTRIGLVL_56;
            else if(MW_UART0_RX_TRIGGER_SEL == 4)
                gUartInitObject[i].rxTrigLvl      = UART_RXTRIGLVL_60;

            if(MW_UART0_TX_TRIGGER_SEL == 0)
                gUartInitObject[i].txTrigLvl      = UART_TXTRIGLVL_1;
            else if(MW_UART0_TX_TRIGGER_SEL == 1)
                gUartInitObject[i].txTrigLvl      = UART_TXTRIGLVL_8;
            else if(MW_UART0_TX_TRIGGER_SEL == 2)
                gUartInitObject[i].txTrigLvl      = UART_TXTRIGLVL_16;
            else if(MW_UART0_TX_TRIGGER_SEL == 3)
                gUartInitObject[i].txTrigLvl      = UART_TXTRIGLVL_32;
            else if(MW_UART0_TX_TRIGGER_SEL == 4)
                gUartInitObject[i].txTrigLvl      = UART_TXTRIGLVL_56;
           
            gUartInitObject[i].writeCompleteCallbackFxn = NULL;
            gUartInitObject[i].readCompleteCallbackFxn  = NULL;
           

    
        }
        else if(i == 1)
        {
            BaudRateSel = MW_UART1_BAUDRATE_SEL;
            intrNumUART1 = 39;
            baseAddr = CSL_UART1_U_BASE;
            gUartInitObject[i].stopBits           = MW_UART1_STOP_BIT_SEL;
            gUartInitObject[i].operMode           = MW_UART1_OPERATIONAL_MODE_SEL;
            gUartInitObject[i].dataLength         = MW_UART1_DATALENGTH_SEL;
            gUartInitObject[i].readReturnMode     = MW_UART1_READ_RETURNMODE_SEL;
            if(MW_UART1_TRANSFER_MODE_SEL == 0)
                gUartInitObject[i].transferMode       = UART_CONFIG_MODE_POLLED;
            else if(MW_UART1_TRANSFER_MODE_SEL == 1)
                gUartInitObject[i].transferMode       = UART_CONFIG_MODE_USER_INTR;
            gUartInitObject[i].intrPriority       = 4U;
            gUartInitObject[i].intrNum            = intrNumUART1;

            if(MW_UART1_PARITY_TYPE_SEL == 0)
                gUartInitObject[i].parityType = UART_PARITY_NONE;
            else if(MW_UART1_PARITY_TYPE_SEL == 1)
                gUartInitObject[i].parityType = UART_PARITY_ODD;
            else if(MW_UART1_PARITY_TYPE_SEL == 2)
                gUartInitObject[i].parityType = UART_PARITY_EVEN;
            else if(MW_UART1_PARITY_TYPE_SEL == 3)
                gUartInitObject[i].parityType = UART_PARITY_FORCED0;
            else if(MW_UART1_PARITY_TYPE_SEL == 4)
                gUartInitObject[i].parityType = UART_PARITY_FORCED1;

            if(MW_UART1_RX_TRIGGER_SEL == 0)
                gUartInitObject[i].rxTrigLvl      = UART_RXTRIGLVL_1;
            else if(MW_UART1_RX_TRIGGER_SEL == 1)
                gUartInitObject[i].rxTrigLvl      = UART_RXTRIGLVL_8;
            else if(MW_UART1_RX_TRIGGER_SEL == 2)
                gUartInitObject[i].rxTrigLvl      = UART_RXTRIGLVL_16;
            else if(MW_UART1_RX_TRIGGER_SEL == 3)
                gUartInitObject[i].rxTrigLvl      = UART_RXTRIGLVL_56;
            else if(MW_UART1_RX_TRIGGER_SEL == 4)
                gUartInitObject[i].rxTrigLvl      = UART_RXTRIGLVL_60;

            if(MW_UART1_TX_TRIGGER_SEL == 0)
                gUartInitObject[i].txTrigLvl      = UART_TXTRIGLVL_1;
            else if(MW_UART1_TX_TRIGGER_SEL == 1)
                gUartInitObject[i].txTrigLvl      = UART_TXTRIGLVL_8;
            else if(MW_UART1_TX_TRIGGER_SEL == 2)
                gUartInitObject[i].txTrigLvl      = UART_TXTRIGLVL_16;
            else if(MW_UART1_TX_TRIGGER_SEL == 3)
                gUartInitObject[i].txTrigLvl      = UART_TXTRIGLVL_32;
            else if(MW_UART1_TX_TRIGGER_SEL == 4)
                gUartInitObject[i].txTrigLvl      = UART_TXTRIGLVL_56;
            
            gUartInitObject[i].writeCompleteCallbackFxn = NULL;
            gUartInitObject[i].readCompleteCallbackFxn  = NULL;
            
