TexasInstruments/am26x-hsp/src/am263x_init.c
        }
        else if(i == 5)
        {
            BaudRateSel = MW_UART5_BAUDRATE_SEL;
            intrNumUART5 = 43;
            baseAddr = CSL_UART5_U_BASE;
            gUartInitObject[i].stopBits           = MW_UART5_STOP_BIT_SEL;
            gUartInitObject[i].operMode           = MW_UART5_OPERATIONAL_MODE_SEL;
            gUartInitObject[i].dataLength         = MW_UART5_DATALENGTH_SEL;
            gUartInitObject[i].readReturnMode     = MW_UART5_READ_RETURNMODE_SEL;
            if(MW_UART5_TRANSFER_MODE_SEL == 0)
                gUartInitObject[i].transferMode       = UART_CONFIG_MODE_POLLED;
            else if(MW_UART5_TRANSFER_MODE_SEL == 1)
                gUartInitObject[i].transferMode       = UART_CONFIG_MODE_USER_INTR;
            gUartInitObject[i].intrPriority       = 4U;
            gUartInitObject[i].intrNum            = intrNumUART5;

            if(MW_UART5_PARITY_TYPE_SEL == 0)
                gUartInitObject[i].parityType = UART_PARITY_NONE;
            else if(MW_UART5_PARITY_TYPE_SEL == 1)
                gUartInitObject[i].parityType = UART_PARITY_ODD;
            else if(MW_UART5_PARITY_TYPE_SEL == 2)
                gUartInitObject[i].parityType = UART_PARITY_EVEN;
            else if(MW_UART5_PARITY_TYPE_SEL == 3)
                gUartInitObject[i].parityType = UART_PARITY_FORCED0;
            else if(MW_UART5_PARITY_TYPE_SEL == 4)
                gUartInitObject[i].parityType = UART_PARITY_FORCED1;

            if(MW_UART5_RX_TRIGGER_SEL == 0)
                gUartInitObject[i].rxTrigLvl      = UART_RXTRIGLVL_1;
            else if(MW_UART5_RX_TRIGGER_SEL == 1)
                gUartInitObject[i].rxTrigLvl      = UART_RXTRIGLVL_8;
            else if(MW_UART5_RX_TRIGGER_SEL == 2)
                gUartInitObject[i].rxTrigLvl      = UART_RXTRIGLVL_16;
            else if(MW_UART5_RX_TRIGGER_SEL == 3)
                gUartInitObject[i].rxTrigLvl      = UART_RXTRIGLVL_56;
            else if(MW_UART5_RX_TRIGGER_SEL == 4)
                gUartInitObject[i].rxTrigLvl      = UART_RXTRIGLVL_60;

            if(MW_UART5_TX_TRIGGER_SEL == 0)
                gUartInitObject[i].txTrigLvl      = UART_TXTRIGLVL_1;
            else if(MW_UART5_TX_TRIGGER_SEL == 1)
                gUartInitObject[i].txTrigLvl      = UART_TXTRIGLVL_8;
            else if(MW_UART5_TX_TRIGGER_SEL == 2)
                gUartInitObject[i].txTrigLvl      = UART_TXTRIGLVL_16;
            else if(MW_UART5_TX_TRIGGER_SEL == 3)
                gUartInitObject[i].txTrigLvl      = UART_TXTRIGLVL_32;
            else if(MW_UART5_TX_TRIGGER_SEL == 4)
                gUartInitObject[i].txTrigLvl      = UART_TXTRIGLVL_56;
           
            gUartInitObject[i].writeCompleteCallbackFxn = NULL;
            gUartInitObject[i].readCompleteCallbackFxn  = NULL;
            
          
        }
        
            if(BaudRateSel == 0)
                baudRate = 110;
            else if(BaudRateSel == 1)
                baudRate = 300;
            else if(BaudRateSel == 2)
                baudRate = 600;
            else if(BaudRateSel == 3)
                baudRate = 1200;
            else if(BaudRateSel == 4)
                baudRate = 2400;
            else if(BaudRateSel == 5)
                baudRate = 4800;
            else if(BaudRateSel == 6)
                baudRate = 9600;
            else if(BaudRateSel == 7)
                baudRate = 14400;
            else if(BaudRateSel == 8)
                baudRate = 19200;
            else if(BaudRateSel == 9)
                baudRate = 38400;
            else if(BaudRateSel == 10)
                baudRate = 57600;
            else if(BaudRateSel == 11)
                baudRate = 115200;
            else if(BaudRateSel == 12)
                baudRate = 230400;
            else if(BaudRateSel == 13)
                baudRate = 460800;
            else if(BaudRateSel == 14)
                baudRate = 921600;
            int32_t status = UART_STATUS_SUCCESS;
            gUartInitObject[i].baudRate   =  baudRate;
            gUartHandleLld[i]             = &gUartObject[i];
            gUartHandleLld[i]->state      = UART_STATE_RESET;
            gUartHandleLld[i]->baseAddr   = baseAddr;
            gUartHandleLld[i]->hUartInit = &gUartInitObject[i];


            if((i==0) && MW_UART0_ENABLE_SEL == 1)
            {
                  status += UART_lld_init(gUartHandleLld[i]);
            }
            else if((i==1) && MW_UART1_ENABLE_SEL == 1)
            {
                status += UART_lld_init(gUartHandleLld[i]);
            }
            else if((i==2) && MW_UART2_ENABLE_SEL == 1)
            {
                status += UART_lld_init(gUartHandleLld[i]);
            }
            else if((i==3) && MW_UART3_ENABLE_SEL == 1)
            {
                status += UART_lld_init(gUartHandleLld[i]);
            }
            else if((i==4) && MW_UART4_ENABLE_SEL == 1)
            {
                status += UART_lld_init(gUartHandleLld[i]);
            }
            else if((i==5) && MW_UART5_ENABLE_SEL == 1)
            {
                status += UART_lld_init(gUartHandleLld[i]);
            }

            DebugP_assert(status == UART_STATUS_SUCCESS);

            if(i == 0 && (MW_UART0_TRANSFER_MODE_SEL == 1) && (MW_UART0_ENABLE_SEL == 1))
            {
               
                if(MW_UART0_CTSINT_SEL == 1)
                   UART_intrEnable(gUartHandleLld[i]->baseAddr, UART_INTR_CTS);  
                if(MW_UART0_RTSINT_SEL == 1)
                    UART_intrEnable(gUartHandleLld[i]->baseAddr, UART_INTR_RTS); 
                if(MW_UART0_XOFFINT_SEL == 1)
                    UART_intrEnable(gUartHandleLld[i]->baseAddr, UART_INTR_XOFF); 
                if(MW_UART0_SLEEPMODEINT_SEL == 1)
                   UART_intrEnable(gUartHandleLld[i]->baseAddr, UART_INTR_SLEEPMODE); 
                if(MW_UART0_INTLINESTATUS_SEL == 1)
                    UART_intrEnable(gUartHandleLld[i]->baseAddr, UART_INTR_LINE_STAT);
                if(MW_UART0_MODEMSTATUSINT_SEL == 1)
                    UART_intrEnable(gUartHandleLld[i]->baseAddr, UART_INTR_MODEM_STAT);
                if(MW_UART0_RHRINT_SEL == 1)
                    UART_intrEnable(gUartHandleLld[i]->baseAddr, UART_INTR_RHR_CTI);
                if(MW_UART0_THREINT_SEL == 1)
                    UART_intrEnable(gUartHandleLld[i]->baseAddr, UART_INTR_THR);
                   
