TexasInstruments/am26x-hsp/src/am263x_init.c
            }
            else if(i == 1 && (MW_UART1_TRANSFER_MODE_SEL == 1) && (MW_UART1_ENABLE_SEL == 1))
            {
                if(MW_UART1_CTSINT_SEL == 1)
                   UART_intrEnable(gUartHandleLld[i]->baseAddr, UART_INTR_CTS);  
                if(MW_UART1_RTSINT_SEL == 1)
                    UART_intrEnable(gUartHandleLld[i]->baseAddr, UART_INTR_RTS); 
                if(MW_UART1_XOFFINT_SEL == 1)
                    UART_intrEnable(gUartHandleLld[i]->baseAddr, UART_INTR_XOFF); 
                if(MW_UART1_SLEEPMODEINT_SEL == 1)
                   UART_intrEnable(gUartHandleLld[i]->baseAddr, UART_INTR_SLEEPMODE); 
                if(MW_UART1_INTLINESTATUS_SEL == 1)
                    UART_intrEnable(gUartHandleLld[i]->baseAddr, UART_INTR_LINE_STAT);
                if(MW_UART1_MODEMSTATUSINT_SEL == 1)
                    UART_intrEnable(gUartHandleLld[i]->baseAddr, UART_INTR_MODEM_STAT);
                if(MW_UART1_RHRINT_SEL == 1)
                    UART_intrEnable(gUartHandleLld[i]->baseAddr, UART_INTR_RHR_CTI);
                if(MW_UART1_THREINT_SEL == 1)
                    UART_intrEnable(gUartHandleLld[i]->baseAddr, UART_INTR_THR);
                
            }
            else if(i == 2 && (MW_UART2_TRANSFER_MODE_SEL == 1) && (MW_UART2_ENABLE_SEL == 1))
            {
                if(MW_UART2_CTSINT_SEL == 1)
                   UART_intrEnable(gUartHandleLld[i]->baseAddr, UART_INTR_CTS);  
                if(MW_UART2_RTSINT_SEL == 1)
                    UART_intrEnable(gUartHandleLld[i]->baseAddr, UART_INTR_RTS); 
                if(MW_UART2_XOFFINT_SEL == 1)
                    UART_intrEnable(gUartHandleLld[i]->baseAddr, UART_INTR_XOFF); 
                if(MW_UART2_SLEEPMODEINT_SEL == 1)
                   UART_intrEnable(gUartHandleLld[i]->baseAddr, UART_INTR_SLEEPMODE); 
                if(MW_UART2_INTLINESTATUS_SEL == 1)
                    UART_intrEnable(gUartHandleLld[i]->baseAddr, UART_INTR_LINE_STAT);
                if(MW_UART2_MODEMSTATUSINT_SEL == 1)
                    UART_intrEnable(gUartHandleLld[i]->baseAddr, UART_INTR_MODEM_STAT);
                if(MW_UART2_RHRINT_SEL == 1)
                    UART_intrEnable(gUartHandleLld[i]->baseAddr, UART_INTR_RHR_CTI);
                if(MW_UART2_THREINT_SEL == 1)
                    UART_intrEnable(gUartHandleLld[i]->baseAddr, UART_INTR_THR);
            }
            else if(i == 3 && (MW_UART3_TRANSFER_MODE_SEL == 1) && (MW_UART3_ENABLE_SEL == 1))
            {
                if(MW_UART3_CTSINT_SEL == 1)
                   UART_intrEnable(gUartHandleLld[i]->baseAddr, UART_INTR_CTS);  
                if(MW_UART3_RTSINT_SEL == 1)
                    UART_intrEnable(gUartHandleLld[i]->baseAddr, UART_INTR_RTS); 
                if(MW_UART3_XOFFINT_SEL == 1)
                    UART_intrEnable(gUartHandleLld[i]->baseAddr, UART_INTR_XOFF); 
                if(MW_UART3_SLEEPMODEINT_SEL == 1)
                   UART_intrEnable(gUartHandleLld[i]->baseAddr, UART_INTR_SLEEPMODE); 
                if(MW_UART3_INTLINESTATUS_SEL == 1)
                    UART_intrEnable(gUartHandleLld[i]->baseAddr, UART_INTR_LINE_STAT);
                if(MW_UART3_MODEMSTATUSINT_SEL == 1)
                    UART_intrEnable(gUartHandleLld[i]->baseAddr, UART_INTR_MODEM_STAT);
                if(MW_UART3_RHRINT_SEL == 1)
                    UART_intrEnable(gUartHandleLld[i]->baseAddr, UART_INTR_RHR_CTI);
                if(MW_UART3_THREINT_SEL == 1)
                    UART_intrEnable(gUartHandleLld[i]->baseAddr, UART_INTR_THR);
            }
            else if(i == 4 && (MW_UART4_TRANSFER_MODE_SEL == 1) && (MW_UART4_ENABLE_SEL == 1))
            {
                if(MW_UART4_CTSINT_SEL == 1)
                   UART_intrEnable(gUartHandleLld[i]->baseAddr, UART_INTR_CTS);  
                if(MW_UART4_RTSINT_SEL == 1)
                    UART_intrEnable(gUartHandleLld[i]->baseAddr, UART_INTR_RTS); 
                if(MW_UART4_XOFFINT_SEL == 1)
                    UART_intrEnable(gUartHandleLld[i]->baseAddr, UART_INTR_XOFF); 
                if(MW_UART4_SLEEPMODEINT_SEL == 1)
                   UART_intrEnable(gUartHandleLld[i]->baseAddr, UART_INTR_SLEEPMODE); 
                if(MW_UART4_INTLINESTATUS_SEL == 1)
                    UART_intrEnable(gUartHandleLld[i]->baseAddr, UART_INTR_LINE_STAT);
                if(MW_UART4_MODEMSTATUSINT_SEL == 1)
                    UART_intrEnable(gUartHandleLld[i]->baseAddr, UART_INTR_MODEM_STAT);
                if(MW_UART4_RHRINT_SEL == 1)
                    UART_intrEnable(gUartHandleLld[i]->baseAddr, UART_INTR_RHR_CTI);
                if(MW_UART4_THREINT_SEL == 1)
                    UART_intrEnable(gUartHandleLld[i]->baseAddr, UART_INTR_THR);
            }
            else if(i == 5 && (MW_UART5_TRANSFER_MODE_SEL == 1) && (MW_UART5_ENABLE_SEL == 1))
            {
                
                if(MW_UART5_CTSINT_SEL == 1)
                   UART_intrEnable(gUartHandleLld[i]->baseAddr, UART_INTR_CTS);  
                if(MW_UART5_RTSINT_SEL == 1)
                    UART_intrEnable(gUartHandleLld[i]->baseAddr, UART_INTR_RTS); 
                if(MW_UART5_XOFFINT_SEL == 1)
                    UART_intrEnable(gUartHandleLld[i]->baseAddr, UART_INTR_XOFF); 
                if(MW_UART5_SLEEPMODEINT_SEL == 1)
                   UART_intrEnable(gUartHandleLld[i]->baseAddr, UART_INTR_SLEEPMODE); 
                if(MW_UART5_INTLINESTATUS_SEL == 1)
                    UART_intrEnable(gUartHandleLld[i]->baseAddr, UART_INTR_LINE_STAT);
                if(MW_UART5_MODEMSTATUSINT_SEL == 1)
                    UART_intrEnable(gUartHandleLld[i]->baseAddr, UART_INTR_MODEM_STAT);
                if(MW_UART5_RHRINT_SEL == 1)
                    UART_intrEnable(gUartHandleLld[i]->baseAddr, UART_INTR_RHR_CTI);
                if(MW_UART5_THREINT_SEL == 1)
                    UART_intrEnable(gUartHandleLld[i]->baseAddr, UART_INTR_THR);         
            }


