TexasInstruments/am26x-hsp/src/am263x_init.c
    }
}




void Pinmux_init(void)
{
    Pinmux_PerCfg_t gPinMuxMainDomainCfg_init[140];
    uint8_t j = 0;

    for(uint8_t i=0; i<140; i++)
    {
        if(gPinMuxMainDomainCfg[i].enable == TRUE)
        {
            gPinMuxMainDomainCfg_init[j].offset = gPinMuxMainDomainCfg[i].offset;
            gPinMuxMainDomainCfg_init[j].settings = gPinMuxMainDomainCfg[i].settings;
            gPinMuxMainDomainCfg[i].offset++;
            j++;
        }
    }
    Pinmux_config(gPinMuxMainDomainCfg_init, PINMUX_DOMAIN_ID_MAIN);


    // Pinmux_config(gPinMuxMainDomainCfg, PINMUX_DOMAIN_ID_MAIN);
    
}

void PowerClock_init(void)
{
    SOCModulesInit();   
    Module_clockEnable();
    Module_clockSetFrequency();
}


void Dpl_init(void)
{
    /* initialize Hwi but keep interrupts disabled */
    HwiP_init();

    /* init debug log zones early */
    /* Debug log init */
    /* UART console to use for reading input */
    DebugP_uartSetDrvIndex(CONFIG_UART0);


    /* set timer clock source */
    SOC_controlModuleUnlockMMR(SOC_DOMAIN_ID_MAIN, MSS_RCM_PARTITION0);
    *(volatile uint32_t*)(RTI0_CLOCK_SRC_MUX_ADDR) = RTI0_CLOCK_SRC_WUCPUCLK;
    SOC_controlModuleLockMMR(SOC_DOMAIN_ID_MAIN, MSS_RCM_PARTITION0);
    /* initialize Clock */
    ClockP_init();

    /* Enable interrupt handling */
    HwiP_enable();
}


void Drivers_intXbarOpen(void)
{
    /* Interrupt XBAR*/
    
    uint32_t group0_mask[32];
    uint32_t group1_mask[32];
    uint32_t group2_mask[32];
    uint32_t group3_mask[32];
    uint32_t group4_mask[32];
    uint32_t group5_mask[32];
    uint32_t group6_mask[32];

    group0_mask[0] = (uint32_t)MW_INTXBAR0_EPWMINT_SEL;
    group1_mask[0] = (uint32_t)MW_INTXBAR0_EPWMTZINT_SEL;
    group2_mask[0] = (uint32_t)MW_INTXBAR0_ADCINT_SEL;
    group3_mask[0] = (uint32_t)MW_INTXBAR0_FSIRXINT_SEL;
    group4_mask[0] = (uint32_t)MW_INTXBAR0_SDFMINT_SEL;
    group5_mask[0] = (uint32_t)MW_INTXBAR0_ECAPINT_SEL;
    group6_mask[0] = (uint32_t)MW_INTXBAR0_EQEPINT_SEL;
    group0_mask[1] = (uint32_t)MW_INTXBAR1_EPWMINT_SEL;
    group1_mask[1] = (uint32_t)MW_INTXBAR1_EPWMTZINT_SEL;
    group2_mask[1] = (uint32_t)MW_INTXBAR1_ADCINT_SEL;
    group3_mask[1] = (uint32_t)MW_INTXBAR1_FSIRXINT_SEL;
    group4_mask[1] = (uint32_t)MW_INTXBAR1_SDFMINT_SEL;
    group5_mask[1] = (uint32_t)MW_INTXBAR1_ECAPINT_SEL;
    group6_mask[1] = (uint32_t)MW_INTXBAR1_EQEPINT_SEL;
    group0_mask[2] = (uint32_t)MW_INTXBAR2_EPWMINT_SEL;
    group1_mask[2] = (uint32_t)MW_INTXBAR2_EPWMTZINT_SEL;
    group2_mask[2] = (uint32_t)MW_INTXBAR2_ADCINT_SEL;
    group3_mask[2] = (uint32_t)MW_INTXBAR2_FSIRXINT_SEL;
    group4_mask[2] = (uint32_t)MW_INTXBAR2_SDFMINT_SEL;
    group5_mask[2] = (uint32_t)MW_INTXBAR2_ECAPINT_SEL;
    group6_mask[2] = (uint32_t)MW_INTXBAR2_EQEPINT_SEL;
    group0_mask[3] = (uint32_t)MW_INTXBAR3_EPWMINT_SEL;
    group1_mask[3] = (uint32_t)MW_INTXBAR3_EPWMTZINT_SEL;
    group2_mask[3] = (uint32_t)MW_INTXBAR3_ADCINT_SEL;
    group3_mask[3] = (uint32_t)MW_INTXBAR3_FSIRXINT_SEL;
    group4_mask[3] = (uint32_t)MW_INTXBAR3_SDFMINT_SEL;
    group5_mask[3] = (uint32_t)MW_INTXBAR3_ECAPINT_SEL;
    group6_mask[3] = (uint32_t)MW_INTXBAR3_EQEPINT_SEL;
    group0_mask[4] = (uint32_t)MW_INTXBAR4_EPWMINT_SEL;
    group1_mask[4] = (uint32_t)MW_INTXBAR4_EPWMTZINT_SEL;
    group2_mask[4] = (uint32_t)MW_INTXBAR4_ADCINT_SEL;
    group3_mask[4] = (uint32_t)MW_INTXBAR4_FSIRXINT_SEL;
    group4_mask[4] = (uint32_t)MW_INTXBAR4_SDFMINT_SEL;
    group5_mask[4] = (uint32_t)MW_INTXBAR4_ECAPINT_SEL;
    group6_mask[4] = (uint32_t)MW_INTXBAR4_EQEPINT_SEL;
    group0_mask[5] = (uint32_t)MW_INTXBAR5_EPWMINT_SEL;
    group1_mask[5] = (uint32_t)MW_INTXBAR5_EPWMTZINT_SEL;
    group2_mask[5] = (uint32_t)MW_INTXBAR5_ADCINT_SEL;
    group3_mask[5] = (uint32_t)MW_INTXBAR5_FSIRXINT_SEL;
    group4_mask[5] = (uint32_t)MW_INTXBAR5_SDFMINT_SEL;
    group5_mask[5] = (uint32_t)MW_INTXBAR5_ECAPINT_SEL;
    group6_mask[5] = (uint32_t)MW_INTXBAR5_EQEPINT_SEL;
    group0_mask[6] = (uint32_t)MW_INTXBAR6_EPWMINT_SEL;
    group1_mask[6] = (uint32_t)MW_INTXBAR6_EPWMTZINT_SEL;
    group2_mask[6] = (uint32_t)MW_INTXBAR6_ADCINT_SEL;
    group3_mask[6] = (uint32_t)MW_INTXBAR6_FSIRXINT_SEL;
    group4_mask[6] = (uint32_t)MW_INTXBAR6_SDFMINT_SEL;
    group5_mask[6] = (uint32_t)MW_INTXBAR6_ECAPINT_SEL;
    group6_mask[6] = (uint32_t)MW_INTXBAR6_EQEPINT_SEL;
    group0_mask[7] = (uint32_t)MW_INTXBAR7_EPWMINT_SEL;
    group1_mask[7] = (uint32_t)MW_INTXBAR7_EPWMTZINT_SEL;
    group2_mask[7] = (uint32_t)MW_INTXBAR7_ADCINT_SEL;
    group3_mask[7] = (uint32_t)MW_INTXBAR7_FSIRXINT_SEL;
    group4_mask[7] = (uint32_t)MW_INTXBAR7_SDFMINT_SEL;
    group5_mask[7] = (uint32_t)MW_INTXBAR7_ECAPINT_SEL;
    group6_mask[7] = (uint32_t)MW_INTXBAR7_EQEPINT_SEL;
    group0_mask[8] = (uint32_t)MW_INTXBAR8_EPWMINT_SEL;
    group1_mask[8] = (uint32_t)MW_INTXBAR8_EPWMTZINT_SEL;
    group2_mask[8] = (uint32_t)MW_INTXBAR8_ADCINT_SEL;
    group3_mask[8] = (uint32_t)MW_INTXBAR8_FSIRXINT_SEL;
    group4_mask[8] = (uint32_t)MW_INTXBAR8_SDFMINT_SEL;
    group5_mask[8] = (uint32_t)MW_INTXBAR8_ECAPINT_SEL;
    group6_mask[8] = (uint32_t)MW_INTXBAR8_EQEPINT_SEL;
    group0_mask[9] = (uint32_t)MW_INTXBAR9_EPWMINT_SEL;
    group1_mask[9] = (uint32_t)MW_INTXBAR9_EPWMTZINT_SEL;
    group2_mask[9] = (uint32_t)MW_INTXBAR9_ADCINT_SEL;
    group3_mask[9] = (uint32_t)MW_INTXBAR9_FSIRXINT_SEL;
    group4_mask[9] = (uint32_t)MW_INTXBAR9_SDFMINT_SEL;
    group5_mask[9] = (uint32_t)MW_INTXBAR9_ECAPINT_SEL;
    group6_mask[9] = (uint32_t)MW_INTXBAR9_EQEPINT_SEL;
    group0_mask[10] = (uint32_t)MW_INTXBAR10_EPWMINT_SEL;
    group1_mask[10] = (uint32_t)MW_INTXBAR10_EPWMTZINT_SEL;
    group2_mask[10] = (uint32_t)MW_INTXBAR10_ADCINT_SEL;
    group3_mask[10] = (uint32_t)MW_INTXBAR10_FSIRXINT_SEL;
    group4_mask[10] = (uint32_t)MW_INTXBAR10_SDFMINT_SEL;
    group5_mask[10] = (uint32_t)MW_INTXBAR10_ECAPINT_SEL;
    group6_mask[10] = (uint32_t)MW_INTXBAR10_EQEPINT_SEL;
    group0_mask[11] = (uint32_t)MW_INTXBAR11_EPWMINT_SEL;
    group1_mask[11] = (uint32_t)MW_INTXBAR11_EPWMTZINT_SEL;
    group2_mask[11] = (uint32_t)MW_INTXBAR11_ADCINT_SEL;
    group3_mask[11] = (uint32_t)MW_INTXBAR11_FSIRXINT_SEL;
    group4_mask[11] = (uint32_t)MW_INTXBAR11_SDFMINT_SEL;
    group5_mask[11] = (uint32_t)MW_INTXBAR11_ECAPINT_SEL;
    group6_mask[11] = (uint32_t)MW_INTXBAR11_EQEPINT_SEL;
    group0_mask[12] = (uint32_t)MW_INTXBAR12_EPWMINT_SEL;
    group1_mask[12] = (uint32_t)MW_INTXBAR12_EPWMTZINT_SEL;
    group2_mask[12] = (uint32_t)MW_INTXBAR12_ADCINT_SEL;
    group3_mask[12] = (uint32_t)MW_INTXBAR12_FSIRXINT_SEL;
    group4_mask[12] = (uint32_t)MW_INTXBAR12_SDFMINT_SEL;
    group5_mask[12] = (uint32_t)MW_INTXBAR12_ECAPINT_SEL;
    group6_mask[12] = (uint32_t)MW_INTXBAR12_EQEPINT_SEL;
    group0_mask[13] = (uint32_t)MW_INTXBAR13_EPWMINT_SEL;
    group1_mask[13] = (uint32_t)MW_INTXBAR13_EPWMTZINT_SEL;
    group2_mask[13] = (uint32_t)MW_INTXBAR13_ADCINT_SEL;
    group3_mask[13] = (uint32_t)MW_INTXBAR13_FSIRXINT_SEL;
    group4_mask[13] = (uint32_t)MW_INTXBAR13_SDFMINT_SEL;
    group5_mask[13] = (uint32_t)MW_INTXBAR13_ECAPINT_SEL;
    group6_mask[13] = (uint32_t)MW_INTXBAR13_EQEPINT_SEL;
    group0_mask[14] = (uint32_t)MW_INTXBAR14_EPWMINT_SEL;
    group1_mask[14] = (uint32_t)MW_INTXBAR14_EPWMTZINT_SEL;
    group2_mask[14] = (uint32_t)MW_INTXBAR14_ADCINT_SEL;
    group3_mask[14] = (uint32_t)MW_INTXBAR14_FSIRXINT_SEL;
    group4_mask[14] = (uint32_t)MW_INTXBAR14_SDFMINT_SEL;
    group5_mask[14] = (uint32_t)MW_INTXBAR14_ECAPINT_SEL;
    group6_mask[14] = (uint32_t)MW_INTXBAR14_EQEPINT_SEL;
    group0_mask[15] = (uint32_t)MW_INTXBAR15_EPWMINT_SEL;
    group1_mask[15] = (uint32_t)MW_INTXBAR15_EPWMTZINT_SEL;
    group2_mask[15] = (uint32_t)MW_INTXBAR15_ADCINT_SEL;
    group3_mask[15] = (uint32_t)MW_INTXBAR15_FSIRXINT_SEL;
    group4_mask[15] = (uint32_t)MW_INTXBAR15_SDFMINT_SEL;
    group5_mask[15] = (uint32_t)MW_INTXBAR15_ECAPINT_SEL;
    group6_mask[15] = (uint32_t)MW_INTXBAR15_EQEPINT_SEL;
    group0_mask[16] = (uint32_t)MW_INTXBAR16_EPWMINT_SEL;
    group1_mask[16] = (uint32_t)MW_INTXBAR16_EPWMTZINT_SEL;
    group2_mask[16] = (uint32_t)MW_INTXBAR16_ADCINT_SEL;
    group3_mask[16] = (uint32_t)MW_INTXBAR16_FSIRXINT_SEL;
    group4_mask[16] = (uint32_t)MW_INTXBAR16_SDFMINT_SEL;
    group5_mask[16] = (uint32_t)MW_INTXBAR16_ECAPINT_SEL;
    group6_mask[16] = (uint32_t)MW_INTXBAR16_EQEPINT_SEL;
    group0_mask[17] = (uint32_t)MW_INTXBAR17_EPWMINT_SEL;
    group1_mask[17] = (uint32_t)MW_INTXBAR17_EPWMTZINT_SEL;
    group2_mask[17] = (uint32_t)MW_INTXBAR17_ADCINT_SEL;
    group3_mask[17] = (uint32_t)MW_INTXBAR17_FSIRXINT_SEL;
    group4_mask[17] = (uint32_t)MW_INTXBAR17_SDFMINT_SEL;
    group5_mask[17] = (uint32_t)MW_INTXBAR17_ECAPINT_SEL;
    group6_mask[17] = (uint32_t)MW_INTXBAR17_EQEPINT_SEL;
    group0_mask[18] = (uint32_t)MW_INTXBAR18_EPWMINT_SEL;
    group1_mask[18] = (uint32_t)MW_INTXBAR18_EPWMTZINT_SEL;
    group2_mask[18] = (uint32_t)MW_INTXBAR18_ADCINT_SEL;
    group3_mask[18] = (uint32_t)MW_INTXBAR18_FSIRXINT_SEL;
    group4_mask[18] = (uint32_t)MW_INTXBAR18_SDFMINT_SEL;
    group5_mask[18] = (uint32_t)MW_INTXBAR18_ECAPINT_SEL;
    group6_mask[18] = (uint32_t)MW_INTXBAR18_EQEPINT_SEL;
    group0_mask[19] = (uint32_t)MW_INTXBAR19_EPWMINT_SEL;
    group1_mask[19] = (uint32_t)MW_INTXBAR19_EPWMTZINT_SEL;
    group2_mask[19] = (uint32_t)MW_INTXBAR19_ADCINT_SEL;
    group3_mask[19] = (uint32_t)MW_INTXBAR19_FSIRXINT_SEL;
    group4_mask[19] = (uint32_t)MW_INTXBAR19_SDFMINT_SEL;
    group5_mask[19] = (uint32_t)MW_INTXBAR19_ECAPINT_SEL;
    group6_mask[19] = (uint32_t)MW_INTXBAR19_EQEPINT_SEL;
    group0_mask[20] = (uint32_t)MW_INTXBAR20_EPWMINT_SEL;
    group1_mask[20] = (uint32_t)MW_INTXBAR20_EPWMTZINT_SEL;
    group2_mask[20] = (uint32_t)MW_INTXBAR20_ADCINT_SEL;
    group3_mask[20] = (uint32_t)MW_INTXBAR20_FSIRXINT_SEL;
    group4_mask[20] = (uint32_t)MW_INTXBAR20_SDFMINT_SEL;
    group5_mask[20] = (uint32_t)MW_INTXBAR20_ECAPINT_SEL;
    group6_mask[20] = (uint32_t)MW_INTXBAR20_EQEPINT_SEL;
    group0_mask[21] = (uint32_t)MW_INTXBAR21_EPWMINT_SEL;
    group1_mask[21] = (uint32_t)MW_INTXBAR21_EPWMTZINT_SEL;
    group2_mask[21] = (uint32_t)MW_INTXBAR21_ADCINT_SEL;
    group3_mask[21] = (uint32_t)MW_INTXBAR21_FSIRXINT_SEL;
    group4_mask[21] = (uint32_t)MW_INTXBAR21_SDFMINT_SEL;
    group5_mask[21] = (uint32_t)MW_INTXBAR21_ECAPINT_SEL;
    group6_mask[21] = (uint32_t)MW_INTXBAR21_EQEPINT_SEL;
    group0_mask[22] = (uint32_t)MW_INTXBAR22_EPWMINT_SEL;
    group1_mask[22] = (uint32_t)MW_INTXBAR22_EPWMTZINT_SEL;
    group2_mask[22] = (uint32_t)MW_INTXBAR22_ADCINT_SEL;
    group3_mask[22] = (uint32_t)MW_INTXBAR22_FSIRXINT_SEL;
    group4_mask[22] = (uint32_t)MW_INTXBAR22_SDFMINT_SEL;
    group5_mask[22] = (uint32_t)MW_INTXBAR22_ECAPINT_SEL;
    group6_mask[22] = (uint32_t)MW_INTXBAR22_EQEPINT_SEL;
    group0_mask[23] = (uint32_t)MW_INTXBAR23_EPWMINT_SEL;
    group1_mask[23] = (uint32_t)MW_INTXBAR23_EPWMTZINT_SEL;
    group2_mask[23] = (uint32_t)MW_INTXBAR23_ADCINT_SEL;
    group3_mask[23] = (uint32_t)MW_INTXBAR23_FSIRXINT_SEL;
    group4_mask[23] = (uint32_t)MW_INTXBAR23_SDFMINT_SEL;
    group5_mask[23] = (uint32_t)MW_INTXBAR23_ECAPINT_SEL;
    group6_mask[23] = (uint32_t)MW_INTXBAR23_EQEPINT_SEL;
    group0_mask[24] = (uint32_t)MW_INTXBAR24_EPWMINT_SEL;
    group1_mask[24] = (uint32_t)MW_INTXBAR24_EPWMTZINT_SEL;
    group2_mask[24] = (uint32_t)MW_INTXBAR24_ADCINT_SEL;
    group3_mask[24] = (uint32_t)MW_INTXBAR24_FSIRXINT_SEL;
    group4_mask[24] = (uint32_t)MW_INTXBAR24_SDFMINT_SEL;
    group5_mask[24] = (uint32_t)MW_INTXBAR24_ECAPINT_SEL;
    group6_mask[24] = (uint32_t)MW_INTXBAR24_EQEPINT_SEL;
    group0_mask[25] = (uint32_t)MW_INTXBAR25_EPWMINT_SEL;
    group1_mask[25] = (uint32_t)MW_INTXBAR25_EPWMTZINT_SEL;
    group2_mask[25] = (uint32_t)MW_INTXBAR25_ADCINT_SEL;
    group3_mask[25] = (uint32_t)MW_INTXBAR25_FSIRXINT_SEL;
    group4_mask[25] = (uint32_t)MW_INTXBAR25_SDFMINT_SEL;
    group5_mask[25] = (uint32_t)MW_INTXBAR25_ECAPINT_SEL;
    group6_mask[25] = (uint32_t)MW_INTXBAR25_EQEPINT_SEL;
    group0_mask[26] = (uint32_t)MW_INTXBAR26_EPWMINT_SEL;
    group1_mask[26] = (uint32_t)MW_INTXBAR26_EPWMTZINT_SEL;
    group2_mask[26] = (uint32_t)MW_INTXBAR26_ADCINT_SEL;
    group3_mask[26] = (uint32_t)MW_INTXBAR26_FSIRXINT_SEL;
    group4_mask[26] = (uint32_t)MW_INTXBAR26_SDFMINT_SEL;
    group5_mask[26] = (uint32_t)MW_INTXBAR26_ECAPINT_SEL;
    group6_mask[26] = (uint32_t)MW_INTXBAR26_EQEPINT_SEL;
    group0_mask[27] = (uint32_t)MW_INTXBAR27_EPWMINT_SEL;
    group1_mask[27] = (uint32_t)MW_INTXBAR27_EPWMTZINT_SEL;
    group2_mask[27] = (uint32_t)MW_INTXBAR27_ADCINT_SEL;
    group3_mask[27] = (uint32_t)MW_INTXBAR27_FSIRXINT_SEL;
    group4_mask[27] = (uint32_t)MW_INTXBAR27_SDFMINT_SEL;
    group5_mask[27] = (uint32_t)MW_INTXBAR27_ECAPINT_SEL;
    group6_mask[27] = (uint32_t)MW_INTXBAR27_EQEPINT_SEL;
    group0_mask[28] = (uint32_t)MW_INTXBAR28_EPWMINT_SEL;
    group1_mask[28] = (uint32_t)MW_INTXBAR28_EPWMTZINT_SEL;
    group2_mask[28] = (uint32_t)MW_INTXBAR28_ADCINT_SEL;
    group3_mask[28] = (uint32_t)MW_INTXBAR28_FSIRXINT_SEL;
    group4_mask[28] = (uint32_t)MW_INTXBAR28_SDFMINT_SEL;
    group5_mask[28] = (uint32_t)MW_INTXBAR28_ECAPINT_SEL;
    group6_mask[28] = (uint32_t)MW_INTXBAR28_EQEPINT_SEL;
    group0_mask[29] = (uint32_t)MW_INTXBAR29_EPWMINT_SEL;
    group1_mask[29] = (uint32_t)MW_INTXBAR29_EPWMTZINT_SEL;
    group2_mask[29] = (uint32_t)MW_INTXBAR29_ADCINT_SEL;
    group3_mask[29] = (uint32_t)MW_INTXBAR29_FSIRXINT_SEL;
    group4_mask[29] = (uint32_t)MW_INTXBAR29_SDFMINT_SEL;
    group5_mask[29] = (uint32_t)MW_INTXBAR29_ECAPINT_SEL;
    group6_mask[29] = (uint32_t)MW_INTXBAR29_EQEPINT_SEL;
    group0_mask[30] = (uint32_t)MW_INTXBAR30_EPWMINT_SEL;
    group1_mask[30] = (uint32_t)MW_INTXBAR30_EPWMTZINT_SEL;
    group2_mask[30] = (uint32_t)MW_INTXBAR30_ADCINT_SEL;
    group3_mask[30] = (uint32_t)MW_INTXBAR30_FSIRXINT_SEL;
    group4_mask[30] = (uint32_t)MW_INTXBAR30_SDFMINT_SEL;
    group5_mask[30] = (uint32_t)MW_INTXBAR30_ECAPINT_SEL;
    group6_mask[30] = (uint32_t)MW_INTXBAR30_EQEPINT_SEL;
    group0_mask[31] = (uint32_t)MW_INTXBAR31_EPWMINT_SEL;
    group1_mask[31] = (uint32_t)MW_INTXBAR31_EPWMTZINT_SEL;
    group2_mask[31] = (uint32_t)MW_INTXBAR31_ADCINT_SEL;
    group3_mask[31] = (uint32_t)MW_INTXBAR31_FSIRXINT_SEL;
    group4_mask[31] = (uint32_t)MW_INTXBAR31_SDFMINT_SEL;
    group5_mask[31] = (uint32_t)MW_INTXBAR31_ECAPINT_SEL;
    group6_mask[31] = (uint32_t)MW_INTXBAR31_EQEPINT_SEL;   
   
             
    uint8_t out;

    for( out = 0 ; out < 32 ; out++ )
    {

        if(((group0_mask[out]!=0) | (group1_mask[out]!=0) | (group2_mask[out]!=0) | (group3_mask[out]!=0) | (group4_mask[out]!=0) | (group5_mask[out]!=0) | (group6_mask[out]!=0)))
        {
            SOC_xbarSelectInterruptXBarInputSource(CSL_CONTROLSS_INTXBAR_U_BASE, out, 
                                                group0_mask[out], group1_mask[out], 
                                                group2_mask[out], group3_mask[out], 
                                                group4_mask[out], group5_mask[out], 
                                                group6_mask[out]);
        }
        
