TexasInstruments/am26x-hsp/src/am263x_init.c
    }

    // SOC_xbarSelectInterruptXBarInputSource(CSL_CONTROLSS_INTXBAR_U_BASE, 22, 0, 0, 0, 0, 0, ( INT_XBAR_ECAP0_INT ), 0);

}

void Drivers_gpioIntXbarOpen()
{
    uint8_t out;
    uint8_t output_val =0;
    for(out = 0; out < 30; out ++)
    {
        switch(out)
        {
        case 0:
            output_val = MW_GPIO_INT_XBAR0_OUTPUT_SEL;
            break;
        case 1:
            output_val = MW_GPIO_INT_XBAR1_OUTPUT_SEL;
            break;
        case 2:
            output_val = MW_GPIO_INT_XBAR2_OUTPUT_SEL;
            break;
        case 3:
            output_val = MW_GPIO_INT_XBAR3_OUTPUT_SEL;
            break;
        case 4:
            output_val = MW_GPIO_INT_XBAR_DMA0_OUTPUT_SEL;
            break;
        case 5:
            output_val = MW_GPIO_INT_XBAR_DMA1_OUTPUT_SEL;
            break;
        case 6:
            output_val = MW_GPIO_INT_XBAR_DMA2_OUTPUT_SEL;
            break;
        case 7:
            output_val = MW_GPIO_INT_XBAR_DMA3_OUTPUT_SEL;
            break;
        case 8:
            output_val = MW_GPIO_INT_XBAR_SOC_TIMESYNC10_OUTPUT_SEL;
            break;
        case 9:
            output_val = MW_GPIO_INT_XBAR_SOC_TIMESYNC11_OUTPUT_SEL;
            break;
        case 10:
            output_val = MW_GPIO_INT_XBAR_SOC_TIMESYNC12_OUTPUT_SEL;
            break;
        case 11:
            output_val = MW_GPIO_INT_XBAR_SOC_TIMESYNC13_OUTPUT_SEL;
            break;
        case 12:
            output_val = MW_GPIO_INT_XBAR_SOC_TIMESYNC14_OUTPUT_SEL;
            break;
        case 13:
            output_val = MW_GPIO_INT_XBAR_SOC_TIMESYNC15_OUTPUT_SEL;
            break;
        case 14:
            output_val = MW_GPIO_INT_XBAR_VIM_MODULE00_SEL;
            break;
        case 15:
            output_val = MW_GPIO_INT_XBAR_VIM_MODULE01_SEL;
            break;
        case 16:
            output_val = MW_GPIO_INT_XBAR_VIM_MODULE02_SEL;
            break;
        case 17:
            output_val = MW_GPIO_INT_XBAR_VIM_MODULE03_SEL;
            break;
        case 18:
            output_val = MW_GPIO_INT_XBAR_VIM_MODULE10_SEL;
            break;
        case 19:
            output_val = MW_GPIO_INT_XBAR_VIM_MODULE11_SEL;
            break;
        case 20:
            output_val = MW_GPIO_INT_XBAR_VIM_MODULE12_SEL;
            break;
        case 21:
            output_val = MW_GPIO_INT_XBAR_VIM_MODULE13_SEL;
            break;
        case 22:
            output_val = MW_GPIO_INT_XBAR_VIM_MODULE20_SEL;
            break;
        case 23:
            output_val = MW_GPIO_INT_XBAR_VIM_MODULE21_SEL;
            break;
        case 24:
            output_val = MW_GPIO_INT_XBAR_VIM_MODULE22_SEL;
            break;
        case 25:
            output_val = MW_GPIO_INT_XBAR_VIM_MODULE23_SEL;
            break;
        case 26:
            output_val = MW_GPIO_INT_XBAR_VIM_MODULE30_SEL;
            break;
        case 27:
            output_val = MW_GPIO_INT_XBAR_VIM_MODULE31_SEL;
            break;
        case 28:
            output_val = MW_GPIO_INT_XBAR_VIM_MODULE32_SEL;
            break;
        case 29:
            output_val = MW_GPIO_INT_XBAR_VIM_MODULE33_SEL;
            break;
        default:
            output_val = 0;
            break;
        }

        if(output_val!=0)
            SOC_xbarSelectGpioIntrXbarInputSource(CSL_GPIO_INTR_XBAR_U_BASE, out, output_val);
       
    }
}
void Drivers_inputXbarOpen(void)
{
    uint32_t InputXBAR_mask[32];

    InputXBAR_mask[0] = MW_INPUTXBAR0_SEL;
    InputXBAR_mask[1] = MW_INPUTXBAR1_SEL;
    InputXBAR_mask[2] = MW_INPUTXBAR2_SEL;
    InputXBAR_mask[3] = MW_INPUTXBAR3_SEL;
    InputXBAR_mask[4] = MW_INPUTXBAR4_SEL;
    InputXBAR_mask[5] = MW_INPUTXBAR5_SEL;
    InputXBAR_mask[6] = MW_INPUTXBAR6_SEL;
    InputXBAR_mask[7] = MW_INPUTXBAR7_SEL;
    InputXBAR_mask[8] = MW_INPUTXBAR8_SEL;
    InputXBAR_mask[9] = MW_INPUTXBAR9_SEL;
    InputXBAR_mask[10] = MW_INPUTXBAR10_SEL;
    InputXBAR_mask[11] = MW_INPUTXBAR11_SEL;
    InputXBAR_mask[12] = MW_INPUTXBAR12_SEL;
    InputXBAR_mask[13] = MW_INPUTXBAR13_SEL;
    InputXBAR_mask[14] = MW_INPUTXBAR14_SEL;
    InputXBAR_mask[15] = MW_INPUTXBAR15_SEL;
    InputXBAR_mask[16] = MW_INPUTXBAR16_SEL;
    InputXBAR_mask[17] = MW_INPUTXBAR17_SEL;
    InputXBAR_mask[18] = MW_INPUTXBAR18_SEL;
    InputXBAR_mask[19] = MW_INPUTXBAR19_SEL;
    InputXBAR_mask[20] = MW_INPUTXBAR20_SEL;
    InputXBAR_mask[21] = MW_INPUTXBAR21_SEL;
    InputXBAR_mask[22] = MW_INPUTXBAR22_SEL;
    InputXBAR_mask[23] = MW_INPUTXBAR23_SEL;
    InputXBAR_mask[24] = MW_INPUTXBAR24_SEL;
    InputXBAR_mask[25] = MW_INPUTXBAR25_SEL;
    InputXBAR_mask[26] = MW_INPUTXBAR26_SEL;
    InputXBAR_mask[27] = MW_INPUTXBAR27_SEL;
    InputXBAR_mask[28] = MW_INPUTXBAR28_SEL;
    InputXBAR_mask[29] = MW_INPUTXBAR29_SEL;
    InputXBAR_mask[30] = MW_INPUTXBAR30_SEL;
    InputXBAR_mask[31] = MW_INPUTXBAR31_SEL;
  
    for(int i = 0; i < 32; i++)
    {
        if(InputXBAR_mask[i]!=0)
        {
            if(InputXBAR_mask[i] < 144)
            {
                SOC_xbarSelectInputXBarInputSource(CSL_CONTROLSS_INPUTXBAR_U_BASE, i, 0, InputXBAR_mask[i], 0);
            }
            else
            {
                SOC_xbarSelectInputXBarInputSource(CSL_CONTROLSS_INPUTXBAR_U_BASE, i, 1, 0, InputXBAR_mask[i]-144); 
            }
        }
    }

}

void Drivers_EPWMXbarOpen()
{
    uint32_t group0_epwmxbar[30];
    uint32_t group1_epwmxbar[30];
    uint32_t group2_epwmxbar[30];
    uint32_t group3_epwmxbar[30];
    uint32_t group4_epwmxbar[30];
    uint32_t group5_epwmxbar[30];
    uint32_t group6_epwmxbar[30];
    uint32_t group7_epwmxbar[30];
    uint32_t group8_epwmxbar[30];
    uint32_t latch;

    bool XBARSet = false;

        group0_epwmxbar[0] = (uint32_t)MW_EPWMXBAR0_GROUP0_SEL;
    group1_epwmxbar[0] = (uint32_t)MW_EPWMXBAR0_GROUP1_SEL;
    group2_epwmxbar[0] = (uint32_t)MW_EPWMXBAR0_GROUP2_SEL;
    group3_epwmxbar[0] = (uint32_t)MW_EPWMXBAR0_GROUP3_SEL;
    // if((uint32_t)MW_EPWMXBAR0_GROUP4_SEL == 0)
    //     group4_epwmxbar[0] = EPWM_XBAR_0;
    // else
        group4_epwmxbar[0] = 0;
    group5_epwmxbar[0] = (uint32_t)MW_EPWMXBAR0_GROUP5_SEL;
    group6_epwmxbar[0] = (uint32_t)MW_EPWMXBAR0_GROUP6_SEL;
    group7_epwmxbar[0] = (uint32_t)MW_EPWMXBAR0_GROUP7_SEL;
    group8_epwmxbar[0] = (uint32_t)MW_EPWMXBAR0_GROUP8_SEL;

    group0_epwmxbar[1] = (uint32_t)MW_EPWMXBAR1_GROUP0_SEL;
    group1_epwmxbar[1] = (uint32_t)MW_EPWMXBAR1_GROUP1_SEL;
    group2_epwmxbar[1] = (uint32_t)MW_EPWMXBAR1_GROUP2_SEL;
    group3_epwmxbar[1] = (uint32_t)MW_EPWMXBAR1_GROUP3_SEL;
    // if((uint32_t)MW_EPWMXBAR1_GROUP4_SEL == 0)
    //     group4_epwmxbar[1] = EPWM_XBAR_1;
    // else
        group4_epwmxbar[1] = 0;
    group5_epwmxbar[1] = (uint32_t)MW_EPWMXBAR1_GROUP5_SEL;
    group6_epwmxbar[1] = (uint32_t)MW_EPWMXBAR1_GROUP6_SEL;
    group7_epwmxbar[1] = (uint32_t)MW_EPWMXBAR1_GROUP7_SEL;
    group8_epwmxbar[1] = (uint32_t)MW_EPWMXBAR1_GROUP8_SEL;

    group0_epwmxbar[2] = (uint32_t)MW_EPWMXBAR2_GROUP0_SEL;
    group1_epwmxbar[2] = (uint32_t)MW_EPWMXBAR2_GROUP1_SEL;
    group2_epwmxbar[2] = (uint32_t)MW_EPWMXBAR2_GROUP2_SEL;
    group3_epwmxbar[2] = (uint32_t)MW_EPWMXBAR2_GROUP3_SEL;
    // if((uint32_t)MW_EPWMXBAR2_GROUP4_SEL == 0)
    //     group4_epwmxbar[2] = EPWM_XBAR_2;
    // else
        group4_epwmxbar[2] = 0;
    group5_epwmxbar[2] = (uint32_t)MW_EPWMXBAR2_GROUP5_SEL;
    group6_epwmxbar[2] = (uint32_t)MW_EPWMXBAR2_GROUP6_SEL;
    group7_epwmxbar[2] = (uint32_t)MW_EPWMXBAR2_GROUP7_SEL;
    group8_epwmxbar[2] = (uint32_t)MW_EPWMXBAR2_GROUP8_SEL;

    group0_epwmxbar[3] = (uint32_t)MW_EPWMXBAR3_GROUP0_SEL;
    group1_epwmxbar[3] = (uint32_t)MW_EPWMXBAR3_GROUP1_SEL;
    group2_epwmxbar[3] = (uint32_t)MW_EPWMXBAR3_GROUP2_SEL;
    group3_epwmxbar[3] = (uint32_t)MW_EPWMXBAR3_GROUP3_SEL;
    // if((uint32_t)MW_EPWMXBAR3_GROUP4_SEL == 0)
    //     group4_epwmxbar[3] = EPWM_XBAR_3;
    // else
        group4_epwmxbar[3] = 0;
    group5_epwmxbar[3] = (uint32_t)MW_EPWMXBAR3_GROUP5_SEL;
    group6_epwmxbar[3] = (uint32_t)MW_EPWMXBAR3_GROUP6_SEL;
    group7_epwmxbar[3] = (uint32_t)MW_EPWMXBAR3_GROUP7_SEL;
    group8_epwmxbar[3] = (uint32_t)MW_EPWMXBAR3_GROUP8_SEL;

    group0_epwmxbar[4] = (uint32_t)MW_EPWMXBAR4_GROUP0_SEL;
    group1_epwmxbar[4] = (uint32_t)MW_EPWMXBAR4_GROUP1_SEL;
    group2_epwmxbar[4] = (uint32_t)MW_EPWMXBAR4_GROUP2_SEL;
    group3_epwmxbar[4] = (uint32_t)MW_EPWMXBAR4_GROUP3_SEL;
    // if((uint32_t)MW_EPWMXBAR4_GROUP4_SEL == 0)
    //     group4_epwmxbar[4] = EPWM_XBAR_4;
    // else
        group4_epwmxbar[4] = 0;
    group5_epwmxbar[4] = (uint32_t)MW_EPWMXBAR4_GROUP5_SEL;
    group6_epwmxbar[4] = (uint32_t)MW_EPWMXBAR4_GROUP6_SEL;
    group7_epwmxbar[4] = (uint32_t)MW_EPWMXBAR4_GROUP7_SEL;
    group8_epwmxbar[4] = (uint32_t)MW_EPWMXBAR4_GROUP8_SEL;

    group0_epwmxbar[5] = (uint32_t)MW_EPWMXBAR5_GROUP0_SEL;
    group1_epwmxbar[5] = (uint32_t)MW_EPWMXBAR5_GROUP1_SEL;
    group2_epwmxbar[5] = (uint32_t)MW_EPWMXBAR5_GROUP2_SEL;
    group3_epwmxbar[5] = (uint32_t)MW_EPWMXBAR5_GROUP3_SEL;
    // if((uint32_t)MW_EPWMXBAR5_GROUP4_SEL == 0)
    //     group4_epwmxbar[5] = EPWM_XBAR_5;
    // else
        group4_epwmxbar[5] = 0;
    group5_epwmxbar[5] = (uint32_t)MW_EPWMXBAR5_GROUP5_SEL;
    group6_epwmxbar[5] = (uint32_t)MW_EPWMXBAR5_GROUP6_SEL;
    group7_epwmxbar[5] = (uint32_t)MW_EPWMXBAR5_GROUP7_SEL;
    group8_epwmxbar[5] = (uint32_t)MW_EPWMXBAR5_GROUP8_SEL;

