TexasInstruments/am26x-hsp/src/am263x_init.c
    group0_epwmxbar[6] = (uint32_t)MW_EPWMXBAR6_GROUP0_SEL;
    group1_epwmxbar[6] = (uint32_t)MW_EPWMXBAR6_GROUP1_SEL;
    group2_epwmxbar[6] = (uint32_t)MW_EPWMXBAR6_GROUP2_SEL;
    group3_epwmxbar[6] = (uint32_t)MW_EPWMXBAR6_GROUP3_SEL;
    // if((uint32_t)MW_EPWMXBAR6_GROUP4_SEL == 0)
    //     group4_epwmxbar[6] = EPWM_XBAR_6;
    // else
        group4_epwmxbar[6] = 0;
    group5_epwmxbar[6] = (uint32_t)MW_EPWMXBAR6_GROUP5_SEL;
    group6_epwmxbar[6] = (uint32_t)MW_EPWMXBAR6_GROUP6_SEL;
    group7_epwmxbar[6] = (uint32_t)MW_EPWMXBAR6_GROUP7_SEL;
    group8_epwmxbar[6] = (uint32_t)MW_EPWMXBAR6_GROUP8_SEL;

    group0_epwmxbar[7] = (uint32_t)MW_EPWMXBAR7_GROUP0_SEL;
    group1_epwmxbar[7] = (uint32_t)MW_EPWMXBAR7_GROUP1_SEL;
    group2_epwmxbar[7] = (uint32_t)MW_EPWMXBAR7_GROUP2_SEL;
    group3_epwmxbar[7] = (uint32_t)MW_EPWMXBAR7_GROUP3_SEL;
    // if((uint32_t)MW_EPWMXBAR7_GROUP4_SEL == 0)
    //     group4_epwmxbar[7] = EPWM_XBAR_7;
    // else
        group4_epwmxbar[7] = 0;
    group5_epwmxbar[7] = (uint32_t)MW_EPWMXBAR7_GROUP5_SEL;
    group6_epwmxbar[7] = (uint32_t)MW_EPWMXBAR7_GROUP6_SEL;
    group7_epwmxbar[7] = (uint32_t)MW_EPWMXBAR7_GROUP7_SEL;
    group8_epwmxbar[7] = (uint32_t)MW_EPWMXBAR7_GROUP8_SEL;

    group0_epwmxbar[8] = (uint32_t)MW_EPWMXBAR8_GROUP0_SEL;
    group1_epwmxbar[8] = (uint32_t)MW_EPWMXBAR8_GROUP1_SEL;
    group2_epwmxbar[8] = (uint32_t)MW_EPWMXBAR8_GROUP2_SEL;
    group3_epwmxbar[8] = (uint32_t)MW_EPWMXBAR8_GROUP3_SEL;
    // if((uint32_t)MW_EPWMXBAR8_GROUP4_SEL == 0)
    //     group4_epwmxbar[8] = EPWM_XBAR_8;
    // else
        group4_epwmxbar[8] = 0;
    group5_epwmxbar[8] = (uint32_t)MW_EPWMXBAR8_GROUP5_SEL;
    group6_epwmxbar[8] = (uint32_t)MW_EPWMXBAR8_GROUP6_SEL;
    group7_epwmxbar[8] = (uint32_t)MW_EPWMXBAR8_GROUP7_SEL;
    group8_epwmxbar[8] = (uint32_t)MW_EPWMXBAR8_GROUP8_SEL;

    group0_epwmxbar[9] = (uint32_t)MW_EPWMXBAR9_GROUP0_SEL;
    group1_epwmxbar[9] = (uint32_t)MW_EPWMXBAR9_GROUP1_SEL;
    group2_epwmxbar[9] = (uint32_t)MW_EPWMXBAR9_GROUP2_SEL;
    group3_epwmxbar[9] = (uint32_t)MW_EPWMXBAR9_GROUP3_SEL;
    // if((uint32_t)MW_EPWMXBAR9_GROUP4_SEL == 0)
    //     group4_epwmxbar[9] = EPWM_XBAR_9;
    // else
        group4_epwmxbar[9] = 0;
    group5_epwmxbar[9] = (uint32_t)MW_EPWMXBAR9_GROUP5_SEL;
    group6_epwmxbar[9] = (uint32_t)MW_EPWMXBAR9_GROUP6_SEL;
    group7_epwmxbar[9] = (uint32_t)MW_EPWMXBAR9_GROUP7_SEL;
    group8_epwmxbar[9] = (uint32_t)MW_EPWMXBAR9_GROUP8_SEL;

   group0_epwmxbar[10] = (uint32_t)MW_EPWMXBAR10_GROUP0_SEL;
    group1_epwmxbar[10] = (uint32_t)MW_EPWMXBAR10_GROUP1_SEL;
    group2_epwmxbar[10] = (uint32_t)MW_EPWMXBAR10_GROUP2_SEL;
    group3_epwmxbar[10] = (uint32_t)MW_EPWMXBAR10_GROUP3_SEL;
    // if((uint32_t)MW_EPWMXBAR0_GROUP4_SEL == 0)
    //     group4_epwmxbar[10] = EPWM_XBAR_10;
    // else
        group4_epwmxbar[10] = 0;
    group5_epwmxbar[10] = (uint32_t)MW_EPWMXBAR10_GROUP5_SEL;
    group6_epwmxbar[10] = (uint32_t)MW_EPWMXBAR10_GROUP6_SEL;
    group7_epwmxbar[10] = (uint32_t)MW_EPWMXBAR10_GROUP7_SEL;
    group8_epwmxbar[10] = (uint32_t)MW_EPWMXBAR10_GROUP8_SEL;

    group0_epwmxbar[11] = (uint32_t)MW_EPWMXBAR11_GROUP0_SEL;
    group1_epwmxbar[11] = (uint32_t)MW_EPWMXBAR11_GROUP1_SEL;
    group2_epwmxbar[11] = (uint32_t)MW_EPWMXBAR11_GROUP2_SEL;
    group3_epwmxbar[11] = (uint32_t)MW_EPWMXBAR11_GROUP3_SEL;
    // if((uint32_t)MW_EPWMXBAR1_GROUP4_SEL == 0)
    //     group4_epwmxbar[11] = EPWM_XBAR_11;
    // else
        group4_epwmxbar[11] = 0;
    group5_epwmxbar[11] = (uint32_t)MW_EPWMXBAR11_GROUP5_SEL;
    group6_epwmxbar[11] = (uint32_t)MW_EPWMXBAR11_GROUP6_SEL;
    group7_epwmxbar[11] = (uint32_t)MW_EPWMXBAR11_GROUP7_SEL;
    group8_epwmxbar[11] = (uint32_t)MW_EPWMXBAR11_GROUP8_SEL;

    group0_epwmxbar[12] = (uint32_t)MW_EPWMXBAR12_GROUP0_SEL;
    group1_epwmxbar[12] = (uint32_t)MW_EPWMXBAR12_GROUP1_SEL;
    group2_epwmxbar[12] = (uint32_t)MW_EPWMXBAR12_GROUP2_SEL;
    group3_epwmxbar[12] = (uint32_t)MW_EPWMXBAR12_GROUP3_SEL;
    // if((uint32_t)MW_EPWMXBAR2_GROUP4_SEL == 0)
    //     group4_epwmxbar[12] = EPWM_XBAR_12;
    // else
        group4_epwmxbar[12] = 0;
    group5_epwmxbar[12] = (uint32_t)MW_EPWMXBAR12_GROUP5_SEL;
    group6_epwmxbar[12] = (uint32_t)MW_EPWMXBAR12_GROUP6_SEL;
    group7_epwmxbar[12] = (uint32_t)MW_EPWMXBAR12_GROUP7_SEL;
    group8_epwmxbar[12] = (uint32_t)MW_EPWMXBAR12_GROUP8_SEL;

    group0_epwmxbar[13] = (uint32_t)MW_EPWMXBAR13_GROUP0_SEL;
    group1_epwmxbar[13] = (uint32_t)MW_EPWMXBAR13_GROUP1_SEL;
    group2_epwmxbar[13] = (uint32_t)MW_EPWMXBAR13_GROUP2_SEL;
    group3_epwmxbar[13] = (uint32_t)MW_EPWMXBAR13_GROUP3_SEL;
    // if((uint32_t)MW_EPWMXBAR3_GROUP4_SEL == 0)
    //     group4_epwmxbar[13] = EPWM_XBAR_13;
    // else
        group4_epwmxbar[13] = 0;
    group5_epwmxbar[13] = (uint32_t)MW_EPWMXBAR13_GROUP5_SEL;
    group6_epwmxbar[13] = (uint32_t)MW_EPWMXBAR13_GROUP6_SEL;
    group7_epwmxbar[13] = (uint32_t)MW_EPWMXBAR13_GROUP7_SEL;
    group8_epwmxbar[13] = (uint32_t)MW_EPWMXBAR13_GROUP8_SEL;

    group0_epwmxbar[14] = (uint32_t)MW_EPWMXBAR14_GROUP0_SEL;
    group1_epwmxbar[14] = (uint32_t)MW_EPWMXBAR14_GROUP1_SEL;
    group2_epwmxbar[14] = (uint32_t)MW_EPWMXBAR14_GROUP2_SEL;
    group3_epwmxbar[14] = (uint32_t)MW_EPWMXBAR14_GROUP3_SEL;
    // if((uint32_t)MW_EPWMXBAR4_GROUP4_SEL == 0)
    //     group4_epwmxbar[14] = EPWM_XBAR_14;
    // else
        group4_epwmxbar[14] = 0;
    group5_epwmxbar[14] = (uint32_t)MW_EPWMXBAR14_GROUP5_SEL;
    group6_epwmxbar[14] = (uint32_t)MW_EPWMXBAR14_GROUP6_SEL;
    group7_epwmxbar[14] = (uint32_t)MW_EPWMXBAR14_GROUP7_SEL;
    group8_epwmxbar[14] = (uint32_t)MW_EPWMXBAR14_GROUP8_SEL;

    group0_epwmxbar[15] = (uint32_t)MW_EPWMXBAR15_GROUP0_SEL;
    group1_epwmxbar[15] = (uint32_t)MW_EPWMXBAR15_GROUP1_SEL;
    group2_epwmxbar[15] = (uint32_t)MW_EPWMXBAR15_GROUP2_SEL;
    group3_epwmxbar[15] = (uint32_t)MW_EPWMXBAR15_GROUP3_SEL;
    // if((uint32_t)MW_EPWMXBAR5_GROUP4_SEL == 0)
    //     group4_epwmxbar[15] = EPWM_XBAR_15;
    // else
        group4_epwmxbar[15] = 0;
    group5_epwmxbar[15] = (uint32_t)MW_EPWMXBAR15_GROUP5_SEL;
    group6_epwmxbar[15] = (uint32_t)MW_EPWMXBAR15_GROUP6_SEL;
    group7_epwmxbar[15] = (uint32_t)MW_EPWMXBAR15_GROUP7_SEL;
    group8_epwmxbar[15] = (uint32_t)MW_EPWMXBAR15_GROUP8_SEL;

    group0_epwmxbar[16] = (uint32_t)MW_EPWMXBAR16_GROUP0_SEL;
    group1_epwmxbar[16] = (uint32_t)MW_EPWMXBAR16_GROUP1_SEL;
    group2_epwmxbar[16] = (uint32_t)MW_EPWMXBAR16_GROUP2_SEL;
    group3_epwmxbar[16] = (uint32_t)MW_EPWMXBAR16_GROUP3_SEL;
    // if((uint32_t)MW_EPWMXBAR6_GROUP4_SEL == 0)
    //     group4_epwmxbar[16] = EPWM_XBAR_16;
    // else
        group4_epwmxbar[16] = 0;
    group5_epwmxbar[16] = (uint32_t)MW_EPWMXBAR16_GROUP5_SEL;
    group6_epwmxbar[16] = (uint32_t)MW_EPWMXBAR16_GROUP6_SEL;
    group7_epwmxbar[16] = (uint32_t)MW_EPWMXBAR16_GROUP7_SEL;
    group8_epwmxbar[16] = (uint32_t)MW_EPWMXBAR16_GROUP8_SEL;

