TexasInstruments/am26x-hsp/src/am263x_init.c
    group0_epwmxbar[17] = (uint32_t)MW_EPWMXBAR17_GROUP0_SEL;
    group1_epwmxbar[17] = (uint32_t)MW_EPWMXBAR17_GROUP1_SEL;
    group2_epwmxbar[17] = (uint32_t)MW_EPWMXBAR17_GROUP2_SEL;
    group3_epwmxbar[17] = (uint32_t)MW_EPWMXBAR17_GROUP3_SEL;
    // if((uint32_t)MW_EPWMXBAR7_GROUP4_SEL == 0)
    //     group4_epwmxbar[17] = EPWM_XBAR_17;
    // else
        group4_epwmxbar[17] = 0;
    group5_epwmxbar[17] = (uint32_t)MW_EPWMXBAR17_GROUP5_SEL;
    group6_epwmxbar[17] = (uint32_t)MW_EPWMXBAR17_GROUP6_SEL;
    group7_epwmxbar[17] = (uint32_t)MW_EPWMXBAR17_GROUP7_SEL;
    group8_epwmxbar[17] = (uint32_t)MW_EPWMXBAR17_GROUP8_SEL;

    group0_epwmxbar[18] = (uint32_t)MW_EPWMXBAR18_GROUP0_SEL;
    group1_epwmxbar[18] = (uint32_t)MW_EPWMXBAR18_GROUP1_SEL;
    group2_epwmxbar[18] = (uint32_t)MW_EPWMXBAR18_GROUP2_SEL;
    group3_epwmxbar[18] = (uint32_t)MW_EPWMXBAR18_GROUP3_SEL;
    // if((uint32_t)MW_EPWMXBAR8_GROUP4_SEL == 0)
    //     group4_epwmxbar[18] = EPWM_XBAR_18;
    // else
        group4_epwmxbar[18] = 0;
    group5_epwmxbar[18] = (uint32_t)MW_EPWMXBAR18_GROUP5_SEL;
    group6_epwmxbar[18] = (uint32_t)MW_EPWMXBAR18_GROUP6_SEL;
    group7_epwmxbar[18] = (uint32_t)MW_EPWMXBAR18_GROUP7_SEL;
    group8_epwmxbar[18] = (uint32_t)MW_EPWMXBAR18_GROUP8_SEL;

    group0_epwmxbar[19] = (uint32_t)MW_EPWMXBAR19_GROUP0_SEL;
    group1_epwmxbar[19] = (uint32_t)MW_EPWMXBAR19_GROUP1_SEL;
    group2_epwmxbar[19] = (uint32_t)MW_EPWMXBAR19_GROUP2_SEL;
    group3_epwmxbar[19] = (uint32_t)MW_EPWMXBAR19_GROUP3_SEL;
    // if((uint32_t)MW_EPWMXBAR9_GROUP4_SEL == 0)
    //     group4_epwmxbar[19] = EPWM_XBAR_19;
    // else
        group4_epwmxbar[19] = 0;
    group5_epwmxbar[19] = (uint32_t)MW_EPWMXBAR19_GROUP5_SEL;
    group6_epwmxbar[19] = (uint32_t)MW_EPWMXBAR19_GROUP6_SEL;
    group7_epwmxbar[19] = (uint32_t)MW_EPWMXBAR19_GROUP7_SEL;
    group8_epwmxbar[19] = (uint32_t)MW_EPWMXBAR19_GROUP8_SEL;

   group0_epwmxbar[20] = (uint32_t)MW_EPWMXBAR20_GROUP0_SEL;
    group1_epwmxbar[20] = (uint32_t)MW_EPWMXBAR20_GROUP1_SEL;
    group2_epwmxbar[20] = (uint32_t)MW_EPWMXBAR20_GROUP2_SEL;
    group3_epwmxbar[20] = (uint32_t)MW_EPWMXBAR20_GROUP3_SEL;
    // if((uint32_t)MW_EPWMXBAR0_GROUP4_SEL == 0)
    //     group4_epwmxbar[20] = EPWM_XBAR_20;
    // else
        group4_epwmxbar[20] = 0;
    group5_epwmxbar[20] = (uint32_t)MW_EPWMXBAR20_GROUP5_SEL;
    group6_epwmxbar[20] = (uint32_t)MW_EPWMXBAR20_GROUP6_SEL;
    group7_epwmxbar[20] = (uint32_t)MW_EPWMXBAR20_GROUP7_SEL;
    group8_epwmxbar[20] = (uint32_t)MW_EPWMXBAR20_GROUP8_SEL;

    group0_epwmxbar[21] = (uint32_t)MW_EPWMXBAR21_GROUP0_SEL;
    group1_epwmxbar[21] = (uint32_t)MW_EPWMXBAR21_GROUP1_SEL;
    group2_epwmxbar[21] = (uint32_t)MW_EPWMXBAR21_GROUP2_SEL;
    group3_epwmxbar[21] = (uint32_t)MW_EPWMXBAR21_GROUP3_SEL;
    // if((uint32_t)MW_EPWMXBAR2_GROUP4_SEL == 0)
    //     group4_epwmxbar[21] = EPWM_XBAR_21;
    // else
        group4_epwmxbar[21] = 0;
    group5_epwmxbar[21] = (uint32_t)MW_EPWMXBAR21_GROUP5_SEL;
    group6_epwmxbar[21] = (uint32_t)MW_EPWMXBAR21_GROUP6_SEL;
    group7_epwmxbar[21] = (uint32_t)MW_EPWMXBAR21_GROUP7_SEL;
    group8_epwmxbar[21] = (uint32_t)MW_EPWMXBAR21_GROUP8_SEL;

    group0_epwmxbar[22] = (uint32_t)MW_EPWMXBAR22_GROUP0_SEL;
    group1_epwmxbar[22] = (uint32_t)MW_EPWMXBAR22_GROUP1_SEL;
    group2_epwmxbar[22] = (uint32_t)MW_EPWMXBAR22_GROUP2_SEL;
    group3_epwmxbar[22] = (uint32_t)MW_EPWMXBAR22_GROUP3_SEL;
    // if((uint32_t)MW_EPWMXBAR2_GROUP4_SEL == 0)
    //     group4_epwmxbar[22] = EPWM_XBAR_22;
    // else
        group4_epwmxbar[22] = 0;
    group5_epwmxbar[22] = (uint32_t)MW_EPWMXBAR22_GROUP5_SEL;
    group6_epwmxbar[22] = (uint32_t)MW_EPWMXBAR22_GROUP6_SEL;
    group7_epwmxbar[22] = (uint32_t)MW_EPWMXBAR22_GROUP7_SEL;
    group8_epwmxbar[22] = (uint32_t)MW_EPWMXBAR22_GROUP8_SEL;

    group0_epwmxbar[23] = (uint32_t)MW_EPWMXBAR23_GROUP0_SEL;
    group1_epwmxbar[23] = (uint32_t)MW_EPWMXBAR23_GROUP1_SEL;
    group2_epwmxbar[23] = (uint32_t)MW_EPWMXBAR23_GROUP2_SEL;
    group3_epwmxbar[23] = (uint32_t)MW_EPWMXBAR23_GROUP3_SEL;
    // if((uint32_t)MW_EPWMXBAR3_GROUP4_SEL == 0)
    //     group4_epwmxbar[23] = EPWM_XBAR_23;
    // else
        group4_epwmxbar[23] = 0;
    group5_epwmxbar[23] = (uint32_t)MW_EPWMXBAR23_GROUP5_SEL;
    group6_epwmxbar[23] = (uint32_t)MW_EPWMXBAR23_GROUP6_SEL;
    group7_epwmxbar[23] = (uint32_t)MW_EPWMXBAR23_GROUP7_SEL;
    group8_epwmxbar[23] = (uint32_t)MW_EPWMXBAR23_GROUP8_SEL;

    group0_epwmxbar[24] = (uint32_t)MW_EPWMXBAR24_GROUP0_SEL;
    group1_epwmxbar[24] = (uint32_t)MW_EPWMXBAR24_GROUP1_SEL;
    group2_epwmxbar[24] = (uint32_t)MW_EPWMXBAR24_GROUP2_SEL;
    group3_epwmxbar[24] = (uint32_t)MW_EPWMXBAR24_GROUP3_SEL;
    // if((uint32_t)MW_EPWMXBAR4_GROUP4_SEL == 0)
    //     group4_epwmxbar[24] = EPWM_XBAR_24;
    // else
        group4_epwmxbar[24] = 0;
    group5_epwmxbar[24] = (uint32_t)MW_EPWMXBAR24_GROUP5_SEL;
    group6_epwmxbar[24] = (uint32_t)MW_EPWMXBAR24_GROUP6_SEL;
    group7_epwmxbar[24] = (uint32_t)MW_EPWMXBAR24_GROUP7_SEL;
    group8_epwmxbar[24] = (uint32_t)MW_EPWMXBAR24_GROUP8_SEL;

    group0_epwmxbar[25] = (uint32_t)MW_EPWMXBAR25_GROUP0_SEL;
    group1_epwmxbar[25] = (uint32_t)MW_EPWMXBAR25_GROUP1_SEL;
    group2_epwmxbar[25] = (uint32_t)MW_EPWMXBAR25_GROUP2_SEL;
    group3_epwmxbar[25] = (uint32_t)MW_EPWMXBAR25_GROUP3_SEL;
    // if((uint32_t)MW_EPWMXBAR5_GROUP4_SEL == 0)
    //     group4_epwmxbar[25] = EPWM_XBAR_25;
    // else
        group4_epwmxbar[25] = 0;
    group5_epwmxbar[25] = (uint32_t)MW_EPWMXBAR25_GROUP5_SEL;
    group6_epwmxbar[25] = (uint32_t)MW_EPWMXBAR25_GROUP6_SEL;
    group7_epwmxbar[25] = (uint32_t)MW_EPWMXBAR25_GROUP7_SEL;
    group8_epwmxbar[25] = (uint32_t)MW_EPWMXBAR25_GROUP8_SEL;

    group0_epwmxbar[26] = (uint32_t)MW_EPWMXBAR26_GROUP0_SEL;
    group1_epwmxbar[26] = (uint32_t)MW_EPWMXBAR26_GROUP1_SEL;
    group2_epwmxbar[26] = (uint32_t)MW_EPWMXBAR26_GROUP2_SEL;
    group3_epwmxbar[26] = (uint32_t)MW_EPWMXBAR26_GROUP3_SEL;
    // if((uint32_t)MW_EPWMXBAR6_GROUP4_SEL == 0)
    //     group4_epwmxbar[26] = EPWM_XBAR_26;
    // else
        group4_epwmxbar[26] = 0;
    group5_epwmxbar[26] = (uint32_t)MW_EPWMXBAR26_GROUP5_SEL;
    group6_epwmxbar[26] = (uint32_t)MW_EPWMXBAR26_GROUP6_SEL;
    group7_epwmxbar[26] = (uint32_t)MW_EPWMXBAR26_GROUP7_SEL;
    group8_epwmxbar[26] = (uint32_t)MW_EPWMXBAR26_GROUP8_SEL;

    group0_epwmxbar[27] = (uint32_t)MW_EPWMXBAR27_GROUP0_SEL;
    group1_epwmxbar[27] = (uint32_t)MW_EPWMXBAR27_GROUP1_SEL;
    group2_epwmxbar[27] = (uint32_t)MW_EPWMXBAR27_GROUP2_SEL;
    group3_epwmxbar[27] = (uint32_t)MW_EPWMXBAR27_GROUP3_SEL;
    // if((uint32_t)MW_EPWMXBAR7_GROUP4_SEL == 0)
    //     group4_epwmxbar[27] = EPWM_XBAR_27;
    // else
        group4_epwmxbar[27] = 0;
    group5_epwmxbar[27] = (uint32_t)MW_EPWMXBAR27_GROUP5_SEL;
    group6_epwmxbar[27] = (uint32_t)MW_EPWMXBAR27_GROUP6_SEL;
    group7_epwmxbar[27] = (uint32_t)MW_EPWMXBAR27_GROUP7_SEL;
    group8_epwmxbar[27] = (uint32_t)MW_EPWMXBAR27_GROUP8_SEL;

