TexasInstruments/am26x-hsp/src/am263x_init.c
    group0_epwmxbar[28] = (uint32_t)MW_EPWMXBAR28_GROUP0_SEL;
    group1_epwmxbar[28] = (uint32_t)MW_EPWMXBAR28_GROUP1_SEL;
    group2_epwmxbar[28] = (uint32_t)MW_EPWMXBAR28_GROUP2_SEL;
    group3_epwmxbar[28] = (uint32_t)MW_EPWMXBAR28_GROUP3_SEL;
    // if((uint32_t)MW_EPWMXBAR8_GROUP4_SEL == 0)
    //     group4_epwmxbar[28] = EPWM_XBAR_28;
    // else
        group4_epwmxbar[28] = 0;
    group5_epwmxbar[28] = (uint32_t)MW_EPWMXBAR28_GROUP5_SEL;
    group6_epwmxbar[28] = (uint32_t)MW_EPWMXBAR28_GROUP6_SEL;
    group7_epwmxbar[28] = (uint32_t)MW_EPWMXBAR28_GROUP7_SEL;
    group8_epwmxbar[28] = (uint32_t)MW_EPWMXBAR28_GROUP8_SEL;

    group0_epwmxbar[29] = (uint32_t)MW_EPWMXBAR29_GROUP0_SEL;
    group1_epwmxbar[29] = (uint32_t)MW_EPWMXBAR29_GROUP1_SEL;
    group2_epwmxbar[29] = (uint32_t)MW_EPWMXBAR29_GROUP2_SEL;
    group3_epwmxbar[29] = (uint32_t)MW_EPWMXBAR29_GROUP3_SEL;
    // if((uint32_t)MW_EPWMXBAR9_GROUP4_SEL == 0)
    //     group4_epwmxbar[29] = EPWM_XBAR_29;
    // else
        group4_epwmxbar[29] = 0;
    group5_epwmxbar[29] = (uint32_t)MW_EPWMXBAR29_GROUP5_SEL;
    group6_epwmxbar[29] = (uint32_t)MW_EPWMXBAR29_GROUP6_SEL;
    group7_epwmxbar[29] = (uint32_t)MW_EPWMXBAR29_GROUP7_SEL;
    group8_epwmxbar[29] = (uint32_t)MW_EPWMXBAR29_GROUP8_SEL;

    latch = (uint8_t)MW_EPWM_XBAR_INV_LATCH_SEL;

   
    for(uint8_t i = 0; i< 30; i++)
    {
        if(((group0_epwmxbar[i]!=0) | (group1_epwmxbar[i]!=0) | (group2_epwmxbar[i]!=0) | (group3_epwmxbar[i]!=0) | (group4_epwmxbar[i]!=0) | (group5_epwmxbar[i]!=0) | (group6_epwmxbar[i]!=0) | (group7_epwmxbar[i]!=0) | (group8_epwmxbar[i]!=0)))
        {
            SOC_xbarSelectPWMXBarInputSource(CSL_CONTROLSS_PWMXBAR_U_BASE, i, group0_epwmxbar[i], group1_epwmxbar[i], group2_epwmxbar[i], group3_epwmxbar[i], group4_epwmxbar[i], group5_epwmxbar[i], group6_epwmxbar[i], group7_epwmxbar[i], group8_epwmxbar[i]);
        }   
    }

    SOC_xbarInvertPWMXBarOutputSignalBeforeLatch(CSL_CONTROLSS_PWMXBAR_U_BASE, latch);

    // SOC_xbarSelectPWMXBarInputSource(CSL_CONTROLSS_PWMXBAR_U_BASE, 3, ( EPWM_XBAR_CMPSSA1_CTRIPH ), 0, 0, 0, 0, 0, 0, 0, 0);
    // SOC_xbarInvertPWMXBarOutputSignalBeforeLatch(CSL_CONTROLSS_PWMXBAR_U_BASE, 0);

}

void Drivers_outputXbarOpen(void)
{
    uint32_t group0_outputxbar[16];
    uint32_t group1_outputxbar[16];
    uint32_t group2_outputxbar[16];
    uint32_t group3_outputxbar[16];
    uint32_t group4_outputxbar[16];
    uint32_t group5_outputxbar[16];
    uint32_t group6_outputxbar[16];
    uint32_t group7_outputxbar[16];
    uint32_t group8_outputxbar[16];
    uint32_t group9_outputxbar[16];
    uint32_t group10_outputxbar[16];

    uint32_t invertOutputBeforeLatch[16];
    uint32_t invertOutput[16];
    uint32_t latchSignalSource[16];
    uint32_t stretchedPulseOutput[16];
    uint32_t stretchedPulseLength[16];

    group0_outputxbar[0] = (uint32_t)MW_OUTPUTXBAR0_GROUP0_SEL;
    group1_outputxbar[0] = (uint32_t)MW_OUTPUTXBAR0_GROUP1_SEL;
    group2_outputxbar[0] = (uint32_t)MW_OUTPUTXBAR0_GROUP2_SEL;
    group3_outputxbar[0] = (uint32_t)MW_OUTPUTXBAR0_GROUP3_SEL;
    group4_outputxbar[0] = (uint32_t)MW_OUTPUTXBAR0_GROUP4_SEL;
    group5_outputxbar[0] = (uint32_t)MW_OUTPUTXBAR0_GROUP5_SEL;
    group6_outputxbar[0] = (uint32_t)MW_OUTPUTXBAR0_GROUP6_SEL;
    group7_outputxbar[0] = (uint32_t)MW_OUTPUTXBAR0_GROUP7_SEL;
    group8_outputxbar[0] = (uint32_t)MW_OUTPUTXBAR0_GROUP8_SEL;
    group9_outputxbar[0] = (uint32_t)MW_OUTPUTXBAR0_GROUP9_SEL;
    group10_outputxbar[0] = (uint32_t)MW_OUTPUTXBAR0_GROUP10_SEL;
    group0_outputxbar[1] = (uint32_t)MW_OUTPUTXBAR1_GROUP0_SEL;
    group1_outputxbar[1] = (uint32_t)MW_OUTPUTXBAR1_GROUP1_SEL;
    group2_outputxbar[1] = (uint32_t)MW_OUTPUTXBAR1_GROUP2_SEL;
    group3_outputxbar[1] = (uint32_t)MW_OUTPUTXBAR1_GROUP3_SEL;
    group4_outputxbar[1] = (uint32_t)MW_OUTPUTXBAR1_GROUP4_SEL;
    group5_outputxbar[1] = (uint32_t)MW_OUTPUTXBAR1_GROUP5_SEL;
    group6_outputxbar[1] = (uint32_t)MW_OUTPUTXBAR1_GROUP6_SEL;
    group7_outputxbar[1] = (uint32_t)MW_OUTPUTXBAR1_GROUP7_SEL;
    group8_outputxbar[1] = (uint32_t)MW_OUTPUTXBAR1_GROUP8_SEL;
    group9_outputxbar[1] = (uint32_t)MW_OUTPUTXBAR1_GROUP9_SEL;
    group10_outputxbar[1] = (uint32_t)MW_OUTPUTXBAR1_GROUP10_SEL;
    group0_outputxbar[2] = (uint32_t)MW_OUTPUTXBAR2_GROUP0_SEL;
    group1_outputxbar[2] = (uint32_t)MW_OUTPUTXBAR2_GROUP1_SEL;
    group2_outputxbar[2] = (uint32_t)MW_OUTPUTXBAR2_GROUP2_SEL;
    group3_outputxbar[2] = (uint32_t)MW_OUTPUTXBAR2_GROUP3_SEL;
    group4_outputxbar[2] = (uint32_t)MW_OUTPUTXBAR2_GROUP4_SEL;
    group5_outputxbar[2] = (uint32_t)MW_OUTPUTXBAR2_GROUP5_SEL;
    group6_outputxbar[2] = (uint32_t)MW_OUTPUTXBAR2_GROUP6_SEL;
    group7_outputxbar[2] = (uint32_t)MW_OUTPUTXBAR2_GROUP7_SEL;
    group8_outputxbar[2] = (uint32_t)MW_OUTPUTXBAR2_GROUP8_SEL;
    group9_outputxbar[2] = (uint32_t)MW_OUTPUTXBAR2_GROUP9_SEL;
    group10_outputxbar[2] = (uint32_t)MW_OUTPUTXBAR2_GROUP10_SEL;
    group0_outputxbar[3] = (uint32_t)MW_OUTPUTXBAR3_GROUP0_SEL;
    group1_outputxbar[3] = (uint32_t)MW_OUTPUTXBAR3_GROUP1_SEL;
    group2_outputxbar[3] = (uint32_t)MW_OUTPUTXBAR3_GROUP2_SEL;
    group3_outputxbar[3] = (uint32_t)MW_OUTPUTXBAR3_GROUP3_SEL;
    group4_outputxbar[3] = (uint32_t)MW_OUTPUTXBAR3_GROUP4_SEL;
    group5_outputxbar[3] = (uint32_t)MW_OUTPUTXBAR3_GROUP5_SEL;
    group6_outputxbar[3] = (uint32_t)MW_OUTPUTXBAR3_GROUP6_SEL;
    group7_outputxbar[3] = (uint32_t)MW_OUTPUTXBAR3_GROUP7_SEL;
    group8_outputxbar[3] = (uint32_t)MW_OUTPUTXBAR3_GROUP8_SEL;
    group9_outputxbar[3] = (uint32_t)MW_OUTPUTXBAR3_GROUP9_SEL;
    group10_outputxbar[3] = (uint32_t)MW_OUTPUTXBAR3_GROUP10_SEL;
    group0_outputxbar[4] = (uint32_t)MW_OUTPUTXBAR4_GROUP0_SEL;
    group1_outputxbar[4] = (uint32_t)MW_OUTPUTXBAR4_GROUP1_SEL;
    group2_outputxbar[4] = (uint32_t)MW_OUTPUTXBAR4_GROUP2_SEL;
    group3_outputxbar[4] = (uint32_t)MW_OUTPUTXBAR4_GROUP3_SEL;
    group4_outputxbar[4] = (uint32_t)MW_OUTPUTXBAR4_GROUP4_SEL;
    group5_outputxbar[4] = (uint32_t)MW_OUTPUTXBAR4_GROUP5_SEL;
    group6_outputxbar[4] = (uint32_t)MW_OUTPUTXBAR4_GROUP6_SEL;
    group7_outputxbar[4] = (uint32_t)MW_OUTPUTXBAR4_GROUP7_SEL;
    group8_outputxbar[4] = (uint32_t)MW_OUTPUTXBAR4_GROUP8_SEL;
    group9_outputxbar[4] = (uint32_t)MW_OUTPUTXBAR4_GROUP9_SEL;
    group10_outputxbar[4] = (uint32_t)MW_OUTPUTXBAR4_GROUP10_SEL;
    group0_outputxbar[5] = (uint32_t)MW_OUTPUTXBAR5_GROUP0_SEL;
    group1_outputxbar[5] = (uint32_t)MW_OUTPUTXBAR5_GROUP1_SEL;
    group2_outputxbar[5] = (uint32_t)MW_OUTPUTXBAR5_GROUP2_SEL;
    group3_outputxbar[5] = (uint32_t)MW_OUTPUTXBAR5_GROUP3_SEL;
    group4_outputxbar[5] = (uint32_t)MW_OUTPUTXBAR5_GROUP4_SEL;
    group5_outputxbar[5] = (uint32_t)MW_OUTPUTXBAR5_GROUP5_SEL;
    group6_outputxbar[5] = (uint32_t)MW_OUTPUTXBAR5_GROUP6_SEL;
    group7_outputxbar[5] = (uint32_t)MW_OUTPUTXBAR5_GROUP7_SEL;
    group8_outputxbar[5] = (uint32_t)MW_OUTPUTXBAR5_GROUP8_SEL;
    group9_outputxbar[5] = (uint32_t)MW_OUTPUTXBAR5_GROUP9_SEL;
    group10_outputxbar[5] = (uint32_t)MW_OUTPUTXBAR5_GROUP10_SEL;
    group0_outputxbar[6] = (uint32_t)MW_OUTPUTXBAR6_GROUP0_SEL;
    group1_outputxbar[6] = (uint32_t)MW_OUTPUTXBAR6_GROUP1_SEL;
    group2_outputxbar[6] = (uint32_t)MW_OUTPUTXBAR6_GROUP2_SEL;
    group3_outputxbar[6] = (uint32_t)MW_OUTPUTXBAR6_GROUP3_SEL;
    group4_outputxbar[6] = (uint32_t)MW_OUTPUTXBAR6_GROUP4_SEL;
    group5_outputxbar[6] = (uint32_t)MW_OUTPUTXBAR6_GROUP5_SEL;
    group6_outputxbar[6] = (uint32_t)MW_OUTPUTXBAR6_GROUP6_SEL;
    group7_outputxbar[6] = (uint32_t)MW_OUTPUTXBAR6_GROUP7_SEL;
    group8_outputxbar[6] = (uint32_t)MW_OUTPUTXBAR6_GROUP8_SEL;
    group9_outputxbar[6] = (uint32_t)MW_OUTPUTXBAR6_GROUP9_SEL;
    group10_outputxbar[6] = (uint32_t)MW_OUTPUTXBAR6_GROUP10_SEL;
    group0_outputxbar[7] = (uint32_t)MW_OUTPUTXBAR7_GROUP0_SEL;
    group1_outputxbar[7] = (uint32_t)MW_OUTPUTXBAR7_GROUP1_SEL;
    group2_outputxbar[7] = (uint32_t)MW_OUTPUTXBAR7_GROUP2_SEL;
    group3_outputxbar[7] = (uint32_t)MW_OUTPUTXBAR7_GROUP3_SEL;
    group4_outputxbar[7] = (uint32_t)MW_OUTPUTXBAR7_GROUP4_SEL;
    group5_outputxbar[7] = (uint32_t)MW_OUTPUTXBAR7_GROUP5_SEL;
    group6_outputxbar[7] = (uint32_t)MW_OUTPUTXBAR7_GROUP6_SEL;
    group7_outputxbar[7] = (uint32_t)MW_OUTPUTXBAR7_GROUP7_SEL;
    group8_outputxbar[7] = (uint32_t)MW_OUTPUTXBAR7_GROUP8_SEL;
    group9_outputxbar[7] = (uint32_t)MW_OUTPUTXBAR7_GROUP9_SEL;
    group10_outputxbar[7] = (uint32_t)MW_OUTPUTXBAR7_GROUP10_SEL;
    group0_outputxbar[8] = (uint32_t)MW_OUTPUTXBAR8_GROUP0_SEL;
    group1_outputxbar[8] = (uint32_t)MW_OUTPUTXBAR8_GROUP1_SEL;
    group2_outputxbar[8] = (uint32_t)MW_OUTPUTXBAR8_GROUP2_SEL;
    group3_outputxbar[8] = (uint32_t)MW_OUTPUTXBAR8_GROUP3_SEL;
    group4_outputxbar[8] = (uint32_t)MW_OUTPUTXBAR8_GROUP4_SEL;
    group5_outputxbar[8] = (uint32_t)MW_OUTPUTXBAR8_GROUP5_SEL;
    group6_outputxbar[8] = (uint32_t)MW_OUTPUTXBAR8_GROUP6_SEL;
    group7_outputxbar[8] = (uint32_t)MW_OUTPUTXBAR8_GROUP7_SEL;
    group8_outputxbar[8] = (uint32_t)MW_OUTPUTXBAR8_GROUP8_SEL;
    group9_outputxbar[8] = (uint32_t)MW_OUTPUTXBAR8_GROUP9_SEL;
    group10_outputxbar[8] = (uint32_t)MW_OUTPUTXBAR8_GROUP10_SEL;
    group0_outputxbar[9] = (uint32_t)MW_OUTPUTXBAR9_GROUP0_SEL;
    group1_outputxbar[9] = (uint32_t)MW_OUTPUTXBAR9_GROUP1_SEL;
    group2_outputxbar[9] = (uint32_t)MW_OUTPUTXBAR9_GROUP2_SEL;
    group3_outputxbar[9] = (uint32_t)MW_OUTPUTXBAR9_GROUP3_SEL;
    group4_outputxbar[9] = (uint32_t)MW_OUTPUTXBAR9_GROUP4_SEL;
    group5_outputxbar[9] = (uint32_t)MW_OUTPUTXBAR9_GROUP5_SEL;
    group6_outputxbar[9] = (uint32_t)MW_OUTPUTXBAR9_GROUP6_SEL;
    group7_outputxbar[9] = (uint32_t)MW_OUTPUTXBAR9_GROUP7_SEL;
    group8_outputxbar[9] = (uint32_t)MW_OUTPUTXBAR9_GROUP8_SEL;
    group9_outputxbar[9] = (uint32_t)MW_OUTPUTXBAR9_GROUP9_SEL;
    group10_outputxbar[9] = (uint32_t)MW_OUTPUTXBAR9_GROUP10_SEL;
    group0_outputxbar[10] = (uint32_t)MW_OUTPUTXBAR10_GROUP0_SEL;
    group1_outputxbar[10] = (uint32_t)MW_OUTPUTXBAR10_GROUP1_SEL;
    group2_outputxbar[10] = (uint32_t)MW_OUTPUTXBAR10_GROUP2_SEL;
    group3_outputxbar[10] = (uint32_t)MW_OUTPUTXBAR10_GROUP3_SEL;
    group4_outputxbar[10] = (uint32_t)MW_OUTPUTXBAR10_GROUP4_SEL;
    group5_outputxbar[10] = (uint32_t)MW_OUTPUTXBAR10_GROUP5_SEL;
    group6_outputxbar[10] = (uint32_t)MW_OUTPUTXBAR10_GROUP6_SEL;
    group7_outputxbar[10] = (uint32_t)MW_OUTPUTXBAR10_GROUP7_SEL;
    group8_outputxbar[10] = (uint32_t)MW_OUTPUTXBAR10_GROUP8_SEL;
    group9_outputxbar[10] = (uint32_t)MW_OUTPUTXBAR10_GROUP9_SEL;
    group10_outputxbar[10] = (uint32_t)MW_OUTPUTXBAR10_GROUP10_SEL;
    group0_outputxbar[11] = (uint32_t)MW_OUTPUTXBAR11_GROUP0_SEL;
    group1_outputxbar[11] = (uint32_t)MW_OUTPUTXBAR11_GROUP1_SEL;
    group2_outputxbar[11] = (uint32_t)MW_OUTPUTXBAR11_GROUP2_SEL;
    group3_outputxbar[11] = (uint32_t)MW_OUTPUTXBAR11_GROUP3_SEL;
    group4_outputxbar[11] = (uint32_t)MW_OUTPUTXBAR11_GROUP4_SEL;
    group5_outputxbar[11] = (uint32_t)MW_OUTPUTXBAR11_GROUP5_SEL;
    group6_outputxbar[11] = (uint32_t)MW_OUTPUTXBAR11_GROUP6_SEL;
    group7_outputxbar[11] = (uint32_t)MW_OUTPUTXBAR11_GROUP7_SEL;
    group8_outputxbar[11] = (uint32_t)MW_OUTPUTXBAR11_GROUP8_SEL;
    group9_outputxbar[11] = (uint32_t)MW_OUTPUTXBAR11_GROUP9_SEL;
    group10_outputxbar[11] = (uint32_t)MW_OUTPUTXBAR11_GROUP10_SEL;
    group0_outputxbar[12] = (uint32_t)MW_OUTPUTXBAR12_GROUP0_SEL;
    group1_outputxbar[12] = (uint32_t)MW_OUTPUTXBAR12_GROUP1_SEL;
    group2_outputxbar[12] = (uint32_t)MW_OUTPUTXBAR12_GROUP2_SEL;
    group3_outputxbar[12] = (uint32_t)MW_OUTPUTXBAR12_GROUP3_SEL;
    group4_outputxbar[12] = (uint32_t)MW_OUTPUTXBAR12_GROUP4_SEL;
    group5_outputxbar[12] = (uint32_t)MW_OUTPUTXBAR12_GROUP5_SEL;
    group6_outputxbar[12] = (uint32_t)MW_OUTPUTXBAR12_GROUP6_SEL;
    group7_outputxbar[12] = (uint32_t)MW_OUTPUTXBAR12_GROUP7_SEL;
    group8_outputxbar[12] = (uint32_t)MW_OUTPUTXBAR12_GROUP8_SEL;
    group9_outputxbar[12] = (uint32_t)MW_OUTPUTXBAR12_GROUP9_SEL;
    group10_outputxbar[12] = (uint32_t)MW_OUTPUTXBAR12_GROUP10_SEL;
    group0_outputxbar[13] = (uint32_t)MW_OUTPUTXBAR13_GROUP0_SEL;
    group1_outputxbar[13] = (uint32_t)MW_OUTPUTXBAR13_GROUP1_SEL;
    group2_outputxbar[13] = (uint32_t)MW_OUTPUTXBAR13_GROUP2_SEL;
    group3_outputxbar[13] = (uint32_t)MW_OUTPUTXBAR13_GROUP3_SEL;
    group4_outputxbar[13] = (uint32_t)MW_OUTPUTXBAR13_GROUP4_SEL;
    group5_outputxbar[13] = (uint32_t)MW_OUTPUTXBAR13_GROUP5_SEL;
    group6_outputxbar[13] = (uint32_t)MW_OUTPUTXBAR13_GROUP6_SEL;
    group7_outputxbar[13] = (uint32_t)MW_OUTPUTXBAR13_GROUP7_SEL;
    group8_outputxbar[13] = (uint32_t)MW_OUTPUTXBAR13_GROUP8_SEL;
    group9_outputxbar[13] = (uint32_t)MW_OUTPUTXBAR13_GROUP9_SEL;
    group10_outputxbar[13] = (uint32_t)MW_OUTPUTXBAR13_GROUP10_SEL;
    group0_outputxbar[14] = (uint32_t)MW_OUTPUTXBAR14_GROUP0_SEL;
    group1_outputxbar[14] = (uint32_t)MW_OUTPUTXBAR14_GROUP1_SEL;
    group2_outputxbar[14] = (uint32_t)MW_OUTPUTXBAR14_GROUP2_SEL;
    group3_outputxbar[14] = (uint32_t)MW_OUTPUTXBAR14_GROUP3_SEL;
    group4_outputxbar[14] = (uint32_t)MW_OUTPUTXBAR14_GROUP4_SEL;
    group5_outputxbar[14] = (uint32_t)MW_OUTPUTXBAR14_GROUP5_SEL;
    group6_outputxbar[14] = (uint32_t)MW_OUTPUTXBAR14_GROUP6_SEL;
    group7_outputxbar[14] = (uint32_t)MW_OUTPUTXBAR14_GROUP7_SEL;
    group8_outputxbar[14] = (uint32_t)MW_OUTPUTXBAR14_GROUP8_SEL;
    group9_outputxbar[14] = (uint32_t)MW_OUTPUTXBAR14_GROUP9_SEL;
    group10_outputxbar[14] = (uint32_t)MW_OUTPUTXBAR14_GROUP10_SEL;
    group0_outputxbar[15] = (uint32_t)MW_OUTPUTXBAR15_GROUP0_SEL;
    group1_outputxbar[15] = (uint32_t)MW_OUTPUTXBAR15_GROUP1_SEL;
    group2_outputxbar[15] = (uint32_t)MW_OUTPUTXBAR15_GROUP2_SEL;
    group3_outputxbar[15] = (uint32_t)MW_OUTPUTXBAR15_GROUP3_SEL;
    group4_outputxbar[15] = (uint32_t)MW_OUTPUTXBAR15_GROUP4_SEL;
    group5_outputxbar[15] = (uint32_t)MW_OUTPUTXBAR15_GROUP5_SEL;
    group6_outputxbar[15] = (uint32_t)MW_OUTPUTXBAR15_GROUP6_SEL;
    group7_outputxbar[15] = (uint32_t)MW_OUTPUTXBAR15_GROUP7_SEL;
    group8_outputxbar[15] = (uint32_t)MW_OUTPUTXBAR15_GROUP8_SEL;
    group9_outputxbar[15] = (uint32_t)MW_OUTPUTXBAR15_GROUP9_SEL;
    group10_outputxbar[15] = (uint32_t)MW_OUTPUTXBAR15_GROUP10_SEL;


    
