TexasInstruments/am26x-hsp/src/am263x_init.c
    for(int i=0; i<=15; i++)
    {
        switch(i)
        {
            case 0:
                invertOutputBeforeLatch[i] = MW_OUTPUTXBAR0_INVERT_OUTPUT_BEFORE_LATCH_SEL;
                invertOutput[i] = MW_OUTPUTXBAR0_INVERT_XBAR_OUTPUT_SEL;
                latchSignalSource[i] = MW_OUTPUTXBAR0_LATCH_SIGNAL_SOURCE_SEL;
                stretchedPulseOutput[i] = MW_OUTPUTXBAR0_STRETCHED_PULSE_SOURCE_SEL;
                stretchedPulseLength[i] = MW_OUTPUTXBAR0_STRETCHED_PULSE_LENGTH_SEL;
                break;
            case 1:
                invertOutputBeforeLatch[i] = MW_OUTPUTXBAR1_INVERT_OUTPUT_BEFORE_LATCH_SEL;
                invertOutput[i] = MW_OUTPUTXBAR1_INVERT_XBAR_OUTPUT_SEL;
                latchSignalSource[i] = MW_OUTPUTXBAR1_LATCH_SIGNAL_SOURCE_SEL;
                stretchedPulseOutput[i] = MW_OUTPUTXBAR1_STRETCHED_PULSE_SOURCE_SEL;
                stretchedPulseLength[i] = MW_OUTPUTXBAR1_STRETCHED_PULSE_LENGTH_SEL;
                break;
            case 2:
                invertOutputBeforeLatch[i] = MW_OUTPUTXBAR2_INVERT_OUTPUT_BEFORE_LATCH_SEL;
                invertOutput[i] = MW_OUTPUTXBAR2_INVERT_XBAR_OUTPUT_SEL;
                latchSignalSource[i] = MW_OUTPUTXBAR2_LATCH_SIGNAL_SOURCE_SEL;
                stretchedPulseOutput[i] = MW_OUTPUTXBAR2_STRETCHED_PULSE_SOURCE_SEL;
                stretchedPulseLength[i] = MW_OUTPUTXBAR2_STRETCHED_PULSE_LENGTH_SEL;
                break;
            case 3:
                invertOutputBeforeLatch[i] = MW_OUTPUTXBAR3_INVERT_OUTPUT_BEFORE_LATCH_SEL;
                invertOutput[i] = MW_OUTPUTXBAR3_INVERT_XBAR_OUTPUT_SEL;
                latchSignalSource[i] = MW_OUTPUTXBAR3_LATCH_SIGNAL_SOURCE_SEL;
                stretchedPulseOutput[i] = MW_OUTPUTXBAR3_STRETCHED_PULSE_SOURCE_SEL;
                stretchedPulseLength[i] = MW_OUTPUTXBAR3_STRETCHED_PULSE_LENGTH_SEL;
                break;
            case 4:
                invertOutputBeforeLatch[i] = MW_OUTPUTXBAR4_INVERT_OUTPUT_BEFORE_LATCH_SEL;
                invertOutput[i] = MW_OUTPUTXBAR4_INVERT_XBAR_OUTPUT_SEL;
                latchSignalSource[i] = MW_OUTPUTXBAR4_LATCH_SIGNAL_SOURCE_SEL;
                stretchedPulseOutput[i] = MW_OUTPUTXBAR4_STRETCHED_PULSE_SOURCE_SEL;
                stretchedPulseLength[i] = MW_OUTPUTXBAR4_STRETCHED_PULSE_LENGTH_SEL;
                break;
            case 5:
                invertOutputBeforeLatch[i] = MW_OUTPUTXBAR5_INVERT_OUTPUT_BEFORE_LATCH_SEL;
                invertOutput[i] = MW_OUTPUTXBAR5_INVERT_XBAR_OUTPUT_SEL;
                latchSignalSource[i] = MW_OUTPUTXBAR5_LATCH_SIGNAL_SOURCE_SEL;
                stretchedPulseOutput[i] = MW_OUTPUTXBAR5_STRETCHED_PULSE_SOURCE_SEL;
                stretchedPulseLength[i] = MW_OUTPUTXBAR5_STRETCHED_PULSE_LENGTH_SEL;
                break;
            case 6:
                invertOutputBeforeLatch[i] = MW_OUTPUTXBAR6_INVERT_OUTPUT_BEFORE_LATCH_SEL;
                invertOutput[i] = MW_OUTPUTXBAR6_INVERT_XBAR_OUTPUT_SEL;
                latchSignalSource[i] = MW_OUTPUTXBAR6_LATCH_SIGNAL_SOURCE_SEL;
                stretchedPulseOutput[i] = MW_OUTPUTXBAR6_STRETCHED_PULSE_SOURCE_SEL;
                stretchedPulseLength[i] = MW_OUTPUTXBAR6_STRETCHED_PULSE_LENGTH_SEL;
                break;
            case 7:
                invertOutputBeforeLatch[i] = MW_OUTPUTXBAR7_INVERT_OUTPUT_BEFORE_LATCH_SEL;
                invertOutput[i] = MW_OUTPUTXBAR7_INVERT_XBAR_OUTPUT_SEL;
                latchSignalSource[i] = MW_OUTPUTXBAR7_LATCH_SIGNAL_SOURCE_SEL;
                stretchedPulseOutput[i] = MW_OUTPUTXBAR7_STRETCHED_PULSE_SOURCE_SEL;
                stretchedPulseLength[i] = MW_OUTPUTXBAR7_STRETCHED_PULSE_LENGTH_SEL;
                break;
            case 8:
                invertOutputBeforeLatch[i] = MW_OUTPUTXBAR8_INVERT_OUTPUT_BEFORE_LATCH_SEL;
                invertOutput[i] = MW_OUTPUTXBAR8_INVERT_XBAR_OUTPUT_SEL;
                latchSignalSource[i] = MW_OUTPUTXBAR8_LATCH_SIGNAL_SOURCE_SEL;
                stretchedPulseOutput[i] = MW_OUTPUTXBAR8_STRETCHED_PULSE_SOURCE_SEL;
                stretchedPulseLength[i] = MW_OUTPUTXBAR8_STRETCHED_PULSE_LENGTH_SEL;
                break;
            case 9:
                invertOutputBeforeLatch[i] = MW_OUTPUTXBAR9_INVERT_OUTPUT_BEFORE_LATCH_SEL;
                invertOutput[i] = MW_OUTPUTXBAR9_INVERT_XBAR_OUTPUT_SEL;
                latchSignalSource[i] = MW_OUTPUTXBAR9_LATCH_SIGNAL_SOURCE_SEL;
                stretchedPulseOutput[i] = MW_OUTPUTXBAR9_STRETCHED_PULSE_SOURCE_SEL;
                stretchedPulseLength[i] = MW_OUTPUTXBAR9_STRETCHED_PULSE_LENGTH_SEL;
                break;
            case 10:
                invertOutputBeforeLatch[i] = MW_OUTPUTXBAR10_INVERT_OUTPUT_BEFORE_LATCH_SEL;
                invertOutput[i] = MW_OUTPUTXBAR10_INVERT_XBAR_OUTPUT_SEL;
                latchSignalSource[i] = MW_OUTPUTXBAR10_LATCH_SIGNAL_SOURCE_SEL;
                stretchedPulseOutput[i] = MW_OUTPUTXBAR10_STRETCHED_PULSE_SOURCE_SEL;
                stretchedPulseLength[i] = MW_OUTPUTXBAR10_STRETCHED_PULSE_LENGTH_SEL;
                break;
            case 11:
                invertOutputBeforeLatch[i] = MW_OUTPUTXBAR11_INVERT_OUTPUT_BEFORE_LATCH_SEL;
                invertOutput[i] = MW_OUTPUTXBAR11_INVERT_XBAR_OUTPUT_SEL;
                latchSignalSource[i] = MW_OUTPUTXBAR11_LATCH_SIGNAL_SOURCE_SEL;
                stretchedPulseOutput[i] = MW_OUTPUTXBAR11_STRETCHED_PULSE_SOURCE_SEL;
                stretchedPulseLength[i] = MW_OUTPUTXBAR11_STRETCHED_PULSE_LENGTH_SEL;
                break;
            case 12:
                invertOutputBeforeLatch[i] = MW_OUTPUTXBAR12_INVERT_OUTPUT_BEFORE_LATCH_SEL;
                invertOutput[i] = MW_OUTPUTXBAR12_INVERT_XBAR_OUTPUT_SEL;
                latchSignalSource[i] = MW_OUTPUTXBAR12_LATCH_SIGNAL_SOURCE_SEL;
                stretchedPulseOutput[i] = MW_OUTPUTXBAR12_STRETCHED_PULSE_SOURCE_SEL;
                stretchedPulseLength[i] = MW_OUTPUTXBAR12_STRETCHED_PULSE_LENGTH_SEL;
                break;
            case 13:
                invertOutputBeforeLatch[i] = MW_OUTPUTXBAR13_INVERT_OUTPUT_BEFORE_LATCH_SEL;
                invertOutput[i] = MW_OUTPUTXBAR13_INVERT_XBAR_OUTPUT_SEL;
                latchSignalSource[i] = MW_OUTPUTXBAR13_LATCH_SIGNAL_SOURCE_SEL;
                stretchedPulseOutput[i] = MW_OUTPUTXBAR13_STRETCHED_PULSE_SOURCE_SEL;
                stretchedPulseLength[i] = MW_OUTPUTXBAR13_STRETCHED_PULSE_LENGTH_SEL;
                break;
            case 14:
                invertOutputBeforeLatch[i] = MW_OUTPUTXBAR14_INVERT_OUTPUT_BEFORE_LATCH_SEL;
                invertOutput[i] = MW_OUTPUTXBAR14_INVERT_XBAR_OUTPUT_SEL;
                latchSignalSource[i] = MW_OUTPUTXBAR14_LATCH_SIGNAL_SOURCE_SEL;
                stretchedPulseOutput[i] = MW_OUTPUTXBAR14_STRETCHED_PULSE_SOURCE_SEL;
                stretchedPulseLength[i] = MW_OUTPUTXBAR14_STRETCHED_PULSE_LENGTH_SEL;
                break;
            case 15:
                invertOutputBeforeLatch[i] = MW_OUTPUTXBAR15_INVERT_OUTPUT_BEFORE_LATCH_SEL;
                invertOutput[i] = MW_OUTPUTXBAR15_INVERT_XBAR_OUTPUT_SEL;
                latchSignalSource[i] = MW_OUTPUTXBAR15_LATCH_SIGNAL_SOURCE_SEL;
                stretchedPulseOutput[i] = MW_OUTPUTXBAR15_STRETCHED_PULSE_SOURCE_SEL;
                stretchedPulseLength[i] = MW_OUTPUTXBAR15_STRETCHED_PULSE_LENGTH_SEL;
                break;
            default:
                break;
        }     
    }

    uint32_t keyFactor = 0;
    for(int i=0;i<=15;i++)
    {
        keyFactor = pow(2, i);
        if(((group0_outputxbar[i]!=0) | (group1_outputxbar[i]!=0) | (group2_outputxbar[i]!=0) | (group3_outputxbar[i]!=0) | (group4_outputxbar[i]!=0) | (group5_outputxbar[i]!=0) | (group6_outputxbar[i]!=0) | (group7_outputxbar[i]!=0) | (group8_outputxbar[i]!=0) | (group9_outputxbar[i]!=0) | (group10_outputxbar[i]!=0)))
        {
            SOC_xbarSelectOutputXBarInputSource(CSL_CONTROLSS_OUTPUTXBAR_U_BASE, i, group0_outputxbar[i], group1_outputxbar[i], group2_outputxbar[i], group3_outputxbar[i], group4_outputxbar[i], group5_outputxbar[i], group6_outputxbar[i], group7_outputxbar[i], group8_outputxbar[i], group9_outputxbar[i], group10_outputxbar[i]);
            if(invertOutputBeforeLatch[i] == 0)
                SOC_xbarInvertOutputXBarOutputSignalBeforeLatch(CSL_CONTROLSS_OUTPUTXBAR_U_BASE, 0);
            else
                SOC_xbarInvertOutputXBarOutputSignalBeforeLatch(CSL_CONTROLSS_OUTPUTXBAR_U_BASE, keyFactor);
            if(invertOutput[i] == 0)
                SOC_xbarInvertOutputXBarOutputSignal(CSL_CONTROLSS_OUTPUTXBAR_U_BASE, keyFactor);
            else
                SOC_xbarInvertOutputXBarOutputSignal(CSL_CONTROLSS_OUTPUTXBAR_U_BASE, 0);
            if(latchSignalSource[i] == 0)
                SOC_xbarSelectLatchOutputXBarOutputSignal(CSL_CONTROLSS_OUTPUTXBAR_U_BASE, 0);
            else
                SOC_xbarSelectLatchOutputXBarOutputSignal(CSL_CONTROLSS_OUTPUTXBAR_U_BASE, keyFactor);
            if(stretchedPulseOutput[i] == 0)
                SOC_xbarSelectStretchedPulseOutputXBarOutputSignal(CSL_CONTROLSS_OUTPUTXBAR_U_BASE, 0);
            else
                SOC_xbarSelectStretchedPulseOutputXBarOutputSignal(CSL_CONTROLSS_OUTPUTXBAR_U_BASE, keyFactor);
            if(stretchedPulseLength[i] == 0)
                SOC_xbarSelectStretchedPulseLengthOutputXBarOutputSignal(CSL_CONTROLSS_OUTPUTXBAR_U_BASE, 0);
            else
                SOC_xbarSelectStretchedPulseLengthOutputXBarOutputSignal(CSL_CONTROLSS_OUTPUTXBAR_U_BASE, keyFactor);
        }

