TexasInstruments/am26x-hsp/src/am263x_init.c
    }


    Drivers_EPWMSyncOutputXBAR();
}

void Drivers_EPWMSyncOutputXBAR()
{
    uint32_t groupEPWMSyncOutputXbar[16];
    for(int i=0;i<=15;i++)
    {

        if((i==0) && (MW_OUTPUTXBAR0_GROUP9_SEL != 0))
        {
            if(MW_OUTPUTXBAR0_EPWM0SYNCOUT_INSTANCE_SEL == 1)
                SOC_xbarSelectPWMSyncOutXBarInput(CSL_CONTROLSS_PWMSYNCOUTXBAR_U_BASE, 0, MW_OUTPUTXBAR0_GROUP9_SEL);    
            else if(MW_OUTPUTXBAR0_EPWM1SYNCOUT_INSTANCE_SEL == 1)
                SOC_xbarSelectPWMSyncOutXBarInput(CSL_CONTROLSS_PWMSYNCOUTXBAR_U_BASE, 1, MW_OUTPUTXBAR0_GROUP9_SEL);  
            else if(MW_OUTPUTXBAR0_EPWM2SYNCOUT_INSTANCE_SEL == 1)
                SOC_xbarSelectPWMSyncOutXBarInput(CSL_CONTROLSS_PWMSYNCOUTXBAR_U_BASE, 2, MW_OUTPUTXBAR0_GROUP9_SEL);  
            else if(MW_OUTPUTXBAR0_EPWM3SYNCOUT_INSTANCE_SEL == 1)
                SOC_xbarSelectPWMSyncOutXBarInput(CSL_CONTROLSS_PWMSYNCOUTXBAR_U_BASE, 3, MW_OUTPUTXBAR0_GROUP9_SEL); 
        }
        else if((i==1) && (MW_OUTPUTXBAR1_GROUP9_SEL != 0))
        {
            if(MW_OUTPUTXBAR1_EPWM0SYNCOUT_INSTANCE_SEL == 1)
                SOC_xbarSelectPWMSyncOutXBarInput(CSL_CONTROLSS_PWMSYNCOUTXBAR_U_BASE, 0, MW_OUTPUTXBAR1_GROUP9_SEL);    
            else if(MW_OUTPUTXBAR1_EPWM1SYNCOUT_INSTANCE_SEL == 1)
                SOC_xbarSelectPWMSyncOutXBarInput(CSL_CONTROLSS_PWMSYNCOUTXBAR_U_BASE, 1, MW_OUTPUTXBAR1_GROUP9_SEL);  
            else if(MW_OUTPUTXBAR1_EPWM2SYNCOUT_INSTANCE_SEL == 1)
                SOC_xbarSelectPWMSyncOutXBarInput(CSL_CONTROLSS_PWMSYNCOUTXBAR_U_BASE, 2, MW_OUTPUTXBAR1_GROUP9_SEL);  
            else if(MW_OUTPUTXBAR1_EPWM3SYNCOUT_INSTANCE_SEL == 1)
                SOC_xbarSelectPWMSyncOutXBarInput(CSL_CONTROLSS_PWMSYNCOUTXBAR_U_BASE, 3, MW_OUTPUTXBAR1_GROUP9_SEL); 
        }
        else if((i==2) && (MW_OUTPUTXBAR2_GROUP9_SEL != 0))
        {
            if(MW_OUTPUTXBAR2_EPWM0SYNCOUT_INSTANCE_SEL == 1)
                SOC_xbarSelectPWMSyncOutXBarInput(CSL_CONTROLSS_PWMSYNCOUTXBAR_U_BASE, 0, MW_OUTPUTXBAR2_GROUP9_SEL);    
            else if(MW_OUTPUTXBAR2_EPWM1SYNCOUT_INSTANCE_SEL == 1)
                SOC_xbarSelectPWMSyncOutXBarInput(CSL_CONTROLSS_PWMSYNCOUTXBAR_U_BASE, 1, MW_OUTPUTXBAR2_GROUP9_SEL);  
            else if(MW_OUTPUTXBAR2_EPWM2SYNCOUT_INSTANCE_SEL == 1)
                SOC_xbarSelectPWMSyncOutXBarInput(CSL_CONTROLSS_PWMSYNCOUTXBAR_U_BASE, 2, MW_OUTPUTXBAR2_GROUP9_SEL);  
            else if(MW_OUTPUTXBAR2_EPWM3SYNCOUT_INSTANCE_SEL == 1)
                SOC_xbarSelectPWMSyncOutXBarInput(CSL_CONTROLSS_PWMSYNCOUTXBAR_U_BASE, 3, MW_OUTPUTXBAR2_GROUP9_SEL); 
        }
        else if((i==3) && (MW_OUTPUTXBAR3_GROUP9_SEL != 0))
        {
            if(MW_OUTPUTXBAR3_EPWM0SYNCOUT_INSTANCE_SEL == 1)
                SOC_xbarSelectPWMSyncOutXBarInput(CSL_CONTROLSS_PWMSYNCOUTXBAR_U_BASE, 0, MW_OUTPUTXBAR3_GROUP9_SEL);    
            else if(MW_OUTPUTXBAR3_EPWM1SYNCOUT_INSTANCE_SEL == 1)
                SOC_xbarSelectPWMSyncOutXBarInput(CSL_CONTROLSS_PWMSYNCOUTXBAR_U_BASE, 1, MW_OUTPUTXBAR3_GROUP9_SEL);  
            else if(MW_OUTPUTXBAR3_EPWM2SYNCOUT_INSTANCE_SEL == 1)
                SOC_xbarSelectPWMSyncOutXBarInput(CSL_CONTROLSS_PWMSYNCOUTXBAR_U_BASE, 2, MW_OUTPUTXBAR3_GROUP9_SEL);  
            else if(MW_OUTPUTXBAR3_EPWM3SYNCOUT_INSTANCE_SEL == 1)
                SOC_xbarSelectPWMSyncOutXBarInput(CSL_CONTROLSS_PWMSYNCOUTXBAR_U_BASE, 3, MW_OUTPUTXBAR3_GROUP9_SEL); 
        }
        else if((i==4) && (MW_OUTPUTXBAR4_GROUP9_SEL != 0))
        {
            if(MW_OUTPUTXBAR4_EPWM0SYNCOUT_INSTANCE_SEL == 1)
                SOC_xbarSelectPWMSyncOutXBarInput(CSL_CONTROLSS_PWMSYNCOUTXBAR_U_BASE, 0, MW_OUTPUTXBAR4_GROUP9_SEL);    
            else if(MW_OUTPUTXBAR4_EPWM1SYNCOUT_INSTANCE_SEL == 1)
                SOC_xbarSelectPWMSyncOutXBarInput(CSL_CONTROLSS_PWMSYNCOUTXBAR_U_BASE, 1, MW_OUTPUTXBAR4_GROUP9_SEL);  
            else if(MW_OUTPUTXBAR4_EPWM2SYNCOUT_INSTANCE_SEL == 1)
                SOC_xbarSelectPWMSyncOutXBarInput(CSL_CONTROLSS_PWMSYNCOUTXBAR_U_BASE, 2, MW_OUTPUTXBAR4_GROUP9_SEL);  
            else if(MW_OUTPUTXBAR4_EPWM3SYNCOUT_INSTANCE_SEL == 1)
                SOC_xbarSelectPWMSyncOutXBarInput(CSL_CONTROLSS_PWMSYNCOUTXBAR_U_BASE, 3, MW_OUTPUTXBAR4_GROUP9_SEL); 
        }
        else if((i==5) && (MW_OUTPUTXBAR5_GROUP9_SEL != 0))
        {
            if(MW_OUTPUTXBAR5_EPWM0SYNCOUT_INSTANCE_SEL == 1)
                SOC_xbarSelectPWMSyncOutXBarInput(CSL_CONTROLSS_PWMSYNCOUTXBAR_U_BASE, 0, MW_OUTPUTXBAR5_GROUP9_SEL);    
            else if(MW_OUTPUTXBAR5_EPWM1SYNCOUT_INSTANCE_SEL == 1)
                SOC_xbarSelectPWMSyncOutXBarInput(CSL_CONTROLSS_PWMSYNCOUTXBAR_U_BASE, 1, MW_OUTPUTXBAR5_GROUP9_SEL);  
            else if(MW_OUTPUTXBAR5_EPWM2SYNCOUT_INSTANCE_SEL == 1)
                SOC_xbarSelectPWMSyncOutXBarInput(CSL_CONTROLSS_PWMSYNCOUTXBAR_U_BASE, 2, MW_OUTPUTXBAR5_GROUP9_SEL);  
            else if(MW_OUTPUTXBAR5_EPWM3SYNCOUT_INSTANCE_SEL == 1)
                SOC_xbarSelectPWMSyncOutXBarInput(CSL_CONTROLSS_PWMSYNCOUTXBAR_U_BASE, 3, MW_OUTPUTXBAR5_GROUP9_SEL); 
        }
        else if((i==6) && (MW_OUTPUTXBAR6_GROUP9_SEL != 0))
        {
            if(MW_OUTPUTXBAR6_EPWM0SYNCOUT_INSTANCE_SEL == 1)
                SOC_xbarSelectPWMSyncOutXBarInput(CSL_CONTROLSS_PWMSYNCOUTXBAR_U_BASE, 0, MW_OUTPUTXBAR6_GROUP9_SEL);    
            else if(MW_OUTPUTXBAR6_EPWM1SYNCOUT_INSTANCE_SEL == 1)
                SOC_xbarSelectPWMSyncOutXBarInput(CSL_CONTROLSS_PWMSYNCOUTXBAR_U_BASE, 1, MW_OUTPUTXBAR6_GROUP9_SEL);  
            else if(MW_OUTPUTXBAR6_EPWM2SYNCOUT_INSTANCE_SEL == 1)
                SOC_xbarSelectPWMSyncOutXBarInput(CSL_CONTROLSS_PWMSYNCOUTXBAR_U_BASE, 2, MW_OUTPUTXBAR6_GROUP9_SEL);  
            else if(MW_OUTPUTXBAR6_EPWM3SYNCOUT_INSTANCE_SEL == 1)
                SOC_xbarSelectPWMSyncOutXBarInput(CSL_CONTROLSS_PWMSYNCOUTXBAR_U_BASE, 3, MW_OUTPUTXBAR6_GROUP9_SEL); 
        }
        else if((i==7) && (MW_OUTPUTXBAR7_GROUP9_SEL != 0))
        {
            if(MW_OUTPUTXBAR7_EPWM0SYNCOUT_INSTANCE_SEL == 1)
                SOC_xbarSelectPWMSyncOutXBarInput(CSL_CONTROLSS_PWMSYNCOUTXBAR_U_BASE, 0, MW_OUTPUTXBAR7_GROUP9_SEL);    
            else if(MW_OUTPUTXBAR7_EPWM1SYNCOUT_INSTANCE_SEL == 1)
                SOC_xbarSelectPWMSyncOutXBarInput(CSL_CONTROLSS_PWMSYNCOUTXBAR_U_BASE, 1, MW_OUTPUTXBAR7_GROUP9_SEL);  
            else if(MW_OUTPUTXBAR7_EPWM2SYNCOUT_INSTANCE_SEL == 1)
                SOC_xbarSelectPWMSyncOutXBarInput(CSL_CONTROLSS_PWMSYNCOUTXBAR_U_BASE, 2, MW_OUTPUTXBAR7_GROUP9_SEL);  
            else if(MW_OUTPUTXBAR7_EPWM3SYNCOUT_INSTANCE_SEL == 1)
                SOC_xbarSelectPWMSyncOutXBarInput(CSL_CONTROLSS_PWMSYNCOUTXBAR_U_BASE, 3, MW_OUTPUTXBAR7_GROUP9_SEL);  
        }
        else if((i==8) && (MW_OUTPUTXBAR8_GROUP9_SEL != 0))
        {
            if(MW_OUTPUTXBAR8_EPWM0SYNCOUT_INSTANCE_SEL == 1)
                SOC_xbarSelectPWMSyncOutXBarInput(CSL_CONTROLSS_PWMSYNCOUTXBAR_U_BASE, 0, MW_OUTPUTXBAR8_GROUP9_SEL);    
            else if(MW_OUTPUTXBAR8_EPWM1SYNCOUT_INSTANCE_SEL == 1)
                SOC_xbarSelectPWMSyncOutXBarInput(CSL_CONTROLSS_PWMSYNCOUTXBAR_U_BASE, 1, MW_OUTPUTXBAR8_GROUP9_SEL);  
            else if(MW_OUTPUTXBAR8_EPWM2SYNCOUT_INSTANCE_SEL == 1)
                SOC_xbarSelectPWMSyncOutXBarInput(CSL_CONTROLSS_PWMSYNCOUTXBAR_U_BASE, 2, MW_OUTPUTXBAR8_GROUP9_SEL);  
            else if(MW_OUTPUTXBAR8_EPWM3SYNCOUT_INSTANCE_SEL == 1)
                SOC_xbarSelectPWMSyncOutXBarInput(CSL_CONTROLSS_PWMSYNCOUTXBAR_U_BASE, 3, MW_OUTPUTXBAR8_GROUP9_SEL);  
        }
        else if((i==9) && (MW_OUTPUTXBAR9_GROUP9_SEL != 0))
        {
            if(MW_OUTPUTXBAR9_EPWM0SYNCOUT_INSTANCE_SEL == 1)
                SOC_xbarSelectPWMSyncOutXBarInput(CSL_CONTROLSS_PWMSYNCOUTXBAR_U_BASE, 0, MW_OUTPUTXBAR9_GROUP9_SEL);    
            else if(MW_OUTPUTXBAR9_EPWM1SYNCOUT_INSTANCE_SEL == 1)
                SOC_xbarSelectPWMSyncOutXBarInput(CSL_CONTROLSS_PWMSYNCOUTXBAR_U_BASE, 1, MW_OUTPUTXBAR9_GROUP9_SEL);  
            else if(MW_OUTPUTXBAR9_EPWM2SYNCOUT_INSTANCE_SEL == 1)
                SOC_xbarSelectPWMSyncOutXBarInput(CSL_CONTROLSS_PWMSYNCOUTXBAR_U_BASE, 2, MW_OUTPUTXBAR9_GROUP9_SEL);  
            else if(MW_OUTPUTXBAR9_EPWM3SYNCOUT_INSTANCE_SEL == 1)
                SOC_xbarSelectPWMSyncOutXBarInput(CSL_CONTROLSS_PWMSYNCOUTXBAR_U_BASE, 3, MW_OUTPUTXBAR9_GROUP9_SEL);  
        }
        else if((i==10) && (MW_OUTPUTXBAR10_GROUP9_SEL != 0))
        {
            if(MW_OUTPUTXBAR10_EPWM0SYNCOUT_INSTANCE_SEL == 1)
                SOC_xbarSelectPWMSyncOutXBarInput(CSL_CONTROLSS_PWMSYNCOUTXBAR_U_BASE, 0, MW_OUTPUTXBAR10_GROUP9_SEL);    
            else if(MW_OUTPUTXBAR10_EPWM1SYNCOUT_INSTANCE_SEL == 1)
                SOC_xbarSelectPWMSyncOutXBarInput(CSL_CONTROLSS_PWMSYNCOUTXBAR_U_BASE, 1, MW_OUTPUTXBAR10_GROUP9_SEL);  
            else if(MW_OUTPUTXBAR10_EPWM2SYNCOUT_INSTANCE_SEL == 1)
                SOC_xbarSelectPWMSyncOutXBarInput(CSL_CONTROLSS_PWMSYNCOUTXBAR_U_BASE, 2, MW_OUTPUTXBAR10_GROUP9_SEL);  
            else if(MW_OUTPUTXBAR10_EPWM3SYNCOUT_INSTANCE_SEL == 1)
                SOC_xbarSelectPWMSyncOutXBarInput(CSL_CONTROLSS_PWMSYNCOUTXBAR_U_BASE, 3, MW_OUTPUTXBAR10_GROUP9_SEL);  
        }
        else if((i==11) && (MW_OUTPUTXBAR11_GROUP9_SEL != 0))
        {
            if(MW_OUTPUTXBAR11_EPWM0SYNCOUT_INSTANCE_SEL == 1)
                SOC_xbarSelectPWMSyncOutXBarInput(CSL_CONTROLSS_PWMSYNCOUTXBAR_U_BASE, 0, MW_OUTPUTXBAR11_GROUP9_SEL);    
            else if(MW_OUTPUTXBAR11_EPWM1SYNCOUT_INSTANCE_SEL == 1)
                SOC_xbarSelectPWMSyncOutXBarInput(CSL_CONTROLSS_PWMSYNCOUTXBAR_U_BASE, 1, MW_OUTPUTXBAR11_GROUP9_SEL);  
            else if(MW_OUTPUTXBAR11_EPWM2SYNCOUT_INSTANCE_SEL == 1)
                SOC_xbarSelectPWMSyncOutXBarInput(CSL_CONTROLSS_PWMSYNCOUTXBAR_U_BASE, 2, MW_OUTPUTXBAR11_GROUP9_SEL);  
            else if(MW_OUTPUTXBAR11_EPWM3SYNCOUT_INSTANCE_SEL == 1)
                SOC_xbarSelectPWMSyncOutXBarInput(CSL_CONTROLSS_PWMSYNCOUTXBAR_U_BASE, 3, MW_OUTPUTXBAR11_GROUP9_SEL); 
        }
        else if((i==12) && (MW_OUTPUTXBAR12_GROUP9_SEL != 0))
        {
            if(MW_OUTPUTXBAR12_EPWM0SYNCOUT_INSTANCE_SEL == 1)
                SOC_xbarSelectPWMSyncOutXBarInput(CSL_CONTROLSS_PWMSYNCOUTXBAR_U_BASE, 0, MW_OUTPUTXBAR12_GROUP9_SEL);    
            else if(MW_OUTPUTXBAR12_EPWM1SYNCOUT_INSTANCE_SEL == 1)
                SOC_xbarSelectPWMSyncOutXBarInput(CSL_CONTROLSS_PWMSYNCOUTXBAR_U_BASE, 1, MW_OUTPUTXBAR12_GROUP9_SEL);  
            else if(MW_OUTPUTXBAR12_EPWM2SYNCOUT_INSTANCE_SEL == 1)
                SOC_xbarSelectPWMSyncOutXBarInput(CSL_CONTROLSS_PWMSYNCOUTXBAR_U_BASE, 2, MW_OUTPUTXBAR12_GROUP9_SEL);  
            else if(MW_OUTPUTXBAR12_EPWM3SYNCOUT_INSTANCE_SEL == 1)
                SOC_xbarSelectPWMSyncOutXBarInput(CSL_CONTROLSS_PWMSYNCOUTXBAR_U_BASE, 3, MW_OUTPUTXBAR12_GROUP9_SEL); 
        }
        else if((i==13) && (MW_OUTPUTXBAR13_GROUP9_SEL != 0))
        {
            if(MW_OUTPUTXBAR13_EPWM0SYNCOUT_INSTANCE_SEL == 1)
                SOC_xbarSelectPWMSyncOutXBarInput(CSL_CONTROLSS_PWMSYNCOUTXBAR_U_BASE, 0, MW_OUTPUTXBAR13_GROUP9_SEL);    
            else if(MW_OUTPUTXBAR13_EPWM1SYNCOUT_INSTANCE_SEL == 1)
                SOC_xbarSelectPWMSyncOutXBarInput(CSL_CONTROLSS_PWMSYNCOUTXBAR_U_BASE, 1, MW_OUTPUTXBAR13_GROUP9_SEL);  
            else if(MW_OUTPUTXBAR13_EPWM2SYNCOUT_INSTANCE_SEL == 1)
                SOC_xbarSelectPWMSyncOutXBarInput(CSL_CONTROLSS_PWMSYNCOUTXBAR_U_BASE, 2, MW_OUTPUTXBAR13_GROUP9_SEL);  
            else if(MW_OUTPUTXBAR13_EPWM3SYNCOUT_INSTANCE_SEL == 1)
                SOC_xbarSelectPWMSyncOutXBarInput(CSL_CONTROLSS_PWMSYNCOUTXBAR_U_BASE, 3, MW_OUTPUTXBAR13_GROUP9_SEL); 
        }
        else if((i==14) && (MW_OUTPUTXBAR14_GROUP9_SEL != 0))
        {
            if(MW_OUTPUTXBAR14_EPWM0SYNCOUT_INSTANCE_SEL == 1)
                SOC_xbarSelectPWMSyncOutXBarInput(CSL_CONTROLSS_PWMSYNCOUTXBAR_U_BASE, 0, MW_OUTPUTXBAR14_GROUP9_SEL);    
            else if(MW_OUTPUTXBAR14_EPWM1SYNCOUT_INSTANCE_SEL == 1)
                SOC_xbarSelectPWMSyncOutXBarInput(CSL_CONTROLSS_PWMSYNCOUTXBAR_U_BASE, 1, MW_OUTPUTXBAR14_GROUP9_SEL);  
            else if(MW_OUTPUTXBAR14_EPWM2SYNCOUT_INSTANCE_SEL == 1)
                SOC_xbarSelectPWMSyncOutXBarInput(CSL_CONTROLSS_PWMSYNCOUTXBAR_U_BASE, 2, MW_OUTPUTXBAR14_GROUP9_SEL);  
            else if(MW_OUTPUTXBAR14_EPWM3SYNCOUT_INSTANCE_SEL == 1)
                SOC_xbarSelectPWMSyncOutXBarInput(CSL_CONTROLSS_PWMSYNCOUTXBAR_U_BASE, 3, MW_OUTPUTXBAR14_GROUP9_SEL); 
        }
        else if((i==15) && (MW_OUTPUTXBAR15_GROUP9_SEL != 0))
        {
            if(MW_OUTPUTXBAR15_EPWM0SYNCOUT_INSTANCE_SEL == 1)
                SOC_xbarSelectPWMSyncOutXBarInput(CSL_CONTROLSS_PWMSYNCOUTXBAR_U_BASE, 0, MW_OUTPUTXBAR15_GROUP9_SEL);    
            else if(MW_OUTPUTXBAR15_EPWM1SYNCOUT_INSTANCE_SEL == 1)
                SOC_xbarSelectPWMSyncOutXBarInput(CSL_CONTROLSS_PWMSYNCOUTXBAR_U_BASE, 1, MW_OUTPUTXBAR15_GROUP9_SEL);  
            else if(MW_OUTPUTXBAR15_EPWM2SYNCOUT_INSTANCE_SEL == 1)
                SOC_xbarSelectPWMSyncOutXBarInput(CSL_CONTROLSS_PWMSYNCOUTXBAR_U_BASE, 2, MW_OUTPUTXBAR15_GROUP9_SEL);  
            else if(MW_OUTPUTXBAR15_EPWM3SYNCOUT_INSTANCE_SEL == 1)
                SOC_xbarSelectPWMSyncOutXBarInput(CSL_CONTROLSS_PWMSYNCOUTXBAR_U_BASE, 3, MW_OUTPUTXBAR15_GROUP9_SEL); 
        }
   
