TexasInstruments/am26x-hsp/src/am263x_init.c
    }
}

void Drivers_epwmSyncoutXbarOpen()
{
    uint32_t groupEpwmSyncoutXbar[4];

    groupEpwmSyncoutXbar[0] = MW_EPWM_SYNCOUT_XBAR0_SEL;
    groupEpwmSyncoutXbar[1] = MW_EPWM_SYNCOUT_XBAR1_SEL;
    groupEpwmSyncoutXbar[2] = MW_EPWM_SYNCOUT_XBAR2_SEL;
    groupEpwmSyncoutXbar[3] = MW_EPWM_SYNCOUT_XBAR3_SEL;

    for(uint8_t i = 0; i < 4; i++)
    {
        if(groupEpwmSyncoutXbar[i]!=0)
        {
            SOC_xbarSelectPWMSyncOutXBarInput(CSL_CONTROLSS_PWMSYNCOUTXBAR_U_BASE, i,  groupEpwmSyncoutXbar[i]);
        }
    }
}

MCAN_BitTimingParams gMcanBitTimingDefaultParams;
MCAN_InitParams            initParams = {0U};
MCAN_ConfigParams          configParams = {0U};
MCAN_MsgRAMConfigParams    msgRAMConfigParams = {0U};
MCAN_BitTimingParams       bitTimes = {0U};
MCAN_ExtMsgIDFilterElement extFiltElem[MW_ELEMCNT_EXTFILT_MCAN0_SEL] = {0U};
MCAN_StdMsgIDFilterElement stdFiltElem[MW_ELEMCNT_STDFILT_MCAN0_SEL] = {0U};
uint32_t filter_cnt;


void Driver_mcanOpen(void)
{
    
    gMcanBitTimingDefaultParams.nomRatePrescalar = MW_PRESCALER_NOM_BITRATE_SEL;
    gMcanBitTimingDefaultParams.nomTimeSeg1 = MW_TIMESEG1_NOM_BITRATE_SEL;
    gMcanBitTimingDefaultParams.nomTimeSeg2 = MW_TIMESEG2_NOM_BITRATE_SEL;
    gMcanBitTimingDefaultParams.nomSynchJumpWidth = MW_SYNCH_JUMPWIDTH_NOM_BITRATE_SEL;
    gMcanBitTimingDefaultParams.dataRatePrescalar = MW_PRESCALER_DATA_BITRATE_SEL;
    gMcanBitTimingDefaultParams.dataTimeSeg1 = MW_TIMESEG1_DATA_BITRATE_SEL;
    gMcanBitTimingDefaultParams.dataTimeSeg2 = MW_TIMESEG2_DATA_BITRATE_SEL;
    gMcanBitTimingDefaultParams.dataSynchJumpWidth = MW_SYNCH_JUMPWIDTH_DATA_BITRATE_SEL;

}
#define CONFIG_I2C0 (0U)
#define CONFIG_I2C_NUM_INSTANCES (1U)
static I2C_HwAttrs gI2cHwAttrs[CONFIG_I2C_NUM_INSTANCES] =
{
    {
        .baseAddr       = CSL_I2C2_U_BASE,
        .intNum         = 46,
        .eventId        = 0,
        .funcClk        = 96000000U,
        .enableIntr     = 1,
        .ownTargetAddr   = 0x1C,
    },
};

static I2C_Object gI2cObjects[CONFIG_I2C_NUM_INSTANCES];
/* I2C driver configuration */
I2C_Config gI2cConfig[CONFIG_I2C_NUM_INSTANCES] =
{
    {
        .object = &gI2cObjects[CONFIG_I2C0],
        .hwAttrs = &gI2cHwAttrs[CONFIG_I2C0]
    },
};

uint32_t gI2cConfigNum = CONFIG_I2C_NUM_INSTANCES;

I2C_Handle gI2cHandle[CONFIG_I2C_NUM_INSTANCES];

/* I2C Driver Parameters */
I2C_Params gI2cParams[CONFIG_I2C_NUM_INSTANCES] =
{
    {
        .transferMode        = I2C_MODE_BLOCKING,
        .transferCallbackFxn = NULL,
        .bitRate             = I2C_400KHZ,
    },
};

void Drivers_i2cOpen(void)
{
    uint32_t instCnt;
    int32_t  status = SystemP_SUCCESS;

    for(instCnt = 0U; instCnt < CONFIG_I2C_NUM_INSTANCES; instCnt++)
    {
        gI2cHandle[instCnt] = NULL;   /* Init to NULL so that we can exit gracefully */
    }

    /* Open all instances */
    for(instCnt = 0U; instCnt < CONFIG_I2C_NUM_INSTANCES; instCnt++)
    {
        gI2cHandle[instCnt] = I2C_open(instCnt, &gI2cParams[instCnt]);
        if(NULL == gI2cHandle[instCnt])
        {
            DebugP_logError("I2C open failed for instance %d !!!\r\n", instCnt);
            status = SystemP_FAILURE;
            break;
        }
    }

    return;
}

void Drivers_i2cClose(void)
{
    uint32_t instCnt;

    /* Close all instances that are open */
    for(instCnt = 0U; instCnt < CONFIG_I2C_NUM_INSTANCES; instCnt++)
    {
        if(gI2cHandle[instCnt] != NULL)
        {
            I2C_close(gI2cHandle[instCnt]);
            gI2cHandle[instCnt] = NULL;
        }
    }

    return;
}

void mcanEnableTransceiverLP(void)
{
    GPIO_setDirMode(CSL_GPIO0_U_BASE, 51, GPIO_DIRECTION_INPUT);
    uint32_t    gpioBaseAddr, pinNum;

    gpioBaseAddr = (uint32_t)AddrTranslateP_getLocalAddr(CSL_GPIO0_U_BASE);
    pinNum       = 51;

    GPIO_setDirMode(gpioBaseAddr, pinNum, GPIO_DIRECTION_OUTPUT);

    GPIO_pinWriteLow(gpioBaseAddr, pinNum);
}

static void SetupI2CTransfer(I2C_Handle handle,  uint32_t targetAddr,
                      uint8_t *writeData, uint32_t numWriteBytes,
                      uint8_t *readData,  uint32_t numReadBytes)
{
    int32_t status;
    I2C_Transaction i2cTransaction;

    /* Enable Transceiver */
    I2C_Transaction_init(&i2cTransaction);
    i2cTransaction.targetAddress = targetAddr;
    i2cTransaction.writeBuf = (uint8_t *)&writeData[0];
    i2cTransaction.writeCount = numWriteBytes;
    i2cTransaction.readBuf = (uint8_t *)&readData[0];
    i2cTransaction.readCount = numReadBytes;
    status = I2C_transfer(handle, &i2cTransaction);
    DebugP_assert(SystemP_SUCCESS == status);
}

void mcanEnableTransceiverCC(void)
{
    I2C_Handle      i2cHandle;
    uint8_t         dataToSlave[4];

    i2cHandle = gI2cHandle[CONFIG_I2C0];
    dataToSlave[0] = TCA6416_REG_CONFIG0;
    dataToSlave[1] = 0x0U;
    SetupI2CTransfer(i2cHandle, 0x20, &dataToSlave[0], 1, &dataToSlave[1], 1);
    /* set the P00 to 0 make them output ports. */
    dataToSlave[1] &= ~(0x1U);
    SetupI2CTransfer(i2cHandle, 0x20, &dataToSlave[0], 2, NULL, 0);

    /* Get the port values. */
    dataToSlave[0] = TCA6416_REG_INPUT0;
    dataToSlave[1] = 0x0U;
    SetupI2CTransfer(i2cHandle, 0x20, &dataToSlave[0], 1, &dataToSlave[1], 1);

    /* Set P10 and P11 to 0.
     */
    dataToSlave[0] = TCA6416_REG_OUTPUT0;
    dataToSlave[1] &= ~(0x1);
    SetupI2CTransfer(i2cHandle, 0x20, &dataToSlave[0], 2, NULL, 0);
}


void App_mcanEnableIntr(uint32_t instance)
{
    uint32_t intrMask = 0x0;

    if(instance == 0)
    {

        if(MW_RX_FIFO0_INTR_MCAN0_SEL == 1)
            intrMask = intrMask | MCAN_INTR_SRC_RX_FIFO0_NEW_MSG;
        if(MW_RX_FIFO0_WTRMARK_INTR_MCAN0_SEL == 1)
            intrMask = intrMask | MCAN_INTR_SRC_RX_FIFO0_WATERMARK;
        if(MW_RX_FIFO0_FULL_INTR_MCAN0_SEL == 1)
            intrMask = intrMask | MCAN_INTR_SRC_RX_FIFO0_FULL;
        if(MW_RX_FIFO0_MSGLOST_INTR_MCAN0_SEL == 1)
            intrMask = intrMask | MCAN_INTR_SRC_RX_FIFO0_MSG_LOST;
        if(MW_RX_FIFO1_INTR_MCAN0_SEL == 1)
            intrMask = intrMask | MCAN_INTR_SRC_RX_FIFO1_NEW_MSG;
        if(MW_RX_FIFO1_WTRMARK_INTR_MCAN0_SEL == 1)     
            intrMask = intrMask | MCAN_INTR_SRC_RX_FIFO1_WATERMARK; 
        if(MW_RX_FIFO1_FULL_INTR_MCAN0_SEL == 1)
            intrMask = intrMask | MCAN_INTR_SRC_RX_FIFO1_FULL;
        if(MW_RX_FIFO1_MSGLOST_INTR_MCAN0_SEL == 1)
            intrMask = intrMask | MCAN_INTR_SRC_RX_FIFO1_MSG_LOST; 
        if(MW_HIGH_PRIOTYMSG_INTR_MCAN0_SEL == 1)
            intrMask = intrMask | MCAN_INTR_SRC_HIGH_PRIO_MSG;
        if(MW_TX_COMPLETED_INTR_MCAN0_SEL == 1)
            intrMask = intrMask | MCAN_INTR_SRC_TRANS_COMPLETE;
        if(MW_TX_CANCELFIN_INTR_MCAN0_SEL == 1)
            intrMask = intrMask | MCAN_INTR_SRC_TRANS_CANCEL_FINISH;
        if(MW_TX_FIFOEMPTY_INTR_MCAN0_SEL == 1)
            intrMask = intrMask | MCAN_INTR_SRC_TX_FIFO_EMPTY;
        if(MW_TX_FIFOEVT_NEWENTRY_INTR_MCAN0_SEL == 1)
            intrMask = intrMask | MCAN_INTR_SRC_TX_EVT_FIFO_NEW_ENTRY;
        if(MW_TX_FIFOEVT_WTRMARK_INTR_MCAN0_SEL == 1)
            intrMask = intrMask | MCAN_INTR_SRC_TX_EVT_FIFO_WATERMARK;
        if(MW_TX_FIFOEVT_FULL_INTR_MCAN0_SEL == 1)
            intrMask = intrMask | MCAN_INTR_SRC_TX_EVT_FIFO_FULL;
        if(MW_TX_FIFOEVT_ELTLOST_INTR_MCAN0_SEL == 1)
            intrMask = intrMask | MCAN_INTR_SRC_TX_EVT_FIFO_ELEM_LOST;
        if(MW_TIMESTMP_WRPAROUND_INTR_MCAN0_SEL == 1)
            intrMask = intrMask | MCAN_INTR_SRC_TIMESTAMP_WRAPAROUND;
        if(MW_MSGRAM_ACSFAIL_INTR_MCAN0_SEL == 1)
            intrMask = intrMask | MCAN_INTR_SRC_MSG_RAM_ACCESS_FAILURE;
        if(MW_TIMEOUT_INTR_MCAN0_SEL == 1)
            intrMask = intrMask | MCAN_INTR_SRC_TIMEOUT;  
        if(MW_MSGSTR_DEDRXBUF_INTR_MCAN0_SEL == 1)
            intrMask = intrMask | MCAN_INTR_SRC_DEDICATED_RX_BUFF_MSG;
        if(MW_BITERR_CORR_INTR_MCAN0_SEL == 1)
            intrMask = intrMask | MCAN_INTR_SRC_BIT_ERR_CORRECTED;
        if(MW_BITERR_UNCORR_INTR_MCAN0_SEL == 1)
            intrMask = intrMask | MCAN_INTR_SRC_BIT_ERR_UNCORRECTED;
        if(MW_ERRLOGGING_OVF_INTR_MCAN0_SEL == 1)
            intrMask = intrMask | MCAN_INTR_SRC_ERR_LOG_OVRFLW;
        if(MW_ERRPASSIVE_INTR_MCAN0_SEL == 1)
            intrMask = intrMask | MCAN_INTR_SRC_ERR_PASSIVE; 
        if(MW_WARNINGSTS_INTR_MCAN0_SEL == 1)
            intrMask = intrMask | MCAN_INTR_SRC_WARNING_STATUS;
        if(MW_BUSOFFSTS_INTR_MCAN0_SEL == 1)
            intrMask = intrMask | MCAN_INTR_SRC_BUS_OFF_STATUS;
        if(MW_WATCHDOG_INTR_MCAN0_SEL == 1)
            intrMask = intrMask | MCAN_INTR_SRC_WATCHDOG;
        if(MW_PROTOCOLERR_ARBPHASE_INTR_MCAN0_SEL == 1)
            intrMask = intrMask | MCAN_INTR_SRC_PROTOCOL_ERR_ARB;
        if(MCAN_INTR_SRC_PROTOCOL_ERR_DATA == 1)
            intrMask = intrMask | MCAN_INTR_SRC_PROTOCOL_ERR_DATA;
        if(MW_ACSRESADDR_INTR_MCAN0_SEL == 1)
            intrMask = intrMask | MCAN_INTR_SRC_RES_ADDR_ACCESS;

