TexasInstruments/am26x-hsp/src/am263x_init.c
                    if(MW_ENABLE_EXTFILT_MCAN3_SEL == 1)
                    {
                        for(j = 0; j < MW_ELEMCNT_EXTFILT_MCAN3_SEL; j++)
                        {
                            extFiltElem[j].efid1 = (uint32_t)(MW_EXTFILT_ID1_MCAN3_SEL) + j;
                            if(MW_EXTFILT_CONFIG_MCAN3_SEL != 7)
                                extFiltElem[j].efid2 = (uint32_t)(MW_EXTFILT_ID2_MCAN3_SEL);
                            else
                                extFiltElem[j].efid2 = (uint32_t)(MW_EXTFILT_ID2_MCAN3_SEL) + j;
                            if(MW_EXTFILT_CONFIG_MCAN3_SEL  == 7)
                                extFiltElem[j].efec = MCAN_EXT_FILT_ELEM_BUFFER;
                            else if(MW_EXTFILT_CONFIG_MCAN3_SEL == 1 | MW_EXTFILT_CONFIG_MCAN3_SEL == 5)
                                extFiltElem[j].efec = MCAN_EXT_FILT_ELEM_FIFO0;
                            else if(MW_EXTFILT_CONFIG_MCAN3_SEL == 2 | MW_EXTFILT_CONFIG_MCAN3_SEL == 6)    
                                extFiltElem[j].efec = MCAN_EXT_FILT_ELEM_FIFO1;
                            extFiltElem[j].eft = MW_EXTFILT_TYPE_MCAN3_SEL;
                        }

                    }
                

                while (FALSE == MCAN_isMemInitDone(CSL_MCAN3_MSG_RAM_U_BASE))
                {}
                MCAN_setOpMode(CSL_MCAN3_MSG_RAM_U_BASE, MCAN_OPERATION_MODE_SW_INIT);
                while (MCAN_OPERATION_MODE_SW_INIT != MCAN_getOpMode(CSL_MCAN3_MSG_RAM_U_BASE))
                {}

                MCAN_init(CSL_MCAN3_MSG_RAM_U_BASE, &initParams);
                MCAN_config(CSL_MCAN3_MSG_RAM_U_BASE, &configParams);
                MCAN_setBitTime(CSL_MCAN3_MSG_RAM_U_BASE, &bitTimes);
                MCAN_msgRAMConfig(CSL_MCAN3_MSG_RAM_U_BASE, &msgRAMConfigParams);
                MCAN_setExtIDAndMask(CSL_MCAN3_MSG_RAM_U_BASE, APP_MCAN_EXT_ID_MASK);

                
                    
                if(MW_ENABLE_STDFILT_MCAN3_SEL == 1)
                {
                    for(j = 0; j < MW_ELEMCNT_STDFILT_MCAN3_SEL; j++)
                    {
                        MCAN_addStdMsgIDFilter(CSL_MCAN3_MSG_RAM_U_BASE, j, &stdFiltElem[j]);
                    }
                }
                        
                if(MW_ENABLE_EXTFILT_MCAN3_SEL == 1)
                {
                    for(j = 0; j < MW_ELEMCNT_EXTFILT_MCAN3_SEL; j++)
                    {
                        MCAN_addExtMsgIDFilter(CSL_MCAN3_MSG_RAM_U_BASE, j, &extFiltElem[j]);
                    }

                }

                if (MW_ENABLE_INTLOOPBACK_MCAN3_SEL == 1)
                {
                    MCAN_lpbkModeEnable(CSL_MCAN3_MSG_RAM_U_BASE, MCAN_LPBK_MODE_INTERNAL, TRUE);
                }

                MCAN_setOpMode(CSL_MCAN3_MSG_RAM_U_BASE, MCAN_OPERATION_MODE_NORMAL);
                while (MCAN_OPERATION_MODE_NORMAL != MCAN_getOpMode(CSL_MCAN3_MSG_RAM_U_BASE))
                {}

            App_mcanEnableIntr(i);

        }

    }
}
}

#define MCSPI_NUM_INSTANCES (5U)
#define MCSPI_CHANNEL_NUM (2U)
MCSPI_ChConfig gConfigMcspi0ChCfg[2U];
MCSPI_ChConfig gConfigMcspi1ChCfg[2U];
MCSPI_ChConfig gConfigMcspi2ChCfg[2U];
MCSPI_ChConfig gConfigMcspi3ChCfg[2U];
MCSPI_ChConfig gConfigMcspi4ChCfg[2U];
MCSPILLD_InitObject gMcspiInitObject[MCSPI_NUM_INSTANCES];
MCSPI_ChConfig *gConfigMcspiChCfg;

// MCSPI_ChConfig gConfigMcspi1ChCfg[1U] =
// {
//     {
//         .chNum              = MCSPI_CHANNEL_0,
//         .frameFormat        = MCSPI_FF_POL0_PHA0,
//         .bitRate            = 1000000,
//         .csPolarity         = MCSPI_CS_POL_LOW,
//         .trMode             = MCSPI_TR_MODE_TX_RX,
//         .inputSelect        = MCSPI_IS_D0,
//         .dpe0               = MCSPI_DPE_ENABLE,
//         .dpe1               = MCSPI_DPE_DISABLE,
//         .slvCsSelect        = MCSPI_SLV_CS_SELECT_0,
//         .startBitEnable     = FALSE,
//         .startBitPolarity   = MCSPI_SB_POL_LOW,
//         .turboEnable        = FALSE,
//         .csIdleTime         = MCSPI_TCS0_0_CLK,
//         .defaultTxData      = 0x0U,
//         .txFifoTrigLvl      = 16U,
//         .rxFifoTrigLvl      = 16U,
//     },
// };

// MCSPILLD_InitObject gMcspiInitObject[1U] =
// {
//     {
//         .inputClkFreq                = 50000000,
//         .intrNum                     = CSLR_R5FSS0_CORE0_INTR_MCSPI1_INTR,
//         .operMode                    = MCSPI_OPER_MODE_POLLED,
//         .intrPriority                = 4U,
//         .chMode                      = MCSPI_CH_MODE_SINGLE,
//         .pinMode                     = MCSPI_PINMODE_4PIN,
//         .initDelay                   = MCSPI_INITDLY_0,
//         .multiWordAccess             = FALSE,
//         .msMode                      = MCSPI_MS_MODE_CONTROLLER,
//         .chEnabled                   = {TRUE, FALSE, FALSE, FALSE},
//         .mcspiDmaHandle              = NULL,
//         .chObj[0].chCfg              = &gConfigMcspi1ChCfg[0],
//         .chObj[0].dmaChCfg           = NULL,
//         .chObj[0].dmaChConfigNum     = 0,
//         .clockP_get                  = ClockP_getTicks,
//         .transferCallbackFxn         = NULL,
//         .errorCallbackFxn            = NULL,
//     },
// };
void MCSPI_channel_init(void)
{
    for(uint8_t i=0; i<MCSPI_NUM_INSTANCES; i++)
    {
        for(uint8_t j = 0; j<MCSPI_CHANNEL_NUM; j++)
        {
            if((i == 0) && (j == 0) && (MW_MCSPI0_ENABLE_CH0_SEL == TRUE))
            {
                gConfigMcspi0ChCfg[j].chNum =  MCSPI_CHANNEL_0;
                gConfigMcspi0ChCfg[j].frameFormat = MW_MCSPI0_CH0_FRAME_FORMAT_SEL;
                gConfigMcspi0ChCfg[j].bitRate = MW_MCSPI0_CH0_CLK_FREQ_SEL;
                if(MW_MCSPI0_CH0_CHIP_SELECT_POLARITY_SEL == 0)
                gConfigMcspi0ChCfg[j].csPolarity = MCSPI_CS_POL_LOW;
                else if(MW_MCSPI0_CH0_CHIP_SELECT_POLARITY_SEL == 1)
                    gConfigMcspi0ChCfg[j].csPolarity = MCSPI_CS_POL_HIGH;
                if(MW_MCSPI0_TR_MODE_SEL == 0)
                    gConfigMcspi0ChCfg[j].trMode = MCSPI_TR_MODE_TX_RX;
                else if(MW_MCSPI0_TR_MODE_SEL == 1)
                    gConfigMcspi0ChCfg[j].trMode = MCSPI_TR_MODE_TX_ONLY;
                else if(MW_MCSPI0_TR_MODE_SEL == 2)
                    gConfigMcspi0ChCfg[j].trMode = MCSPI_TR_MODE_RX_ONLY;
                if(MW_MCSPI0_INPUT_SELECT_SEL == 0)
                    gConfigMcspi0ChCfg[j].inputSelect = MCSPI_IS_D0;
                else if(MW_MCSPI0_INPUT_SELECT_SEL == 1)
                    gConfigMcspi0ChCfg[j].inputSelect = MCSPI_IS_D1;
                if(MW_MCSPI0_ENABLE_D0TX_SEL == 0)
                    gConfigMcspi0ChCfg[j].dpe0 =  MCSPI_DPE_DISABLE;
                else if(MW_MCSPI0_ENABLE_D0TX_SEL == 1)
                    gConfigMcspi0ChCfg[j].dpe0 =  MCSPI_DPE_ENABLE;   
                if(MW_MCSPI0_ENABLE_D1TX_SEL == 0)
                gConfigMcspi0ChCfg[j].dpe1 =  MCSPI_DPE_DISABLE;
                else if(MW_MCSPI0_ENABLE_D1TX_SEL == 1)
                    gConfigMcspi0ChCfg[j].dpe1 =  MCSPI_DPE_ENABLE;   
                if(MW_MCSPI0_TR_MODE_SEL == 0)
                {
                    gConfigMcspi0ChCfg[j].txFifoTrigLvl = MW_MCSPI0_FIFO_TRIGLVLTX_SEL;
                    gConfigMcspi0ChCfg[j].rxFifoTrigLvl = MW_MCSPI0_FIFO_TRIGLVLRX_SEL;   
                }
                else if(MW_MCSPI0_TR_MODE_SEL == 1)
                {
                    gConfigMcspi0ChCfg[j].txFifoTrigLvl = MW_MCSPI0_FIFO_TRIGLVLTX_SEL;    
                }
                else if(MW_MCSPI0_TR_MODE_SEL == 1)
                {
                gConfigMcspi0ChCfg[j].rxFifoTrigLvl = MW_MCSPI0_FIFO_TRIGLVLRX_SEL; 
                }
                gConfigMcspi0ChCfg[j].slvCsSelect = MCSPI_SLV_CS_SELECT_0;
                gConfigMcspi0ChCfg[j].startBitEnable = MW_MCSPI0_CH0_ENABLE_START_BIT_SEL;
                if(MW_MCSPI0_CH0_START_BIT_POLARITY_SEL == 0)
                    gConfigMcspi0ChCfg[j].startBitPolarity = MCSPI_SB_POL_LOW;
                else if(MW_MCSPI0_CH0_START_BIT_POLARITY_SEL == 1)  
                    gConfigMcspi0ChCfg[j].startBitPolarity = MCSPI_SB_POL_HIGH; 
                gConfigMcspi0ChCfg[j].turboEnable = MW_MCSPI0_CH0_ENABLE_TURBO_MODE_SEL;
                gConfigMcspi0ChCfg[j].csIdleTime = MCSPI_TCS0_0_CLK;
                gConfigMcspi0ChCfg[j].defaultTxData = (uint32_t)(MW_MCSPI0_CH0_DEFAULT_TX_DATA_SEL);

                

