TexasInstruments/am26x-hsp/src/am263x_init.c
            }
            else if((i == 1) && (j == 1) && (MW_MCSPI1_ENABLE_CH1_SEL == TRUE))
            {

                gConfigMcspi1ChCfg[j].chNum =  MCSPI_CHANNEL_1;
                gConfigMcspi1ChCfg[j].frameFormat = MW_MCSPI1_CH1_FRAME_FORMAT_SEL;
                gConfigMcspi1ChCfg[j].bitRate = MW_MCSPI1_CH1_CLK_FREQ_SEL;
                if(MW_MCSPI1_CH1_CHIP_SELECT_POLARITY_SEL == 0)
                gConfigMcspi1ChCfg[j].csPolarity = MCSPI_CS_POL_LOW;
                else if(MW_MCSPI1_CH1_CHIP_SELECT_POLARITY_SEL == 1)
                    gConfigMcspi1ChCfg[j].csPolarity = MCSPI_CS_POL_HIGH;
                if(MW_MCSPI1_TR_MODE_SEL == 0)
                    gConfigMcspi1ChCfg[j].trMode = MCSPI_TR_MODE_TX_RX;
                else if(MW_MCSPI1_TR_MODE_SEL == 1)
                    gConfigMcspi1ChCfg[j].trMode = MCSPI_TR_MODE_TX_ONLY;
                else if(MW_MCSPI1_TR_MODE_SEL == 2)
                    gConfigMcspi1ChCfg[j].trMode = MCSPI_TR_MODE_RX_ONLY;
                if(MW_MCSPI1_INPUT_SELECT_SEL == 0)
                gConfigMcspi1ChCfg[j].inputSelect = MCSPI_IS_D0;
                else if(MW_MCSPI1_INPUT_SELECT_SEL == 1)
                    gConfigMcspi1ChCfg[j].inputSelect = MCSPI_IS_D1;
                if(MW_MCSPI1_ENABLE_D0TX_SEL == 0)
                    gConfigMcspi1ChCfg[j].dpe0 =  MCSPI_DPE_DISABLE;
                else if(MW_MCSPI1_ENABLE_D0TX_SEL == 1)
                gConfigMcspi1ChCfg[j].dpe0 =  MCSPI_DPE_ENABLE;   
                if(MW_MCSPI1_ENABLE_D1TX_SEL == 0)
                gConfigMcspi1ChCfg[j].dpe1 =  MCSPI_DPE_DISABLE;
                else if(MW_MCSPI1_ENABLE_D1TX_SEL == 1)
                    gConfigMcspi1ChCfg[j].dpe1 =  MCSPI_DPE_ENABLE;   
                if(MW_MCSPI1_TR_MODE_SEL == 0)
                {
                    gConfigMcspi1ChCfg[j].txFifoTrigLvl = MW_MCSPI1_FIFO_TRIGLVLTX_SEL;
                    gConfigMcspi1ChCfg[j].rxFifoTrigLvl = MW_MCSPI1_FIFO_TRIGLVLRX_SEL;   
                }
                else if(MW_MCSPI1_TR_MODE_SEL == 1)
                {
                    gConfigMcspi1ChCfg[j].txFifoTrigLvl = MW_MCSPI1_FIFO_TRIGLVLTX_SEL;    
                }
                else if(MW_MCSPI1_TR_MODE_SEL == 1)
                {
                gConfigMcspi1ChCfg[j].rxFifoTrigLvl = MW_MCSPI1_FIFO_TRIGLVLRX_SEL; 
                }
                gConfigMcspi1ChCfg[j].slvCsSelect = MCSPI_SLV_CS_SELECT_0;
                gConfigMcspi1ChCfg[j].startBitEnable = MW_MCSPI1_CH1_ENABLE_START_BIT_SEL;
                if(MW_MCSPI1_CH1_START_BIT_POLARITY_SEL == 0)
                    gConfigMcspi1ChCfg[j].startBitPolarity = MCSPI_SB_POL_LOW;
                else if(MW_MCSPI1_CH1_START_BIT_POLARITY_SEL == 1)  
                    gConfigMcspi1ChCfg[j].startBitPolarity = MCSPI_SB_POL_HIGH; 
                gConfigMcspi1ChCfg[j].turboEnable = MW_MCSPI1_CH1_ENABLE_TURBO_MODE_SEL;
                gConfigMcspi1ChCfg[j].csIdleTime = MCSPI_TCS0_0_CLK;
                gConfigMcspi1ChCfg[j].defaultTxData = (uint32_t)(MW_MCSPI1_CH1_DEFAULT_TX_DATA_SEL);

            }
            else if((i == 2) && (j == 0) && (MW_MCSPI2_ENABLE_CH0_SEL == TRUE))
            {
                gConfigMcspi2ChCfg[j].chNum =  MCSPI_CHANNEL_0;
                gConfigMcspi2ChCfg[j].frameFormat = MW_MCSPI2_CH0_FRAME_FORMAT_SEL;
                gConfigMcspi2ChCfg[j].bitRate = MW_MCSPI2_CH0_CLK_FREQ_SEL;
                if(MW_MCSPI2_CH0_CHIP_SELECT_POLARITY_SEL == 0)
                gConfigMcspi2ChCfg[j].csPolarity = MCSPI_CS_POL_LOW;
                else if(MW_MCSPI2_CH0_CHIP_SELECT_POLARITY_SEL == 1)
                    gConfigMcspi2ChCfg[j].csPolarity = MCSPI_CS_POL_HIGH;
                if(MW_MCSPI2_TR_MODE_SEL == 0)
                    gConfigMcspi2ChCfg[j].trMode = MCSPI_TR_MODE_TX_RX;
                else if(MW_MCSPI2_TR_MODE_SEL == 1)
                    gConfigMcspi2ChCfg[j].trMode = MCSPI_TR_MODE_TX_ONLY;
                else if(MW_MCSPI2_TR_MODE_SEL == 2)
                    gConfigMcspi2ChCfg[j].trMode = MCSPI_TR_MODE_RX_ONLY;
                if(MW_MCSPI2_INPUT_SELECT_SEL == 0)
                gConfigMcspi2ChCfg[j].inputSelect = MCSPI_IS_D0;
                else if(MW_MCSPI2_INPUT_SELECT_SEL == 1)
                    gConfigMcspi2ChCfg[j].inputSelect = MCSPI_IS_D1;
                if(MW_MCSPI2_ENABLE_D0TX_SEL == 0)
                    gConfigMcspi2ChCfg[j].dpe0 =  MCSPI_DPE_DISABLE;
                else if(MW_MCSPI2_ENABLE_D0TX_SEL == 1)
                gConfigMcspi2ChCfg[j].dpe0 =  MCSPI_DPE_ENABLE;   
                if(MW_MCSPI2_ENABLE_D1TX_SEL == 0)
                gConfigMcspi2ChCfg[j].dpe1 =  MCSPI_DPE_DISABLE;
                else if(MW_MCSPI2_ENABLE_D1TX_SEL == 1)
                    gConfigMcspi2ChCfg[j].dpe1 =  MCSPI_DPE_ENABLE;   
                if(MW_MCSPI2_TR_MODE_SEL == 0)
                {
                    gConfigMcspi2ChCfg[j].txFifoTrigLvl = MW_MCSPI2_FIFO_TRIGLVLTX_SEL;
                    gConfigMcspi2ChCfg[j].rxFifoTrigLvl = MW_MCSPI2_FIFO_TRIGLVLRX_SEL;   
                }
                else if(MW_MCSPI2_TR_MODE_SEL == 1)
                {
                    gConfigMcspi2ChCfg[j].txFifoTrigLvl = MW_MCSPI2_FIFO_TRIGLVLTX_SEL;    
                }
                else if(MW_MCSPI2_TR_MODE_SEL == 1)
                {
                gConfigMcspi2ChCfg[j].rxFifoTrigLvl = MW_MCSPI2_FIFO_TRIGLVLRX_SEL; 
                }
                gConfigMcspi2ChCfg[j].slvCsSelect = MCSPI_SLV_CS_SELECT_0;
                gConfigMcspi2ChCfg[j].startBitEnable = MW_MCSPI2_CH0_ENABLE_START_BIT_SEL;
                if(MW_MCSPI2_CH0_START_BIT_POLARITY_SEL == 0)
                    gConfigMcspi2ChCfg[j].startBitPolarity = MCSPI_SB_POL_LOW;
                else if(MW_MCSPI2_CH0_START_BIT_POLARITY_SEL == 1)  
                    gConfigMcspi2ChCfg[j].startBitPolarity = MCSPI_SB_POL_HIGH; 
                gConfigMcspi2ChCfg[j].turboEnable = MW_MCSPI2_CH0_ENABLE_TURBO_MODE_SEL;
                gConfigMcspi2ChCfg[j].csIdleTime = MCSPI_TCS0_0_CLK;
                gConfigMcspi2ChCfg[j].defaultTxData = (uint32_t)(MW_MCSPI2_CH0_DEFAULT_TX_DATA_SEL);

