TexasInstruments/am26x-hsp/src/am263x_init.c
            }
            else if((i == 4) && (j == 1) && (MW_MCSPI4_ENABLE_CH1_SEL == TRUE))
            {

                gConfigMcspi4ChCfg[j].chNum =  MCSPI_CHANNEL_1;
                gConfigMcspi4ChCfg[j].frameFormat = MW_MCSPI4_CH1_FRAME_FORMAT_SEL;
                gConfigMcspi4ChCfg[j].bitRate = MW_MCSPI4_CH1_CLK_FREQ_SEL;
                if(MW_MCSPI4_CH1_CHIP_SELECT_POLARITY_SEL == 0)
                gConfigMcspi4ChCfg[j].csPolarity = MCSPI_CS_POL_LOW;
                else if(MW_MCSPI4_CH1_CHIP_SELECT_POLARITY_SEL == 1)
                    gConfigMcspi4ChCfg[j].csPolarity = MCSPI_CS_POL_HIGH;
                if(MW_MCSPI4_TR_MODE_SEL == 0)
                    gConfigMcspi4ChCfg[j].trMode = MCSPI_TR_MODE_TX_RX;
                else if(MW_MCSPI4_TR_MODE_SEL == 1)
                    gConfigMcspi4ChCfg[j].trMode = MCSPI_TR_MODE_TX_ONLY;
                else if(MW_MCSPI4_TR_MODE_SEL == 2)
                    gConfigMcspi4ChCfg[j].trMode = MCSPI_TR_MODE_RX_ONLY;
                if(MW_MCSPI4_INPUT_SELECT_SEL == 0)
                gConfigMcspi4ChCfg[j].inputSelect = MCSPI_IS_D0;
                else if(MW_MCSPI4_INPUT_SELECT_SEL == 1)
                    gConfigMcspi4ChCfg[j].inputSelect = MCSPI_IS_D1;
                if(MW_MCSPI4_ENABLE_D0TX_SEL == 0)
                    gConfigMcspi4ChCfg[j].dpe0 =  MCSPI_DPE_DISABLE;
                else if(MW_MCSPI4_ENABLE_D0TX_SEL == 1)
                gConfigMcspi4ChCfg[j].dpe0 =  MCSPI_DPE_ENABLE;   
                if(MW_MCSPI4_ENABLE_D1TX_SEL == 0)
                gConfigMcspi4ChCfg[j].dpe1 =  MCSPI_DPE_DISABLE;
                else if(MW_MCSPI4_ENABLE_D1TX_SEL == 1)
                    gConfigMcspi4ChCfg[j].dpe1 =  MCSPI_DPE_ENABLE;   
                if(MW_MCSPI4_TR_MODE_SEL == 0)
                {
                    gConfigMcspi4ChCfg[j].txFifoTrigLvl = MW_MCSPI4_FIFO_TRIGLVLTX_SEL;
                    gConfigMcspi4ChCfg[j].rxFifoTrigLvl = MW_MCSPI4_FIFO_TRIGLVLRX_SEL;   
                }
                else if(MW_MCSPI4_TR_MODE_SEL == 1)
                {
                    gConfigMcspi4ChCfg[j].txFifoTrigLvl = MW_MCSPI4_FIFO_TRIGLVLTX_SEL;    
                }
                else if(MW_MCSPI4_TR_MODE_SEL == 1)
                {
                gConfigMcspi4ChCfg[j].rxFifoTrigLvl = MW_MCSPI4_FIFO_TRIGLVLRX_SEL; 
                }
                gConfigMcspi4ChCfg[j].slvCsSelect = MCSPI_SLV_CS_SELECT_0;
                gConfigMcspi4ChCfg[j].startBitEnable = MW_MCSPI4_CH1_ENABLE_START_BIT_SEL;
                if(MW_MCSPI4_CH1_START_BIT_POLARITY_SEL == 0)
                    gConfigMcspi4ChCfg[j].startBitPolarity = MCSPI_SB_POL_LOW;
                else if(MW_MCSPI4_CH1_START_BIT_POLARITY_SEL == 1)  
                    gConfigMcspi4ChCfg[j].startBitPolarity = MCSPI_SB_POL_HIGH; 
                gConfigMcspi4ChCfg[j].turboEnable = MW_MCSPI4_CH1_ENABLE_TURBO_MODE_SEL;
                gConfigMcspi4ChCfg[j].csIdleTime = MCSPI_TCS0_0_CLK;
                gConfigMcspi4ChCfg[j].defaultTxData = (uint32_t)(MW_MCSPI4_CH1_DEFAULT_TX_DATA_SEL);

            }



        }
    }
}

void MCSPI_object_init(void)
{
    bool channel0_enable = false;
    bool channel1_enable = false;

    for(uint8_t i = 0; i< MCSPI_NUM_INSTANCES; i++)
    {
        channel0_enable = false;
        channel1_enable = false;

        gMcspiInitObject[i].inputClkFreq = 50000000;
        gMcspiInitObject[i].operMode  = MCSPI_OPER_MODE_POLLED;
        gMcspiInitObject[i].intrPriority = 4U;
        gMcspiInitObject[i].mcspiDmaHandle = NULL;
        gMcspiInitObject[i].clockP_get = ClockP_getTicks;
        gMcspiInitObject[i].transferCallbackFxn = NULL;
        gMcspiInitObject[i].errorCallbackFxn = NULL;
        if(i==0)
        {
            gMcspiInitObject[i].intrNum = CSLR_R5FSS0_CORE0_INTR_MCSPI0_INTR;
            if((MW_MCSPI0_MODE_OPERATION_SEL == 0) | (MW_MCSPI0_MODE_OPERATION_SEL == 2))
                gMcspiInitObject[i].chMode = MCSPI_CH_MODE_SINGLE;
            else if(MW_MCSPI0_MODE_OPERATION_SEL == 1)  
                gMcspiInitObject[i].chMode = MCSPI_CH_MODE_MULTI;
            if(MW_MCSPI0_PIN_MODE_SEL == 0)
                gMcspiInitObject[i].pinMode = MCSPI_PINMODE_3PIN;
            else if(MW_MCSPI0_PIN_MODE_SEL == 1)
                gMcspiInitObject[i].pinMode = MCSPI_PINMODE_4PIN; 
            if(MW_MCSPI0_INIT_DELAY_SEL == 0)
                gMcspiInitObject[i].initDelay = MCSPI_INITDLY_0;
            else if(MW_MCSPI0_INIT_DELAY_SEL == 1)
                gMcspiInitObject[i].initDelay = MCSPI_INITDLY_4;
            else if(MW_MCSPI0_INIT_DELAY_SEL == 2)
                gMcspiInitObject[i].initDelay = MCSPI_INITDLY_8;
            else if(MW_MCSPI0_INIT_DELAY_SEL == 3)
                gMcspiInitObject[i].initDelay = MCSPI_INITDLY_16;
            else if(MW_MCSPI0_INIT_DELAY_SEL == 4)
                gMcspiInitObject[i].initDelay = MCSPI_INITDLY_32;
            gMcspiInitObject[i].multiWordAccess = MW_MCSPI0_ENABLE_MULTIWORD_ACCESS_SEL;
            if((MW_MCSPI0_MODE_OPERATION_SEL == 0) | (MW_MCSPI0_MODE_OPERATION_SEL == 1))
                gMcspiInitObject[i].msMode = MCSPI_MS_MODE_CONTROLLER;
            else if(MW_MCSPI0_MODE_OPERATION_SEL == 2)
                gMcspiInitObject[i].msMode = MCSPI_MS_MODE_PERIPHERAL;
            if(MW_MCSPI0_ENABLE_CH0_SEL == TRUE)
                channel0_enable = true;
            if(MW_MCSPI0_ENABLE_CH1_SEL == 1)
            {
                channel1_enable = true;
                gMcspiInitObject[i].chObj[1].chCfg = &gConfigMcspi0ChCfg[0];
                gMcspiInitObject[i].chObj[1].dmaChCfg = NULL;
                gMcspiInitObject[i].chObj[1].dmaChConfigNum = 0;
                gMcspiInitObject[i].chObj[0].chCfg = &gConfigMcspi0ChCfg[1];
                gMcspiInitObject[i].chObj[0].dmaChCfg = NULL;
                gMcspiInitObject[i].chObj[0].dmaChConfigNum = 0;
            }
            else
            {
                channel1_enable = false;
                gMcspiInitObject[i].chObj[0].chCfg = &gConfigMcspi0ChCfg[0];
                gMcspiInitObject[i].chObj[0].dmaChCfg = NULL;
                gMcspiInitObject[i].chObj[0].dmaChConfigNum = 0;

