TexasInstruments/am26x-hsp/src/am263x_init.c
            }
            gMcspiInitObject[i].chEnabled[0] = channel0_enable; 
            gMcspiInitObject[i].chEnabled[1] = channel1_enable;
            gMcspiInitObject[i].chEnabled[2] = false;
            gMcspiInitObject[i].chEnabled[3] = false;
        }
        else if(i==4)
        {

            gMcspiInitObject[i].intrNum = CSLR_R5FSS0_CORE0_INTR_MCSPI4_INTR;
            if((MW_MCSPI4_MODE_OPERATION_SEL == 0) | (MW_MCSPI4_MODE_OPERATION_SEL == 2))
                gMcspiInitObject[i].chMode = MCSPI_CH_MODE_SINGLE;
            else if(MW_MCSPI4_MODE_OPERATION_SEL == 1)  
                gMcspiInitObject[i].chMode = MCSPI_CH_MODE_MULTI;
            if(MW_MCSPI4_PIN_MODE_SEL == 0)
                gMcspiInitObject[i].pinMode = MCSPI_PINMODE_3PIN;
            else if(MW_MCSPI4_PIN_MODE_SEL == 1)
                gMcspiInitObject[i].pinMode = MCSPI_PINMODE_4PIN; 
            if(MW_MCSPI4_INIT_DELAY_SEL == 0)
                gMcspiInitObject[i].initDelay = MCSPI_INITDLY_0;
            else if(MW_MCSPI4_INIT_DELAY_SEL == 1)
                gMcspiInitObject[i].initDelay = MCSPI_INITDLY_4;
            else if(MW_MCSPI4_INIT_DELAY_SEL == 2)
                gMcspiInitObject[i].initDelay = MCSPI_INITDLY_8;
            else if(MW_MCSPI4_INIT_DELAY_SEL == 3)
                gMcspiInitObject[i].initDelay = MCSPI_INITDLY_16;
            else if(MW_MCSPI4_INIT_DELAY_SEL == 4)
                gMcspiInitObject[i].initDelay = MCSPI_INITDLY_32;
            gMcspiInitObject[i].multiWordAccess = MW_MCSPI4_ENABLE_MULTIWORD_ACCESS_SEL;
            if((MW_MCSPI4_MODE_OPERATION_SEL == 0) | (MW_MCSPI4_MODE_OPERATION_SEL == 1))
                gMcspiInitObject[i].msMode = MCSPI_MS_MODE_CONTROLLER;
            else if(MW_MCSPI4_MODE_OPERATION_SEL == 2)
                gMcspiInitObject[i].msMode = MCSPI_MS_MODE_PERIPHERAL;
            if(MW_MCSPI4_ENABLE_CH0_SEL == TRUE)
                channel0_enable = true;
            if(MW_MCSPI4_ENABLE_CH1_SEL == 1)
            {
                channel1_enable = true;
                gMcspiInitObject[i].chObj[1].chCfg = &gConfigMcspi4ChCfg[0];
                gMcspiInitObject[i].chObj[1].dmaChCfg = NULL;
                gMcspiInitObject[i].chObj[1].dmaChConfigNum = 0;
                gMcspiInitObject[i].chObj[0].chCfg = &gConfigMcspi4ChCfg[1];
                gMcspiInitObject[i].chObj[0].dmaChCfg = NULL;
                gMcspiInitObject[i].chObj[0].dmaChConfigNum = 0;
            }
            else
            {
                channel1_enable = false;
                gMcspiInitObject[i].chObj[0].chCfg = &gConfigMcspi4ChCfg[0];
                gMcspiInitObject[i].chObj[0].dmaChCfg = NULL;
                gMcspiInitObject[i].chObj[0].dmaChConfigNum = 0;

            } 

            gMcspiInitObject[i].chEnabled[0] = channel0_enable; 
            gMcspiInitObject[i].chEnabled[1] = channel1_enable;
            gMcspiInitObject[i].chEnabled[2] = false;
            gMcspiInitObject[i].chEnabled[3] = false;

        }
    }
}

MCSPILLD_Object gMcspiObject[MCSPI_NUM_INSTANCES];
MCSPILLD_Handle gMcspiHandle[MCSPI_NUM_INSTANCES];

void Drivers_mcspiOpen()
{
    uint8_t i = 0;
    int32_t status = MCSPI_STATUS_SUCCESS;
    for(i=0; i<MCSPI_NUM_INSTANCES; i++)
    {
        gMcspiHandle[i] = &gMcspiObject[i];
        gMcspiHandle[i]->state = MCSPI_STATE_RESET;
        if(i==0)
            gMcspiHandle[i]->baseAddr = CSL_MCSPI0_U_BASE;
        else if(i==1)
            gMcspiHandle[i]->baseAddr = CSL_MCSPI1_U_BASE;
        else if(i==2)
            gMcspiHandle[i]->baseAddr = CSL_MCSPI2_U_BASE;
        else if(i==3)
            gMcspiHandle[i]->baseAddr = CSL_MCSPI3_U_BASE;
        gMcspiHandle[i]->hMcspiInit = &gMcspiInitObject[i];

        if((i==0) && (MW_ENABLE_MCSPI0_SEL == 1))
            status = MCSPI_lld_init(gMcspiHandle[0]);
        else if((i==1) && (MW_ENABLE_MCSPI1_SEL == 1))
            status = MCSPI_lld_init(gMcspiHandle[1]);
        else if((i==2) && (MW_ENABLE_MCSPI2_SEL == 1))
            status = MCSPI_lld_init(gMcspiHandle[2]);
        else if((i==3) && (MW_ENABLE_MCSPI3_SEL == 1))
            status = MCSPI_lld_init(gMcspiHandle[3]);
        else if((i==4) && (MW_ENABLE_MCSPI4_SEL == 1))
            status = MCSPI_lld_init(gMcspiHandle[4]);

        DebugP_assert(status == MCSPI_STATUS_SUCCESS);   
    }

    return;
}

#define MSS_MBOX_MEM                (CSL_MBOX_SRAM_U_BASE)
#define MSS_MBOX_MEM_SIZE           (16U*1024U)

/*
* SW queue between each pair of CPUs
*
* place SW queues at the bottom of the dedicated mailbox memories.
* Driver assume this memory is init to zero in bootloader as it's ECC protected and
* needs to be intialized only once and to ensure that only one core has done the
* mailbox ram initialization before ipc_init. If SBL is not used then Gel does the initialization.
* We need 4*3 SW Q's for the 4x R5F to send messages to each other, i.e 384 B.
*
* Rest of the mailbox memory cna be used for ipc_rpmessage or custom message passing.
*/
#define R5FSS0_0_TO_R5FSS0_1_SW_QUEUE      (IpcNotify_SwQueue*)((MSS_MBOX_MEM + MSS_MBOX_MEM_SIZE) - (MAILBOX_MAX_SW_QUEUE_SIZE*12U))
#define R5FSS0_0_TO_R5FSS1_0_SW_QUEUE      (IpcNotify_SwQueue*)((MSS_MBOX_MEM + MSS_MBOX_MEM_SIZE) - (MAILBOX_MAX_SW_QUEUE_SIZE*11U))
#define R5FSS0_0_TO_R5FSS1_1_SW_QUEUE      (IpcNotify_SwQueue*)((MSS_MBOX_MEM + MSS_MBOX_MEM_SIZE) - (MAILBOX_MAX_SW_QUEUE_SIZE*10U))
#define R5FSS0_1_TO_R5FSS0_0_SW_QUEUE      (IpcNotify_SwQueue*)((MSS_MBOX_MEM + MSS_MBOX_MEM_SIZE) - (MAILBOX_MAX_SW_QUEUE_SIZE*9U))
#define R5FSS0_1_TO_R5FSS1_0_SW_QUEUE      (IpcNotify_SwQueue*)((MSS_MBOX_MEM + MSS_MBOX_MEM_SIZE) - (MAILBOX_MAX_SW_QUEUE_SIZE*8U))
#define R5FSS0_1_TO_R5FSS1_1_SW_QUEUE      (IpcNotify_SwQueue*)((MSS_MBOX_MEM + MSS_MBOX_MEM_SIZE) - (MAILBOX_MAX_SW_QUEUE_SIZE*7U))
#define R5FSS1_0_TO_R5FSS0_0_SW_QUEUE      (IpcNotify_SwQueue*)((MSS_MBOX_MEM + MSS_MBOX_MEM_SIZE) - (MAILBOX_MAX_SW_QUEUE_SIZE*6U))
#define R5FSS1_0_TO_R5FSS0_1_SW_QUEUE      (IpcNotify_SwQueue*)((MSS_MBOX_MEM + MSS_MBOX_MEM_SIZE) - (MAILBOX_MAX_SW_QUEUE_SIZE*5U))
#define R5FSS1_0_TO_R5FSS1_1_SW_QUEUE      (IpcNotify_SwQueue*)((MSS_MBOX_MEM + MSS_MBOX_MEM_SIZE) - (MAILBOX_MAX_SW_QUEUE_SIZE*4U))
#define R5FSS1_1_TO_R5FSS0_0_SW_QUEUE      (IpcNotify_SwQueue*)((MSS_MBOX_MEM + MSS_MBOX_MEM_SIZE) - (MAILBOX_MAX_SW_QUEUE_SIZE*3U))
#define R5FSS1_1_TO_R5FSS0_1_SW_QUEUE      (IpcNotify_SwQueue*)((MSS_MBOX_MEM + MSS_MBOX_MEM_SIZE) - (MAILBOX_MAX_SW_QUEUE_SIZE*2U))
#define R5FSS1_1_TO_R5FSS1_0_SW_QUEUE      (IpcNotify_SwQueue*)((MSS_MBOX_MEM + MSS_MBOX_MEM_SIZE) - (MAILBOX_MAX_SW_QUEUE_SIZE*1U))

#define MSS_MBOX_MEM                (CSL_MBOX_SRAM_U_BASE)
#define MSS_MBOX_MEM_SIZE           (16U*1024U)

#include <drivers/ipc_rpmsg.h>


