TexasInstruments/am26x-hsp/src/am263x_init.c
uint16_t IPC_Shared_Mem_SizeMemorySize = 0U;
uint16_t VringMemorySize = 0U;
uint16_t VringNumBuffers = 0U;
uint16_t VringBufferSize = 0U;
uint16_t TotalVringCount = 0U;


/* This function is called within IpcNotify_init, this function returns core specific IPC config */
void IpcNotify_getConfig(IpcNotify_InterruptConfig **interruptConfig, uint32_t *interruptConfigNum)
{
//     /* extern globals that are specific to this core */
    extern IpcNotify_InterruptConfig gIpcNotifyInterruptConfig_r5fss0_0[];
    extern uint32_t gIpcNotifyInterruptConfigNum_r5fss0_0;
    extern IpcNotify_InterruptConfig gIpcNotifyInterruptConfig_r5fss0_1[];
    extern uint32_t gIpcNotifyInterruptConfigNum_r5fss0_1;
    extern IpcNotify_InterruptConfig gIpcNotifyInterruptConfig_r5fss1_0[];
    extern uint32_t gIpcNotifyInterruptConfigNum_r5fss1_0;
    extern IpcNotify_InterruptConfig gIpcNotifyInterruptConfig_r5fss1_1[];
    extern uint32_t gIpcNotifyInterruptConfigNum_r5fss1_1;

    if(MW_CPUINFO_CORESELECTION == 0)
    {
        *interruptConfig = &gIpcNotifyInterruptConfig_r5fss0_0[0];
        *interruptConfigNum = gIpcNotifyInterruptConfigNum_r5fss0_0;
    }
    else if(MW_CPUINFO_CORESELECTION == 1)
    {
        *interruptConfig = &gIpcNotifyInterruptConfig_r5fss0_1[0];
        *interruptConfigNum = gIpcNotifyInterruptConfigNum_r5fss0_1;
    }
    else if(MW_CPUINFO_CORESELECTION == 2)
    {
        *interruptConfig = &gIpcNotifyInterruptConfig_r5fss1_0[0];
        *interruptConfigNum = gIpcNotifyInterruptConfigNum_r5fss1_0;
    }
    else if(MW_CPUINFO_CORESELECTION == 3)
    {
        *interruptConfig = &gIpcNotifyInterruptConfig_r5fss1_1[0];
        *interruptConfigNum = gIpcNotifyInterruptConfigNum_r5fss1_1;
    }
}

/* This function is called within IpcNotify_init, this function allocates SW queue */
void IpcNotify_allocSwQueue(IpcNotify_MailboxConfig *mailboxConfig)
{
    IpcNotify_MailboxConfig (*mailboxConfigPtr)[CSL_CORE_ID_MAX] = (void *)mailboxConfig;

    if(MW_CPUINFO_CORESELECTION == 0)
    {
        if(MW_R5FSS0CORE1_ENABLE_SEL == 1)
        {
            mailboxConfigPtr[CSL_CORE_ID_R5FSS0_0][CSL_CORE_ID_R5FSS0_1].swQ = R5FSS0_0_TO_R5FSS0_1_SW_QUEUE;   
            mailboxConfigPtr[CSL_CORE_ID_R5FSS0_1][CSL_CORE_ID_R5FSS0_0].swQ = R5FSS0_1_TO_R5FSS0_0_SW_QUEUE;
        }

        if(MW_R5FSS1CORE0_ENABLE_SEL == 1)
        {
            mailboxConfigPtr[CSL_CORE_ID_R5FSS0_0][CSL_CORE_ID_R5FSS1_0].swQ = R5FSS0_0_TO_R5FSS1_0_SW_QUEUE;
            mailboxConfigPtr[CSL_CORE_ID_R5FSS1_0][CSL_CORE_ID_R5FSS0_0].swQ = R5FSS1_0_TO_R5FSS0_0_SW_QUEUE;
        }

        if(MW_R5FSS1CORE1_ENABLE_SEL == 1)
        {
            mailboxConfigPtr[CSL_CORE_ID_R5FSS0_0][CSL_CORE_ID_R5FSS1_1].swQ = R5FSS0_0_TO_R5FSS1_1_SW_QUEUE;
            mailboxConfigPtr[CSL_CORE_ID_R5FSS1_1][CSL_CORE_ID_R5FSS0_0].swQ = R5FSS1_1_TO_R5FSS0_0_SW_QUEUE;
        }
    }
    else if(MW_CPUINFO_CORESELECTION == 1)
    {
        if(MW_R5FSS0CORE0_ENABLE_SEL == 1)
        {
            mailboxConfigPtr[CSL_CORE_ID_R5FSS0_1][CSL_CORE_ID_R5FSS0_0].swQ = R5FSS0_1_TO_R5FSS0_0_SW_QUEUE;
            mailboxConfigPtr[CSL_CORE_ID_R5FSS0_0][CSL_CORE_ID_R5FSS0_1].swQ = R5FSS0_0_TO_R5FSS0_1_SW_QUEUE;
        }

        if(MW_R5FSS1CORE0_ENABLE_SEL == 1)
        {
            mailboxConfigPtr[CSL_CORE_ID_R5FSS0_1][CSL_CORE_ID_R5FSS1_0].swQ = R5FSS0_1_TO_R5FSS1_0_SW_QUEUE;
            mailboxConfigPtr[CSL_CORE_ID_R5FSS1_0][CSL_CORE_ID_R5FSS0_1].swQ = R5FSS1_0_TO_R5FSS0_1_SW_QUEUE;
        }

        if(MW_R5FSS1CORE1_ENABLE_SEL == 1)
        {
            mailboxConfigPtr[CSL_CORE_ID_R5FSS0_1][CSL_CORE_ID_R5FSS1_1].swQ = R5FSS0_1_TO_R5FSS1_1_SW_QUEUE;
            mailboxConfigPtr[CSL_CORE_ID_R5FSS1_1][CSL_CORE_ID_R5FSS0_1].swQ = R5FSS1_1_TO_R5FSS0_1_SW_QUEUE; 
        }
    }
    else if(MW_CPUINFO_CORESELECTION == 2)
    {
        if(MW_R5FSS0CORE0_ENABLE_SEL == 1)
        {
            mailboxConfigPtr[CSL_CORE_ID_R5FSS1_0][CSL_CORE_ID_R5FSS0_0].swQ = R5FSS1_0_TO_R5FSS0_0_SW_QUEUE;
            mailboxConfigPtr[CSL_CORE_ID_R5FSS0_0][CSL_CORE_ID_R5FSS1_0].swQ = R5FSS0_0_TO_R5FSS1_0_SW_QUEUE;
        }

        if(MW_R5FSS0CORE1_ENABLE_SEL == 1)
        {
            mailboxConfigPtr[CSL_CORE_ID_R5FSS1_0][CSL_CORE_ID_R5FSS0_1].swQ = R5FSS1_0_TO_R5FSS0_1_SW_QUEUE;
            mailboxConfigPtr[CSL_CORE_ID_R5FSS0_1][CSL_CORE_ID_R5FSS1_0].swQ = R5FSS0_1_TO_R5FSS1_0_SW_QUEUE;
        }

        if(MW_R5FSS1CORE1_ENABLE_SEL == 1)
        {
            mailboxConfigPtr[CSL_CORE_ID_R5FSS1_0][CSL_CORE_ID_R5FSS1_1].swQ = R5FSS1_0_TO_R5FSS1_1_SW_QUEUE;
            mailboxConfigPtr[CSL_CORE_ID_R5FSS1_1][CSL_CORE_ID_R5FSS1_0].swQ = R5FSS1_1_TO_R5FSS1_0_SW_QUEUE;
        }   
    }
    else if(MW_CPUINFO_CORESELECTION == 3)
    {
        if(MW_R5FSS0CORE0_ENABLE_SEL == 1)
        {
            mailboxConfigPtr[CSL_CORE_ID_R5FSS1_1][CSL_CORE_ID_R5FSS0_0].swQ = R5FSS1_1_TO_R5FSS0_0_SW_QUEUE;
            mailboxConfigPtr[CSL_CORE_ID_R5FSS0_0][CSL_CORE_ID_R5FSS1_1].swQ = R5FSS0_0_TO_R5FSS1_1_SW_QUEUE;
        }

        if(MW_R5FSS0CORE1_ENABLE_SEL == 1)
        {
            mailboxConfigPtr[CSL_CORE_ID_R5FSS1_1][CSL_CORE_ID_R5FSS0_1].swQ = R5FSS1_1_TO_R5FSS0_1_SW_QUEUE;
            mailboxConfigPtr[CSL_CORE_ID_R5FSS0_1][CSL_CORE_ID_R5FSS1_1].swQ = R5FSS0_1_TO_R5FSS1_1_SW_QUEUE;
        }

        if(MW_R5FSS1CORE1_ENABLE_SEL == 1)
        {
            mailboxConfigPtr[CSL_CORE_ID_R5FSS1_1][CSL_CORE_ID_R5FSS1_0].swQ = R5FSS1_1_TO_R5FSS1_0_SW_QUEUE;
            mailboxConfigPtr[CSL_CORE_ID_R5FSS1_0][CSL_CORE_ID_R5FSS1_1].swQ = R5FSS1_0_TO_R5FSS1_1_SW_QUEUE;
        }
    }
}

uint16_t Core0_Tx_Core1_Rx_Core0 = 0U;
uint16_t Core0_Tx_Core2_Rx_Core0 = 0U;
uint16_t Core0_Tx_Core3_Rx_Core0 = 0U;
uint16_t Core1_Tx_Core0_Rx_Core1 = 0U;
uint16_t Core1_Tx_Core2_Rx_Core1 = 0U;
uint16_t Core1_Tx_Core3_Rx_Core1 = 0U;
uint16_t Core2_Tx_Core0_Rx_Core2 = 0U;
uint16_t Core2_Tx_Core1_Rx_Core2 = 0U;
uint16_t Core2_Tx_Core3_Rx_Core2 = 0U;
uint16_t Core3_Tx_Core0_Rx_Core3 = 0U;
uint16_t Core3_Tx_Core1_Rx_Core3 = 0U;
uint16_t Core3_Tx_Core2_Rx_Core3 = 0U;

#define IPC_RPMESSAGE_VRING_SIZE          RPMESSAGE_VRING_SIZE(MW_RP_NUM_BUFFERS_SEL, MW_RP_BUFFER_SIZE_SEL)
#define IPC_SHARED_MEM_SIZE               (IPC_RPMESSAGE_VRING_SIZE * (uint16_t)((MW_NUM_REMOTE_CORES_SEL+1)*(MW_NUM_REMOTE_CORES_SEL)))

