TexasInstruments/am26x-hsp/src/am263x_init.c
uint8_t gIpcSharedMem[IPC_SHARED_MEM_SIZE] __attribute__((aligned(128), section(".bss.ipc_vring_mem")));

uint16_t IPCCores = 0U;

void RPMemory_init()
{

    uint16_t offSetTx = 0U;
    uint16_t offSetRx = 0U;

    uint16_t VringSize = RPMESSAGE_VRING_SIZE(MW_RP_NUM_BUFFERS_SEL, MW_RP_BUFFER_SIZE_SEL);

    
    if(((MW_CPUINFO_CORESELECTION == 0) && (MW_R5FSS0CORE0_ENABLE_SELFCORE_SEL == 1)))
    {
        if((MW_R5FSS0CORE0_ENABLE_SELFCORE_SEL == 1) && (MW_R5FSS0CORE1_ENABLE_SEL == 1))
        {
            Core0_Tx_Core1_Rx_Core0 = offSetTx;
            offSetTx += VringSize;
        }

        if((MW_R5FSS0CORE0_ENABLE_SELFCORE_SEL == 1) && (MW_R5FSS1CORE0_ENABLE_SEL == 1))
        {
            Core0_Tx_Core2_Rx_Core0 = offSetTx;
            offSetTx += VringSize;
        }

        if((MW_R5FSS0CORE0_ENABLE_SELFCORE_SEL == 1) && (MW_R5FSS1CORE1_ENABLE_SEL == 1))
        {
            Core0_Tx_Core3_Rx_Core0 = offSetTx;
            // offSetTx += VringSize;
        }

    }
    else if((MW_CPUINFO_CORESELECTION == 1) && (MW_R5FSS0CORE1_ENABLE_SELFCORE_SEL == 1))
    {
        if(MW_R5FSS0CORE0_ENABLE_SEL == 1)
            offSetTx += (IPCCores * VringSize);

        if((MW_R5FSS0CORE1_ENABLE_SELFCORE_SEL == 1) && (MW_R5FSS0CORE0_ENABLE_SEL == 1))
        {
            Core1_Tx_Core0_Rx_Core1 = offSetTx;
            offSetTx += VringSize;
        }

        if((MW_R5FSS0CORE1_ENABLE_SELFCORE_SEL == 1) && (MW_R5FSS1CORE0_ENABLE_SEL == 1))
        {
            Core1_Tx_Core2_Rx_Core1 = offSetTx;
            offSetTx += VringSize;
        }

        if((MW_R5FSS0CORE1_ENABLE_SELFCORE_SEL == 1) && (MW_R5FSS1CORE1_ENABLE_SEL == 1))
        {
            Core1_Tx_Core3_Rx_Core1 = offSetTx;
        }

    }
    else if((MW_CPUINFO_CORESELECTION == 2) && (MW_R5FSS1CORE0_ENABLE_SELFCORE_SEL == 1))
    {
        if((MW_R5FSS0CORE0_ENABLE_SEL == 1) && (MW_R5FSS0CORE1_ENABLE_SEL == 1))
            offSetTx += (2 * (IPCCores * VringSize));
        else if((MW_R5FSS0CORE0_ENABLE_SEL == 1) || (MW_R5FSS0CORE1_ENABLE_SEL == 1))
            offSetTx += (IPCCores * VringSize);

        if((MW_R5FSS1CORE0_ENABLE_SELFCORE_SEL == 1) && (MW_R5FSS0CORE0_ENABLE_SEL == 1))
        {
            Core2_Tx_Core0_Rx_Core2 = offSetTx;
            offSetTx += VringSize;
        }

        if((MW_R5FSS1CORE0_ENABLE_SELFCORE_SEL == 1) && (MW_R5FSS0CORE1_ENABLE_SEL == 1))
        {
            Core2_Tx_Core1_Rx_Core2 = offSetTx;
            offSetTx += VringSize;
        }

        if((MW_R5FSS1CORE0_ENABLE_SELFCORE_SEL == 1) && (MW_R5FSS1CORE1_ENABLE_SEL == 1))
        {
            Core2_Tx_Core3_Rx_Core2 = offSetTx;
            offSetTx += VringSize;
        }

    }
    else if((MW_CPUINFO_CORESELECTION == 3) && (MW_R5FSS1CORE1_ENABLE_SELFCORE_SEL == 1))
    {
        if((MW_R5FSS0CORE0_ENABLE_SEL == 1))
            offSetTx += (IPCCores * VringSize);

        if((MW_R5FSS0CORE1_ENABLE_SEL == 1))
            offSetTx += (IPCCores * VringSize);

        if((MW_R5FSS1CORE0_ENABLE_SEL == 1))
            offSetTx += (IPCCores * VringSize);
        

        if((MW_R5FSS1CORE1_ENABLE_SELFCORE_SEL == 1) && (MW_R5FSS0CORE0_ENABLE_SEL == 1))
        {
            Core3_Tx_Core0_Rx_Core3 = offSetTx;
            offSetTx += VringSize;
        }

        if((MW_R5FSS1CORE1_ENABLE_SELFCORE_SEL == 1) && (MW_R5FSS0CORE1_ENABLE_SEL == 1))
        {
            Core3_Tx_Core1_Rx_Core3 = offSetTx;
            offSetTx += VringSize;
        }

        if((MW_R5FSS1CORE1_ENABLE_SELFCORE_SEL == 1) && (MW_R5FSS1CORE0_ENABLE_SEL == 1))
        {
            Core3_Tx_Core2_Rx_Core3 = offSetTx;
            offSetTx += VringSize;
        }

    }


    if(((MW_CPUINFO_CORESELECTION == 0) && (MW_R5FSS0CORE0_ENABLE_SELFCORE_SEL == 1)))
    {
        offSetRx += (IPCCores * VringSize);

        if(MW_R5FSS0CORE1_ENABLE_SEL == 1)
        {
            Core1_Tx_Core0_Rx_Core1 = offSetRx;
            offSetRx += (IPCCores * VringSize);
        }

        if(MW_R5FSS1CORE0_ENABLE_SEL == 1)
        {
            Core2_Tx_Core0_Rx_Core2 = offSetRx;
            offSetRx += (IPCCores * VringSize);
        }

        if(MW_R5FSS1CORE1_ENABLE_SEL == 1)
        {
            Core3_Tx_Core0_Rx_Core3 = offSetRx;
           
        }

    }
    else if(((MW_CPUINFO_CORESELECTION == 1) && (MW_R5FSS0CORE1_ENABLE_SELFCORE_SEL == 1)))
    {

        if(MW_R5FSS0CORE0_ENABLE_SEL == 1)
        {
            Core0_Tx_Core1_Rx_Core0 = offSetRx; 
            offSetRx += (IPCCores * VringSize);
            offSetRx += VringSize;
            offSetRx += (IPCCores * VringSize);
        }
        else
        {
            offSetRx += (IPCCores * VringSize);
        }

        if(MW_R5FSS1CORE0_ENABLE_SEL == 1)
        {
            Core2_Tx_Core1_Rx_Core2 = offSetRx;
            offSetRx += (IPCCores * VringSize);
        }

        if(MW_R5FSS1CORE1_ENABLE_SEL == 1)
        {
            Core3_Tx_Core1_Rx_Core3 = offSetRx;
        }
    }
    else if(((MW_CPUINFO_CORESELECTION == 2) && (MW_R5FSS1CORE0_ENABLE_SELFCORE_SEL == 1)))
    {

        if((MW_R5FSS0CORE0_ENABLE_SEL == 1) && (MW_R5FSS0CORE1_ENABLE_SEL == 1))
        {
            offSetRx += VringSize;
            Core0_Tx_Core2_Rx_Core0 = offSetRx;
            offSetRx += (IPCCores * VringSize);
        }
        else if((MW_R5FSS0CORE0_ENABLE_SEL == 1) && (MW_R5FSS0CORE1_ENABLE_SEL == 0))
        {
            Core0_Tx_Core2_Rx_Core0 = offSetRx;
            offSetRx += (IPCCores * VringSize);
        }

        if(MW_R5FSS0CORE1_ENABLE_SEL == 1)
        {
            Core1_Tx_Core2_Rx_Core1 = offSetRx;
            offSetRx += (IPCCores * VringSize);
            offSetRx += VringSize;
            offSetRx += (IPCCores * VringSize);
        }
        else
        {
            offSetRx += VringSize;
            offSetRx += (IPCCores * VringSize);
        }

