TexasInstruments/am26x-hsp/src/am263x_init.c
        if(MW_R5FSS1CORE1_ENABLE_SEL == 1)
        {
            Core3_Tx_Core2_Rx_Core3 = offSetRx;
        }
    }
    else if(((MW_CPUINFO_CORESELECTION == 3) && (MW_R5FSS1CORE1_ENABLE_SELFCORE_SEL == 1)))
    {

        if((MW_R5FSS0CORE0_ENABLE_SEL == 1) && (MW_R5FSS0CORE1_ENABLE_SEL == 1) && (MW_R5FSS1CORE0_ENABLE_SEL == 1))
        {
            offSetRx += (2 * VringSize);
            Core0_Tx_Core3_Rx_Core0 = offSetRx;
            offSetRx += (IPCCores * VringSize);
        }
        else if(((MW_R5FSS0CORE0_ENABLE_SEL == 1) && (MW_R5FSS0CORE1_ENABLE_SEL == 1) && (MW_R5FSS1CORE0_ENABLE_SEL == 0)) || ((MW_R5FSS0CORE0_ENABLE_SEL == 1) && (MW_R5FSS0CORE1_ENABLE_SEL == 0) && (MW_R5FSS1CORE0_ENABLE_SEL == 1)))
        {
            offSetRx += VringSize;
            Core0_Tx_Core3_Rx_Core0 = offSetRx;
            offSetRx += (IPCCores * VringSize);
        }
        else if((MW_R5FSS0CORE0_ENABLE_SEL == 1) && (MW_R5FSS0CORE1_ENABLE_SEL == 0) && (MW_R5FSS1CORE0_ENABLE_SEL == 0))
        {
            Core0_Tx_Core3_Rx_Core0 = offSetRx;
            offSetRx += (IPCCores * VringSize);
        }
        else if((MW_R5FSS0CORE0_ENABLE_SEL == 0) && (MW_R5FSS0CORE1_ENABLE_SEL == 1))
        {
            if(MW_R5FSS1CORE0_ENABLE_SEL == 1)
                offSetRx += VringSize;   
        }

        if(MW_R5FSS0CORE1_ENABLE_SEL == 1)
        {
            Core1_Tx_Core2_Rx_Core1 = offSetRx;
            offSetRx += (IPCCores * VringSize);
        }

        if(MW_R5FSS1CORE0_ENABLE_SEL == 1)
        {
            Core3_Tx_Core2_Rx_Core3 = offSetRx;
        }
    }
}



void System_init(void)
{
    /* DPL init sets up address transalation unit, on some CPUs this is needed
     * to access SCICLIENT services, hence this needs to happen first
     */
    Dpl_init();
    /* initialize PMU */
    CycleCounterP_init(SOC_getSelfCpuClk());
    PowerClock_init();
    Pinmux_init();
    String str2 = STR(MW_TARGETHARDWARE);
    uint16_t offSetTx = 0U;
    uint8_t numRemoteCores = 0;
    if((MW_ENABLE_MCAN_SEL == 1) && (strcmp(str2, "AM263X ControlCard") == 0))
    {
        I2C_init();
    }

    {
        IpcNotify_Params notifyParams_core0, notifyParams_core1, notifyParams_core2, notifyParams_core3;
        int32_t status, status_rpmsg;


        if((MW_CPUINFO_CORESELECTION == 0) && (MW_R5FSS0CORE0_ENABLE_SELFCORE_SEL == 1))
        {

            /* initialize parameters to default */
            IpcNotify_Params_init(&notifyParams_core0);

            /* specify the priority of IPC Notify interrupt */
            notifyParams_core0.intrPriority = 15U;

            /* specify the core on which this API is called */

            if(MW_R5FSS0CORE1_ENABLE_SEL == 1)
                numRemoteCores++;
            if(MW_R5FSS1CORE0_ENABLE_SEL == 1)   
                numRemoteCores++;
            if(MW_R5FSS1CORE1_ENABLE_SEL == 1)
                numRemoteCores++;
            notifyParams_core0.selfCoreId = CSL_CORE_ID_R5FSS0_0;

            IPCCores = numRemoteCores;

            /* list the cores that will do IPC Notify with this core
            * Make sure to NOT list 'self' core in the list below
            */
            notifyParams_core0.numCores = numRemoteCores;
            if(MW_R5FSS0CORE1_ENABLE_SEL == 1)
                notifyParams_core0.coreIdList[0] = CSL_CORE_ID_R5FSS0_1;
            if(MW_R5FSS1CORE0_ENABLE_SEL == 1) 
                notifyParams_core0.coreIdList[1] = CSL_CORE_ID_R5FSS1_0;
            if(MW_R5FSS1CORE1_ENABLE_SEL == 1)
                notifyParams_core0.coreIdList[2] = CSL_CORE_ID_R5FSS1_1;

            notifyParams_core0.isMailboxIpcEnabled = 0;

            notifyParams_core0.isCrcEnabled = 0;

            notifyParams_core0.isIPCIntrRouter = 0;

            /* initialize the IPC Notify module */
            status = IpcNotify_init(&notifyParams_core0);
            DebugP_assert(status==SystemP_SUCCESS);

            RPMessage_Params rpmsgParamsCore0;
            // int32_t status_rpmsg;

            RPMessage_Params_init(&rpmsgParamsCore0);

            RPMemory_init();

            if(MW_R5FSS0CORE1_ENABLE_SEL == 1)
                rpmsgParamsCore0.vringTxBaseAddr[CSL_CORE_ID_R5FSS0_1] = (uintptr_t)(&gIpcSharedMem[Core0_Tx_Core1_Rx_Core0]);
            if(MW_R5FSS1CORE0_ENABLE_SEL == 1)
                rpmsgParamsCore0.vringTxBaseAddr[CSL_CORE_ID_R5FSS1_0] = (uintptr_t)(&gIpcSharedMem[Core0_Tx_Core2_Rx_Core0]);
            if(MW_R5FSS1CORE1_ENABLE_SEL == 1)
                rpmsgParamsCore0.vringTxBaseAddr[CSL_CORE_ID_R5FSS1_1] = (uintptr_t)(&gIpcSharedMem[Core0_Tx_Core3_Rx_Core0]);

            if(MW_R5FSS0CORE1_ENABLE_SEL == 1)
                rpmsgParamsCore0.vringRxBaseAddr[CSL_CORE_ID_R5FSS0_1] = (uintptr_t)(&gIpcSharedMem[Core1_Tx_Core0_Rx_Core1]);
            if(MW_R5FSS1CORE0_ENABLE_SEL == 1)
                rpmsgParamsCore0.vringRxBaseAddr[CSL_CORE_ID_R5FSS1_0] = (uintptr_t)(&gIpcSharedMem[Core2_Tx_Core0_Rx_Core2]);
            if(MW_R5FSS1CORE1_ENABLE_SEL == 1)
                rpmsgParamsCore0.vringRxBaseAddr[CSL_CORE_ID_R5FSS1_1] = (uintptr_t)(&gIpcSharedMem[Core3_Tx_Core0_Rx_Core3]);


            rpmsgParamsCore0.vringSize = IPC_RPMESSAGE_VRING_SIZE;
            rpmsgParamsCore0.vringNumBuf = MW_RP_NUM_BUFFERS_SEL;
            rpmsgParamsCore0.vringMsgSize = MW_RP_BUFFER_SIZE_SEL;
            rpmsgParamsCore0.isCrcEnabled = 0;

            /* initialize the IPC RP Message module */
            status_rpmsg = RPMessage_init(&rpmsgParamsCore0);
            DebugP_assert(status_rpmsg==SystemP_SUCCESS);
        }
        else if((MW_CPUINFO_CORESELECTION == 1) && (MW_R5FSS0CORE1_ENABLE_SELFCORE_SEL == 1))
        {
            IpcNotify_Params_init(&notifyParams_core1);

            /* specify the priority of IPC Notify interrupt */
            notifyParams_core1.intrPriority = 15U;

            /* specify the core on which this API is called */

            if(MW_R5FSS0CORE0_ENABLE_SEL == 1)
                numRemoteCores++;
            if(MW_R5FSS1CORE0_ENABLE_SEL == 1)   
                numRemoteCores++;
            if(MW_R5FSS1CORE1_ENABLE_SEL == 1)
                numRemoteCores++;
            notifyParams_core1.selfCoreId = CSL_CORE_ID_R5FSS0_1;

            IPCCores = numRemoteCores;

