TexasInstruments/am26x-hsp/src/am263x_init.c
            /* list the cores that will do IPC Notify with this core
            * Make sure to NOT list 'self' core in the list below
            */
            notifyParams_core1.numCores = numRemoteCores;
            if(MW_R5FSS0CORE0_ENABLE_SEL == 1)
                notifyParams_core1.coreIdList[0] = CSL_CORE_ID_R5FSS0_0;
            if(MW_R5FSS1CORE0_ENABLE_SEL == 1) 
                notifyParams_core1.coreIdList[1] = CSL_CORE_ID_R5FSS1_0;
            if(MW_R5FSS1CORE1_ENABLE_SEL == 1)
                notifyParams_core1.coreIdList[2] = CSL_CORE_ID_R5FSS1_1;

            notifyParams_core1.isMailboxIpcEnabled = 0;

            notifyParams_core1.isCrcEnabled = 0;

            notifyParams_core1.isIPCIntrRouter = 0;

            /* initialize the IPC Notify module */
            status = IpcNotify_init(&notifyParams_core1);
            DebugP_assert(status==SystemP_SUCCESS);    

            RPMessage_Params rpmsgParamsCore1;
            // int32_t status;

            /* initialize parameters to default */
            RPMessage_Params_init(&rpmsgParamsCore1);

            RPMemory_init();

            if(MW_R5FSS0CORE0_ENABLE_SEL == 1)
                rpmsgParamsCore1.vringTxBaseAddr[CSL_CORE_ID_R5FSS0_0] = (uintptr_t)(&gIpcSharedMem[Core1_Tx_Core0_Rx_Core1]);
            if(MW_R5FSS1CORE0_ENABLE_SEL == 1)
                rpmsgParamsCore1.vringTxBaseAddr[CSL_CORE_ID_R5FSS1_0] = (uintptr_t)(&gIpcSharedMem[Core1_Tx_Core2_Rx_Core1]);
            if(MW_R5FSS1CORE1_ENABLE_SEL == 1)
                rpmsgParamsCore1.vringTxBaseAddr[CSL_CORE_ID_R5FSS1_1] = (uintptr_t)(&gIpcSharedMem[Core1_Tx_Core3_Rx_Core1]);
            
            /* RX VRINGs */
            if(MW_R5FSS0CORE0_ENABLE_SEL == 1)
                rpmsgParamsCore1.vringRxBaseAddr[CSL_CORE_ID_R5FSS0_0] = (uintptr_t)(&gIpcSharedMem[Core0_Tx_Core1_Rx_Core0]);
            if(MW_R5FSS1CORE0_ENABLE_SEL == 1)
                rpmsgParamsCore1.vringRxBaseAddr[CSL_CORE_ID_R5FSS1_0] = (uintptr_t)(&gIpcSharedMem[Core2_Tx_Core1_Rx_Core2]);
            if(MW_R5FSS1CORE1_ENABLE_SEL == 1)
                rpmsgParamsCore1.vringRxBaseAddr[CSL_CORE_ID_R5FSS1_1] = (uintptr_t)(&gIpcSharedMem[Core3_Tx_Core1_Rx_Core3]);

            rpmsgParamsCore1.vringSize = IPC_RPMESSAGE_VRING_SIZE;
            rpmsgParamsCore1.vringNumBuf = MW_RP_NUM_BUFFERS_SEL;
            rpmsgParamsCore1.vringMsgSize = MW_RP_BUFFER_SIZE_SEL;
            rpmsgParamsCore1.isCrcEnabled = 0;

            /* initialize the IPC RP Message module */
            status_rpmsg = RPMessage_init(&rpmsgParamsCore1);
            DebugP_assert(status_rpmsg==SystemP_SUCCESS);
        }
        else if((MW_CPUINFO_CORESELECTION == 2) && (MW_R5FSS1CORE0_ENABLE_SELFCORE_SEL == 1))
        {
            IpcNotify_Params_init(&notifyParams_core2);

            /* specify the priority of IPC Notify interrupt */
            notifyParams_core2.intrPriority = 15U;

            /* specify the core on which this API is called */

            if(MW_R5FSS0CORE0_ENABLE_SEL == 1)
                numRemoteCores++;
            if(MW_R5FSS0CORE1_ENABLE_SEL == 1)   
                numRemoteCores++;
            if(MW_R5FSS1CORE1_ENABLE_SEL == 1)
                numRemoteCores++;
            notifyParams_core2.selfCoreId = CSL_CORE_ID_R5FSS1_0;
            IPCCores = numRemoteCores;

            /* list the cores that will do IPC Notify with this core
            * Make sure to NOT list 'self' core in the list below
            */
            notifyParams_core2.numCores = numRemoteCores;
            if(MW_R5FSS0CORE0_ENABLE_SEL == 1)
                notifyParams_core2.coreIdList[0] = CSL_CORE_ID_R5FSS0_0;
            if(MW_R5FSS0CORE1_ENABLE_SEL == 1) 
                notifyParams_core2.coreIdList[1] = CSL_CORE_ID_R5FSS0_1;
            if(MW_R5FSS1CORE1_ENABLE_SEL == 1)
                notifyParams_core2.coreIdList[2] = CSL_CORE_ID_R5FSS1_1;

            notifyParams_core2.isMailboxIpcEnabled = 0;

            notifyParams_core2.isCrcEnabled = 0;

            notifyParams_core2.isIPCIntrRouter = 0;

            /* initialize the IPC Notify module */
            status = IpcNotify_init(&notifyParams_core2);
            DebugP_assert(status==SystemP_SUCCESS);   

            RPMessage_Params rpmsgParamsCore2;
            // int32_t status_rpmsg;

            RPMessage_Params_init(&rpmsgParamsCore2);

            RPMemory_init();

            if(MW_R5FSS0CORE0_ENABLE_SEL == 1)
                rpmsgParamsCore2.vringTxBaseAddr[CSL_CORE_ID_R5FSS0_0] = (uintptr_t)(&gIpcSharedMem[Core2_Tx_Core0_Rx_Core2]);
            if(MW_R5FSS0CORE1_ENABLE_SEL == 1)
                rpmsgParamsCore2.vringTxBaseAddr[CSL_CORE_ID_R5FSS0_1] = (uintptr_t)(&gIpcSharedMem[Core2_Tx_Core1_Rx_Core2]);
            if(MW_R5FSS1CORE1_ENABLE_SEL == 1)
                rpmsgParamsCore2.vringTxBaseAddr[CSL_CORE_ID_R5FSS1_1] = (uintptr_t)(&gIpcSharedMem[Core2_Tx_Core3_Rx_Core2]);

            if(MW_R5FSS0CORE0_ENABLE_SEL == 1)
                rpmsgParamsCore2.vringRxBaseAddr[CSL_CORE_ID_R5FSS0_0] = (uintptr_t)(&gIpcSharedMem[Core0_Tx_Core2_Rx_Core0]);
            if(MW_R5FSS0CORE1_ENABLE_SEL == 1)
                rpmsgParamsCore2.vringRxBaseAddr[CSL_CORE_ID_R5FSS0_1] = (uintptr_t)(&gIpcSharedMem[Core1_Tx_Core2_Rx_Core1]);
            if(MW_R5FSS1CORE1_ENABLE_SEL == 1)
                rpmsgParamsCore2.vringRxBaseAddr[CSL_CORE_ID_R5FSS1_1] = (uintptr_t)(&gIpcSharedMem[Core3_Tx_Core2_Rx_Core3]);


            rpmsgParamsCore2.vringSize = IPC_RPMESSAGE_VRING_SIZE;
            rpmsgParamsCore2.vringNumBuf = MW_RP_NUM_BUFFERS_SEL;
            rpmsgParamsCore2.vringMsgSize = MW_RP_BUFFER_SIZE_SEL;
            rpmsgParamsCore2.isCrcEnabled = 0;

            /* initialize the IPC RP Message module */
            status_rpmsg = RPMessage_init(&rpmsgParamsCore2);
            DebugP_assert(status_rpmsg==SystemP_SUCCESS);
        }
        else if((MW_CPUINFO_CORESELECTION == 3) && (MW_R5FSS1CORE1_ENABLE_SELFCORE_SEL == 1))
        {
         
            IpcNotify_Params_init(&notifyParams_core3);

