TexasInstruments/am26x-hsp/src/am263x_init.c
            /* specify the priority of IPC Notify interrupt */
            notifyParams_core3.intrPriority = 15U;

            /* specify the core on which this API is called */

            if(MW_R5FSS0CORE0_ENABLE_SEL == 1)
                numRemoteCores++;
            if(MW_R5FSS0CORE1_ENABLE_SEL == 1)   
                numRemoteCores++;
            if(MW_R5FSS1CORE0_ENABLE_SEL == 1)
                numRemoteCores++;
            notifyParams_core3.selfCoreId = CSL_CORE_ID_R5FSS1_1;

            IPCCores = numRemoteCores;

            /* list the cores that will do IPC Notify with this core
            * Make sure to NOT list 'self' core in the list below
            */
            notifyParams_core3.numCores = numRemoteCores;
            if(MW_R5FSS0CORE0_ENABLE_SEL == 1)
                notifyParams_core3.coreIdList[0] = CSL_CORE_ID_R5FSS0_0;
            if(MW_R5FSS0CORE1_ENABLE_SEL == 1) 
                notifyParams_core3.coreIdList[1] = CSL_CORE_ID_R5FSS0_1;
            if(MW_R5FSS1CORE1_ENABLE_SEL == 1)
                notifyParams_core3.coreIdList[2] = CSL_CORE_ID_R5FSS1_0;

            notifyParams_core3.isMailboxIpcEnabled = 0;

            notifyParams_core3.isCrcEnabled = 0;

            notifyParams_core3.isIPCIntrRouter = 0;

            /* initialize the IPC Notify module */
            status = IpcNotify_init(&notifyParams_core3);
            DebugP_assert(status==SystemP_SUCCESS);  

            RPMessage_Params rpmsgParamsCore3;
            // int32_t status_rpmsg;

            RPMessage_Params_init(&rpmsgParamsCore3);

            RPMemory_init();

            if(MW_R5FSS0CORE0_ENABLE_SEL == 1)
                rpmsgParamsCore3.vringTxBaseAddr[CSL_CORE_ID_R5FSS0_0] = (uintptr_t)(&gIpcSharedMem[Core3_Tx_Core0_Rx_Core3]);
            if(MW_R5FSS0CORE1_ENABLE_SEL == 1)
                rpmsgParamsCore3.vringTxBaseAddr[CSL_CORE_ID_R5FSS0_1] = (uintptr_t)(&gIpcSharedMem[Core3_Tx_Core1_Rx_Core3]);
            if(MW_R5FSS1CORE0_ENABLE_SEL == 1)
                rpmsgParamsCore3.vringTxBaseAddr[CSL_CORE_ID_R5FSS1_0] = (uintptr_t)(&gIpcSharedMem[Core3_Tx_Core2_Rx_Core3]);

            if(MW_R5FSS0CORE0_ENABLE_SEL == 1)
                rpmsgParamsCore3.vringRxBaseAddr[CSL_CORE_ID_R5FSS0_0] = (uintptr_t)(&gIpcSharedMem[Core0_Tx_Core3_Rx_Core0]);
            if(MW_R5FSS0CORE1_ENABLE_SEL == 1)
                rpmsgParamsCore3.vringRxBaseAddr[CSL_CORE_ID_R5FSS0_1] = (uintptr_t)(&gIpcSharedMem[Core1_Tx_Core3_Rx_Core1]);
            if(MW_R5FSS1CORE0_ENABLE_SEL == 1)
                rpmsgParamsCore3.vringRxBaseAddr[CSL_CORE_ID_R5FSS1_0] = (uintptr_t)(&gIpcSharedMem[Core2_Tx_Core3_Rx_Core2]);


            rpmsgParamsCore3.vringSize = IPC_RPMESSAGE_VRING_SIZE;
            rpmsgParamsCore3.vringNumBuf = MW_RP_NUM_BUFFERS_SEL;
            rpmsgParamsCore3.vringMsgSize = MW_RP_BUFFER_SIZE_SEL;
            rpmsgParamsCore3.isCrcEnabled = 0;

            /* initialize the IPC RP Message module */
            status_rpmsg = RPMessage_init(&rpmsgParamsCore3);
            DebugP_assert(status_rpmsg==SystemP_SUCCESS); 
        }

    }
    
   

}

void Drivers_open(void)
{

    String str2 = STR(MW_TARGETHARDWARE);
    if((MW_ENABLE_MCAN_SEL == 1) && (strcmp(str2, "AM263X ControlCard") == 0))
    {
        Drivers_i2cOpen();
    }
    if((MW_ENABLE_MCAN_SEL == 1))
    {
        Driver_mcanOpen();
        MCAN_initialization();
    }
    Drivers_inputXbarOpen();
    Drivers_intXbarOpen();
    Drivers_outputXbarOpen();
    Drivers_epwmSyncoutXbarOpen();
    Drivers_gpioIntXbarOpen();
    Drivers_EPWMXbarOpen();
    Drivers_uartOpen();
    if((MW_ENABLE_MCSPI0_SEL == 1) | (MW_ENABLE_MCSPI1_SEL == 1) | (MW_ENABLE_MCSPI2_SEL == 1) | (MW_ENABLE_MCSPI3_SEL == 1) | (MW_ENABLE_MCSPI4_SEL == 1))
    {
        MCSPI_channel_init();
        MCSPI_object_init();
        Drivers_mcspiOpen();
    }

    
}


void am263x_HardwareInit_Fcn(void)
{

    System_init();
    //Board_init(); //UNUSED
    Drivers_open();
    //Board_driversOpen(); //UNUSED

	return;
}

